[
  {
    "chapter18": {
      "title": "Moksha Sannyasa Yoga (The Yoga of Liberation through Renunciation)",
      "description": "In Chapter 18, Krishna summarizes the Gita’s teachings, explaining renunciation (sannyasa) and relinquishment (tyaga), the influence of gunas on actions, and the paths of karma, jnana, and bhakti yoga, culminating in surrender to the divine for liberation. For Arjuna, this knowledge resolves his war dilemmas, enabling him to fight with detachment, wisdom, and devotion to Krishna, achieving spiritual freedom through righteous action.",
      "total_verses": 78,
      "slok1": {
        "sanskrit": "अर्जुन उवाच। संन्यासस्य महाबाहो तत्त्वमिच्छामि वेदितुम्। त्यागस्य च हृषीकेश पृथक्केशिनिषूदन।।18.1।।",
        "transliteration": "arjuna uvāca sannyāsasya mahā-bāho tattvam icchāmi veditum, tyāgasya ca hṛṣīkeśa pṛthak keśi-niṣūdana",
        "meaning": "Arjuna said: O mighty-armed one, I desire to understand the truth of renunciation (sannyasa) and relinquishment (tyaga), and their distinction, O Hrishikesha, slayer of Kesi.",
        "explanation": "Arjuna seeks clarity on the concepts of sannyasa (renunciation) and tyaga (relinquishment), initiating Chapter 18’s focus on liberation. This sloka reflects his desire to resolve his war-related doubts. For Arjuna, understanding these distinctions is crucial to perform his warrior duties without attachment, ensuring his actions align with Krishna’s teachings for spiritual freedom."
      },
      "slok2": {
        "sanskrit": "श्रीभगवानुवाच। काम्यानां कर्मणां न्यासं संन्यासं कवयो विदुः। सर्वकर्मफलत्यागं प्राहुस्त्यागं विचक्षणाः।।18.2।।",
        "transliteration": "śrī bhagavān uvāca kāmyānāṁ karmaṇāṁ nyāsaṁ sannyāsaṁ kavayo viduḥ, sarva-karma-phala-tyāgaṁ prāhus tyāgaṁ vicakṣaṇāḥ",
        "meaning": "The Supreme Lord said: The renunciation of desire-driven actions is known as sannyasa by the wise, while the relinquishment of the fruits of all actions is called tyaga by the learned.",
        "explanation": "Krishna defines sannyasa as abandoning desire-driven actions and tyaga as giving up attachment to action’s results. This sloka clarifies their distinction. For Arjuna, this means fighting without selfish desires (sannyasa) and offering the war’s outcomes to Krishna (tyaga), ensuring his warrior duties lead to liberation through detachment."
      },
      "slok3": {
        "sanskrit": "त्याज्यं दोषवदित्येके कर्म प्राहुर्मनीषिणः। यज्ञदानतपःकर्म न त्याज्यमिति चापरे।।18.3।।",
        "transliteration": "tyājyaṁ doṣavad ity eke karma prāhur manīṣiṇaḥ, yajña-dāna-tapaḥ-karma na tyājyam iti cāpare",
        "meaning": "Some philosophers say that all actions, being flawed, should be abandoned; others declare that acts of sacrifice, charity, and austerity should not be given up.",
        "explanation": "Krishna presents conflicting views on action: some advocate abandoning all actions due to their imperfections, while others support continuing sacrifice, charity, and austerity. This sloka introduces the debate on action. For Arjuna, this prompts reflection on whether to abandon war, urging him to seek Krishna’s guidance to act righteously without forsaking duty."
      },
      "slok4": {
        "sanskrit": "निश्चयं शृणु मे तत्र त्यागे भरतसत्तम। त्यागो हि पुरुषव्याघ्र त्रिविधः संप्रकीर्तितः।।18.4।।",
        "transliteration": "niścayaṁ śṛṇu me tatra tyāge bharata-sattama, tyāgo hi puruṣa-vyāghra trividhaḥ saṁprakīrtitaḥ",
        "meaning": "Hear My conclusion about relinquishment, O best of the Bharatas; relinquishment, O tiger among men, is declared to be of three kinds.",
        "explanation": "Krishna promises to clarify tyaga, stating it has three types based on the gunas. This sloka sets the stage for detailed analysis. For Arjuna, this assurance guides him to understand how to relinquish war’s outcomes, ensuring his warrior actions align with the right form of tyaga for spiritual liberation."
      },
      "slok5": {
        "sanskrit": "यज्ञदानतपःकर्म न त्याज्यं कार्यमेव तत्। यज्ञो दानं तपश्चैव पावनानि मनीषिणाम्।।18.5।।",
        "transliteration": "yajña-dāna-tapaḥ-karma na tyājyaṁ kāryam eva tat, yajño dānaṁ tapaś caiva pāvanāni manīṣiṇām",
        "meaning": "Acts of sacrifice, charity, and austerity should not be abandoned; they must be performed, as they purify the wise.",
        "explanation": "Krishna asserts that sacrifice, charity, and austerity are purifying and must be continued. This sloka emphasizes their spiritual value. For Arjuna, this implies that his war duties, when performed as a sacrifice to Krishna, purify him, urging him to fight as a sacred act, not to abandon his role."
      },
      "slok6": {
        "sanskrit": "एतान्यपि तु कर्माणि सङ्गं त्यक्त्वा फलानि च। कर्तव्यमिति मे पार्थ निश्चितं मतमुत्तमम्।।18.6।।",
        "transliteration": "etāny api tu karmāṇi saṅgaṁ tyaktvā phalāni ca, kartavyam iti me pārtha niścitaṁ matam uttamam",
        "meaning": "Even these acts should be performed without attachment and desire for results; this, O Partha, is My firm and supreme opinion.",
        "explanation": "Krishna advises performing sacrifice, charity, and austerity without attachment to results. This sloka reinforces detached action. For Arjuna, this means fighting without clinging to personal gain or outcomes, ensuring his warrior duties are selfless acts of duty, aligning with Krishna’s path to liberation."
      },
      "slok7": {
        "sanskrit": "नियतस्य तु संन्यासः कर्मणो नोपपद्यति। यदृच्छया तु तस्य न्यासः तामस उच्यते।।18.7।।",
        "transliteration": "niyatasya tu sannyāsaḥ karmaṇo nopapadyati, yadṛcchayā tu tasya nyāsaḥ tāmasa ucyate",
        "meaning": "The renunciation of prescribed duties is not proper; abandoning them due to delusion is said to be tamasic.",
        "explanation": "Krishna warns that abandoning obligatory duties due to ignorance is tamasic renunciation. This sloka critiques improper sannyasa. For Arjuna, this cautions against shirking his warrior duties out of confusion, urging him to fight as a prescribed duty, avoiding tamasic abandonment for spiritual integrity."
      },
      "slok8": {
        "sanskrit": "दुःखमित्येव यत्कर्म कायक्लेशभयात्त्यजेत्। स कृत्वा राजसं त्यागं नैव त्यागफलं लभेत्।।18.8।।",
        "transliteration": "duḥkham ity eva yat karma kāya-kleśa-bhayāt tyajet, sa kṛtvā rājasaṁ tyāgaṁ naiva tyāga-phalaṁ labhet",
        "meaning": "One who abandons action due to pain or fear of physical hardship performs rajasic relinquishment and does not gain the fruit of relinquishment.",
        "explanation": "Krishna describes rajasic tyaga as abandoning duties due to discomfort or fear, which yields no spiritual benefit. This sloka critiques selfish motives. For Arjuna, this warns against avoiding war due to its hardships, urging him to fight with courage, ensuring his actions align with higher spiritual goals."
      },
      "slok9": {
        "sanskrit": "कार्यमित्येव यत्कर्म नियतं क्रियतेऽर्जुन। सङ्गं त्यक्त्वा फलं चैव स त्यागः सात्त्विको मतः।।18.9।।",
        "transliteration": "kāryam ity eva yat karma niyataṁ kriyate ’rjuna, saṅgaṁ tyaktvā phalaṁ caiva sa tyāgaḥ sāttviko mataḥ",
        "meaning": "When prescribed duties are performed as obligatory, O Arjuna, abandoning attachment and desire for results, that relinquishment is considered sattvic.",
        "explanation": "Krishna defines sattvic tyaga as performing duties without attachment to results, driven by duty. This sloka outlines ideal relinquishment. For Arjuna, this means fighting as a duty to Krishna, detached from personal gain, ensuring his warrior actions are sattvic, leading to spiritual liberation."
      },
      "slok10": {
        "sanskrit": "न द्वेष्टि अकुशलं कर्म कुशले नानुषज्जति। त्यागी सत्त्वसमाविष्टो मेधावी छिन्नसंशयः।।18.10।।",
        "transliteration": "na dveṣṭi akuśalaṁ karma kuśale nānuṣajjati, tyāgī sattva-samāviṣṭo medhāvī chinna-saṁśayaḥ",
        "meaning": "The relinquisher endowed with sattva, intelligent, and free from doubts neither hates inauspicious work nor is attached to auspicious work.",
        "explanation": "Krishna describes a sattvic relinquisher as impartial to favorable or unfavorable tasks, wise, and doubt-free. This sloka highlights equanimity. For Arjuna, this means embracing war’s challenges without aversion or attachment, fighting with clarity and wisdom, ensuring his actions reflect sattvic detachment and resolve."
      },
      "slok11": {
        "sanskrit": "न हि देहभृता शक्यं त्यक्तुं कर्माण्यशेषतः। यस्तु कर्मफलत्यागी स त्यागीत्यभिधीयते।।18.11।।",
        "transliteration": "na hi deha-bhṛtā śakyaṁ tyaktuṁ karmāṇy aśeṣataḥ, yas tu karma-phala-tyāgī sa tyāgīty abhidhīyate",
        "meaning": "It is impossible for an embodied being to abandon all actions completely, but one who relinquishes the fruits of action is called a true relinquisher.",
        "explanation": "Krishna explains that complete abandonment of action is impossible for embodied beings, but true tyaga lies in giving up results. This sloka redefines renunciation. For Arjuna, this assures that fighting is inevitable, but relinquishing war’s outcomes makes him a true tyagi, aligning his duties with liberation."
      },
      "slok12": {
        "sanskrit": "अनिष्टमिष्टं मिश्रं च त्रिविधं कर्मणः फलम्। भवत्यत्यागिनाम् प्रेत्य न तु संन्यासिनां क्वचित्।।18.12।।",
        "transliteration": "aniṣṭam iṣṭaṁ miśraṁ ca trividhaṁ karmaṇaḥ phalam, bhavaty atyāginām pretya na tu sannyāsināṁ kvacit",
        "meaning": "The threefold fruit of action—undesirable, desirable, and mixed—accrues after death to non-relinquishers, but never to relinquishers.",
        "explanation": "Krishna states that non-relinquishers face varied karmic fruits after death, while true relinquishers escape them. This sloka emphasizes tyaga’s benefit. For Arjuna, this motivates fighting without attachment to outcomes, ensuring he avoids karmic bondage, achieving liberation through detached warrior duties."
      },
      "slok13": {
        "sanskrit": "पञ्चैतानि महाबाहो कारणानि निबोध मे। साङ्ख्ये कृतान्ते प्रोक्तानि सिद्धये सर्वकर्मणाम्।।18.13।।",
        "transliteration": "pañcaitāni mahā-bāho kārāṇāni nibodha me, sāṅkhye kṛtānte proktāni siddhaye sarva-karmaṇām",
        "meaning": "Learn from Me, O mighty-armed, these five factors for the accomplishment of all actions, as declared in Sankhya philosophy.",
        "explanation": "Krishna introduces the five factors causing action, as per Sankhya, shifting focus to the mechanics of karma. This sloka sets up the analysis of action. For Arjuna, understanding these factors clarifies that his war actions are not solely his, enabling him to fight with detachment, attributing outcomes to cosmic forces."
      },
      "slok14": {
        "sanskrit": "अधिष्ठानं तथा कर्ता करणं च पृथग्विधम्। विविधाश्च पृथक्चेष्टा दैवं चैवात्र पञ्चमम्।।18.14।।",
        "transliteration": "adhiṣṭhānaṁ tathā kartā karaṇaṁ ca pṛthag-vidham, vividhāś ca pṛthak-ceṣṭā daivaṁ caivātra pañcamam",
        "meaning": "The seat (body), the doer (ego), the instruments (senses), the various functions, and the fifth, divine providence—these are the five factors.",
        "explanation": "Krishna lists the five factors of action: body, ego, senses, efforts, and divine will. This sloka details action’s components. For Arjuna, this reveals that his war efforts involve multiple factors, not just his will, urging him to fight as an instrument of divine providence, detached from ego."
      },
      "slok15": {
        "sanskrit": "शरीरवाङ्मनोभिर्यत्कर्म प्रारभति नरः। न्याय्यं वा विपरीतं वा पञ्चैते तस्य हेतवः।।18.15।।",
        "transliteration": "śarīra-vāṅ-manobhir yat karma prārabhati naraḥ, nyāyyaṁ vā viparītaṁ vā pañcaite tasya hetavaḥ",
        "meaning": "Whatever action a person undertakes with body, speech, or mind, whether right or wrong, these five are its causes.",
        "explanation": "Krishna states that all actions, righteous or not, stem from the five factors. This sloka universalizes the causation model. For Arjuna, this means his war actions, whether just or challenging, arise from these factors, encouraging him to act without ego, offering outcomes to Krishna’s divine will."
      },
      "slok16": {
        "sanskrit": "तत्रैवं सति कर्तारमात्मानं केवलं तु यः। पश्यत्यकृतबुद्धित्वान्न स पश्यति दुर्मतिः।।18.16।।",
        "transliteration": "tatraivaṁ sati kartāram ātmānaṁ kevalaṁ tu yaḥ, paśyaty akṛta-buddhitvān na sa paśyati durmatiḥ",
        "meaning": "Despite this, one who, due to untrained intellect, sees the self as the sole doer, that misguided person does not truly see.",
        "explanation": "Krishna warns that mistaking the self as the sole doer reflects ignorance. This sloka critiques ego-centric views. For Arjuna, this teaches that he is not the sole doer in war, urging him to fight without ego, recognizing the five factors and divine will, ensuring detached, wise action."
      },
      "slok17": {
        "sanskrit": "यस्य नाहङ्कृतो भावो बुद्धिर्यस्य न लिप्यते। हत्वाऽपि स इमाँल्लोकान्न हन्ति न निबध्यते।।18.17।।",
        "transliteration": "yasya nāhaṅkṛto bhāvo buddhir yasya na lipyate, hatvā ’pi sa imāṁl lokān na hanti na nibadhyate",
        "meaning": "One who is free from ego, whose intellect is unattached, though slaying these beings, does not slay and is not bound.",
        "explanation": "Krishna explains that a non-egoistic, unattached person incurs no karmic bondage, even in killing. This sloka emphasizes liberation through detachment. For Arjuna, this assures that fighting without ego or attachment frees him from war’s karmic consequences, enabling righteous action as Krishna’s instrument."
      },
      "slok18": {
        "sanskrit": "ज्ञानं ज्ञेयं परिज्ञाता त्रिविधा कर्मचोदना। करणं कर्म कर्तेति त्रिविधः कर्मसङ्ग्रहः।।18.18।।",
        "transliteration": "jñānaṁ jñeyaṁ parijñātā trividhā karma-codanā, karaṇaṁ karma karteti trividhaḥ karma-saṅgrahaḥ",
        "meaning": "Knowledge, the object of knowledge, and the knower are the threefold impulse to action; the instrument, the action, and the doer are the threefold basis of action.",
        "explanation": "Krishna outlines the triads driving action: knowledge, its object, and the knower; and the instrument, action, and doer. This sloka analyzes action’s framework. For Arjuna, this clarifies the components of war, urging him to act with pure knowledge and as a divine instrument, ensuring detached, effective duty."
      },
      "slok19": {
        "sanskrit": "ज्ञानं कर्म च कर्ता च त्रिधैव गुणभेदतः। प्रोच्यते गुणसङ्ख्याने यथावच्छृणु तान्यपि।।18.19।।",
        "transliteration": "jñānaṁ karma ca kartā ca tridhaiva guṇa-bhedataḥ, procyate guṇa-saṅkhyāne yathāvac chṛṇu tāny api",
        "meaning": "Knowledge, action, and the doer are declared to be of three kinds, according to the gunas, as per the science of gunas; hear about them as they are.",
        "explanation": "Krishna introduces the classification of knowledge, action, and doer based on sattva, rajas, and tamas. This sloka sets up guna-based analysis. For Arjuna, this helps discern how gunas influence his war-related knowledge and actions, urging him to cultivate sattvic qualities for righteous, liberated duty."
      },
      "slok20": {
        "sanskrit": "सर्वभूतेषु येनैकं भावमव्ययमीक्षते। अविभक्तं विभक्तेषु तज्ज्ञानं विद्धि सात्त्विकम्।।18.20।।",
        "transliteration": "sarva-bhūteṣu yenaikaṁ bhāvam avyayam īkṣate, avibhaktaṁ vibhakteṣu taj jñānaṁ viddhi sāttvikam",
        "meaning": "The knowledge by which one sees the imperishable reality in all beings, undivided in the divided, know that to be sattvic.",
        "explanation": "Krishna defines sattvic knowledge as perceiving the unified, eternal essence in all beings despite apparent differences. This sloka describes pure wisdom. For Arjuna, this knowledge enables him to see all warriors as divine souls, fighting without hatred, ensuring his actions are sattvic and spiritually aligned."
      },
      "slok21": {
        "sanskrit": "पृथक्त्वेन तु यज्ज्ञानं नानाभावान्पृथग्विधान्। वेत्ति सर्वं भूतेषु तज्ज्ञानं विद्धि राजसम्।।18.21।।",
        "transliteration": "pṛthaktvena tu yaj jñānaṁ nānā-bhāvān pṛthag-vidhān, vetti sarvaṁ bhūteṣu taj jñānaṁ viddhi rājasam",
        "meaning": "The knowledge that sees various distinct entities in all beings, perceiving them as separate, know that to be rajasic.",
        "explanation": "Krishna describes rajasic knowledge as seeing beings as separate and diverse, lacking unity. This sloka highlights its fragmented nature. For Arjuna, rajasic knowledge may cause division among warriors, urging him to transcend it, fighting with sattvic unity, seeing all as part of Krishna’s essence."
      },
      "slok22": {
        "sanskrit": "यत्तु कृत्स्नवदेकस्मिन्कार्ये सक्तमहैतुकम्। अतत्त्वार्थवदल्पं च तत्तामसमुदाहृतम्।।18.22।।",
        "transliteration": "yat tu kṛtsnavad ekasmin kārye saktam ahaitukam, atattvārthavad alpaṁ ca tat tāmasam udāhṛtam",
        "meaning": "The knowledge that clings to one task as if it were all, without reason, without truth, and narrow, is said to be tamasic.",
        "explanation": "Krishna defines tamasic knowledge as narrow, irrational, and fixated on a single aspect, missing reality. This sloka critiques its ignorance. For Arjuna, tamasic knowledge may lead to obsession with war’s minor details, urging him to adopt sattvic wisdom, fighting with broad, truthful understanding."
      },
      "slok23": {
        "sanskrit": "नियतं सङ्गरहितमरागद्वेषतः कृतम्। अफलप्रेप्सुना कर्म यत्तत्सात्त्विकमुच्यते।।18.23।।",
        "transliteration": "niyataṁ saṅga-rahitam arāga-dveṣataḥ kṛtam, aphala-prepsunā karma yat tat sāttvikam ucyate",
        "meaning": "The action performed as a duty, without attachment, without desire or aversion, by one not seeking its fruit, is said to be sattvic.",
        "explanation": "Krishna describes sattvic action as dutiful, detached, and free from desire or aversion. This sloka defines ideal action. For Arjuna, this means fighting as a duty to Krishna, without attachment to victory or aversion to loss, ensuring his warrior actions are sattvic, leading to liberation."
      },
      "slok24": {
        "sanskrit": "यत्तु कामेप्सुना कर्म साहङ्कारेण वा पुनः। क्रियते बहुलायासं तद्राजसमुदाहृतम्।।18.24।।",
        "transliteration": "yat tu kāmepsunā karma sāhaṅkāreṇa vā punaḥ, kriyate bahulāyāsaṁ tad rājasam udāhṛtam",
        "meaning": "The action performed with desire, ego, and great effort is said to be rajasic.",
        "explanation": "Krishna defines rajasic action as driven by desire, ego, and excessive effort. This sloka highlights its selfish nature. For Arjuna, this warns against fighting for personal gain or pride, urging him to transcend rajasic motives, ensuring his war efforts are sattvic, focused on duty to Krishna."
      },
      "slok25": {
        "sanskrit": "अनुबन्धं क्षयं हिंसामनपेक्ष्य च पौरुषम्। मोहादारभ्यते कर्म यत्तत्तामसमुच्यते।।18.25।।",
        "transliteration": "anubandhaṁ kṣayaṁ hiṁsām anapekṣya ca pauruṣam, mohād ārabhyate karma yat tat tāmasam ucyate",
        "meaning": "The action undertaken out of delusion, without regard for consequences, loss, injury, or capacity, is said to be tamasic.",
        "explanation": "Krishna describes tamasic action as deluded, ignoring consequences, harm, or capability. This sloka critiques its recklessness. For Arjuna, this cautions against impulsive or harmful war tactics, urging him to act with sattvic deliberation, ensuring his warrior duties are thoughtful, non-violent in intent, and aligned with Krishna’s wisdom."
      },
      "slok26": {
        "sanskrit": "मुक्तसङ्गोऽनहंवादी धृत्युत्साहसमन्वितः। सिद्ध्यसिद्ध्योर्निर्विकारः कर्ता सात्त्विक उच्यते।।18.26।।",
        "transliteration": "mukta-saṅgo ’nahaṁ-vādī dhṛty-utsāha-samanvitaḥ, siddhy-asiddhyor nirvikāraḥ kartā sāttvika ucyate",
        "meaning": "The doer who is free from attachment, free from egoism, endowed with resolve and enthusiasm, and unaffected by success or failure, is called sattvic.",
        "explanation": "Krishna describes a sattvic doer as detached, egoless, resolute, and equanimous in success or failure. This sloka defines the ideal agent of action. For Arjuna, adopting these qualities ensures he fights without attachment to victory or defeat, with steady resolve, aligning his warrior duties with sattvic purity for spiritual liberation."
      },
      "slok27": {
        "sanskrit": "रागी कर्मफलप्रेप्सुर्लुब्धो हिंसात्मकः अशुचिः। हर्षशोकान्वितः कर्ता राजसः परिकीर्तितः।।18.27।।",
        "transliteration": "rāgī karma-phala-prepsur lubdho hiṁsātmakaḥ aśuciḥ, harṣa-śokānvitaḥ kartā rājasaḥ parikīrtitaḥ",
        "meaning": "The doer who is passionate, desires the fruits of action, greedy, violent, impure, and swayed by joy or sorrow, is called rajasic.",
        "explanation": "Krishna describes a rajasic doer as driven by desire, greed, and violence, emotionally unstable. This sloka highlights flawed agency. For Arjuna, this warns against fighting with greed for glory or emotional swings, urging him to transcend rajasic tendencies, ensuring his war efforts are pure and sattvic."
      },
      "slok28": {
        "sanskrit": "अयुक्तः प्राकृतः स्तब्धः शठो नैष्कृतिकोऽलसः। विषादी दीर्घसूत्री च कर्ता तामस उच्यते।।18.28।।",
        "transliteration": "ayuktaḥ prākṛtaḥ stabdhaḥ śaṭho naiṣkṛtiko ’lasaḥ, viṣādī dīrgha-sūtrī ca kartā tāmasa ucyate",
        "meaning": "The doer who is undisciplined, vulgar, stubborn, deceitful, malicious, lazy, despondent, and procrastinating is called tamasic.",
        "explanation": "Krishna describes a tamasic doer as undisciplined, deceitful, and lazy, prone to despair and delay. This sloka critiques ignorant agency. For Arjuna, this cautions against procrastination or malice in war, urging him to act with discipline and sincerity, ensuring his warrior duties reflect sattvic commitment."
      },
      "slok29": {
        "sanskrit": "बुद्धेर्भेदं धृतेश्चैव गुणतस्त्रिविधं शृणु। प्रोच्यमानमशेषेण पृथक्त्वेन धनञ्जय।।18.29।।",
        "transliteration": "buddher bhedaṁ dhṛteś caiva guṇatas trividhaṁ śṛṇu, procyamānam aśeṣeṇa pṛthaktvena dhanañjaya",
        "meaning": "Hear now, O Dhananjaya, the threefold distinction of intellect and resolve according to the gunas, explained fully and distinctly.",
        "explanation": "Krishna introduces the classification of intellect and resolve based on the gunas, continuing the guna-based analysis. This sloka sets up their detailed description. For Arjuna, understanding these distinctions helps him cultivate sattvic intellect and resolve in war, ensuring wise and steadfast warrior actions."
      },
      "slok30": {
        "sanskrit": "प्रवृत्तिं च निवृत्तिं च कार्याकार्ये भयाभये। बन्धं मोक्षं च या वेत्ति बुद्धिः सा पार्थ सात्त्विकी।।18.30।।",
        "transliteration": "pravṛttiṁ ca nivṛttiṁ ca kāryākārye bhayābhaye, bandhaṁ mokṣaṁ ca yā vetti buddhiḥ sā pārtha sāttvikī",
        "meaning": "The intellect that rightly discerns action and inaction, duty and what is not, fear and fearlessness, bondage and liberation, O Partha, is sattvic.",
        "explanation": "Krishna defines sattvic intellect as discerning right action, duty, and the path to liberation. This sloka highlights wise understanding. For Arjuna, a sattvic intellect enables him to distinguish his warrior duties from wrongful actions, fighting fearlessly for dharma, ensuring liberation through informed decisions."
      },
      "slok31": {
        "sanskrit": "यया धर्ममधर्मं च कार्यं चाकार्यमेव च। अयथावत्प्रजानाति बुद्धिः सा पार्थ राजसी।।18.31।।",
        "transliteration": "yayā dharmam adharmaṁ ca kāryaṁ cākāryam eva ca, ayathāvat prajānāti buddhiḥ sā pārtha rājasī",
        "meaning": "The intellect that wrongly discerns dharma and adharma, duty and what is not, O Partha, is rajasic.",
        "explanation": "Krishna describes rajasic intellect as misjudging dharma and duty, leading to flawed decisions. This sloka critiques partial understanding. For Arjuna, this warns against misinterpreting his war duties, urging him to seek Krishna’s guidance for sattvic clarity, ensuring righteous and effective action."
      },
      "slok32": {
        "sanskrit": "अधर्मं धर्ममिति या मन्यते तमसावृता। सर्वार्थान्विपरीतांश्च बुद्धिः सा पार्थ तामसी।।18.32।।",
        "transliteration": "adharmaṁ dharmam iti yā manyate tamasāvṛtā, sarvārthān viparītāṁś ca buddhiḥ sā pārtha tāmasī",
        "meaning": "The intellect that, enveloped by ignorance, mistakes adharma for dharma and perceives all things perversely, O Partha, is tamasic.",
        "explanation": "Krishna defines tamasic intellect as completely misguided, mistaking wrong for right. This sloka condemns ignorant judgment. For Arjuna, this cautions against deluded decisions in war, urging him to cultivate sattvic intellect through Krishna’s teachings, ensuring his actions uphold dharma, not adharma."
      },
      "slok33": {
        "sanskrit": "धृत्या यया धारयति मनःप्राणेन्द्रियक्रियाः। योगेनाव्यभिचारिण्या धृतिः सा पार्थ सात्त्विकी।।18.33।।",
        "transliteration": "dhṛtyā yayā dhārayati manaḥ-prāṇendriya-kriyāḥ, yogena avyabhicāriṇyā dhṛtiḥ sā pārtha sāttvikī",
        "meaning": "The resolve by which one sustains the activities of mind, prana, and senses through unwavering yoga, O Partha, is sattvic.",
        "explanation": "Krishna describes sattvic resolve as steady, controlling mind and senses through disciplined yoga. This sloka highlights steadfastness. For Arjuna, sattvic resolve ensures he remains focused and disciplined in battle, sustaining his warrior duties with unwavering devotion to Krishna, leading to spiritual stability."
      },
      "slok34": {
        "sanskrit": "यया तु धर्मकामार्थान् धृत्या धारयतेऽर्जुन। प्रसङ्गेन फलाकाङ्क्षी धृतिः सा पार्थ राजसी।।18.34।।",
        "transliteration": "yayā tu dharma-kāmārthān dhṛtyā dhārayate ’rjuna, prasaṅgena phalākāṅkṣī dhṛtiḥ sā pārtha rājasī",
        "meaning": "The resolve by which one holds to dharma, desire, and wealth, desiring their fruits, O Partha, is rajasic.",
        "explanation": "Krishna describes rajasic resolve as pursuing dharma, pleasure, and wealth with attachment to results. This sloka critiques selfish perseverance. For Arjuna, this warns against fighting for personal gain, urging him to adopt sattvic resolve, ensuring his war efforts are selfless and devoted to Krishna."
      },
      "slok35": {
        "sanskrit": "यया स्वप्नं भयं शोकं विषादं मदमेव च। न विमुञ्चति दुर्मेधा धृतिः सा पार्थ तामसी।।18.35।।",
        "transliteration": "yayā svapnaṁ bhayaṁ śokaṁ viṣādaṁ madam eva ca, na vimuñcati durmedhā dhṛtiḥ sā pārtha tāmasī",
        "meaning": "The resolve by which a foolish person clings to sleep, fear, grief, despair, and pride, O Partha, is tamasic.",
        "explanation": "Krishna defines tamasic resolve as clinging to negative states like fear and despair. This sloka condemns ignorant persistence. For Arjuna, this cautions against succumbing to fear or grief in war, urging sattvic resolve to maintain clarity and courage, aligning his duties with divine purpose."
      },
      "slok36": {
        "sanskrit": "सुखं त्विदानीं त्रिविधं शृणु मे भरतर्षभ। अभ्यासाद् रमते यत्र दुःखान्तं च निगच्छति।।18.36।।",
        "transliteration": "sukhaṁ tv idānīṁ trividhaṁ śṛṇu me bharatarṣabha, abhyāsād ramate yatra duḥkhāntaṁ ca nigacchati",
        "meaning": "Now hear from Me, O bull among Bharatas, about the three kinds of happiness, wherein one delights through practice and attains the end of suffering.",
        "explanation": "Krishna introduces the threefold nature of happiness based on gunas, promising relief from suffering through practice. This sloka sets up happiness’s analysis. For Arjuna, understanding these helps him seek sattvic happiness in war, ensuring his actions lead to lasting peace, not temporary pleasure."
      },
      "slok37": {
        "sanskrit": "यत्तदग्रे विषमिव परिणामेऽमृतोपमम्। तत्सुखं सात्त्विकं प्रोक्तमात्मबुद्धिप्रसादजम्।।18.37।।",
        "transliteration": "yat tad agre viṣam iva pariṇāme ’mṛtopamam, tat sukhaṁ sāttvikaṁ proktam ātma-buddhi-prasādajam",
        "meaning": "The happiness that seems like poison at first but is like nectar in the end, born of clear understanding of the self, is said to be sattvic.",
        "explanation": "Krishna describes sattvic happiness as initially challenging but ultimately liberating, arising from self-realization. This sloka highlights its enduring nature. For Arjuna, this means embracing the war’s initial hardships for spiritual growth, ensuring his duties yield lasting sattvic joy through Krishna’s wisdom."
      },
      "slok38": {
        "sanskrit": "विषयेन्द्रियसंयोगाद् यत्तदग्रेऽमृतोपमम्। परिणामे विषमिव तत्सुखं राजसं स्मृतम्।।18.38।।",
        "transliteration": "viṣayendriya-saṁyogād yat tad agre ’mṛtopamam, pariṇāme viṣam iva tat sukhaṁ rājasaṁ smṛtam",
        "meaning": "The happiness that arises from contact of senses with objects, like nectar at first but poison in the end, is said to be rajasic.",
        "explanation": "Krishna describes rajasic happiness as fleeting, derived from sensory pleasure but leading to suffering. This sloka critiques its temporality. For Arjuna, this warns against seeking war’s sensory thrills (e.g., victory’s glory), urging him to pursue sattvic happiness, ensuring actions align with lasting spiritual goals."
      },
      "slok39": {
        "sanskrit": "यदग्रे चानुबन्धे च सुखं मोहनमात्मनः। निद्रालस्यप्रमादोत्थं तत्तामसमुदाहृतम्।।18.39।।",
        "transliteration": "yad agre cānubandhe ca sukhaṁ mohanam ātmanaḥ, nidrālasya-pramādotthaṁ tat tāmasam udāhṛtam",
        "meaning": "The happiness that deludes the self at first and in consequence, arising from sleep, laziness, and negligence, is said to be tamasic.",
        "explanation": "Krishna defines tamasic happiness as delusive, stemming from inertia and negligence. This sloka condemns its ignorance. For Arjuna, this cautions against lethargy or delusion in war, urging him to seek sattvic happiness through disciplined action, ensuring his warrior duties are clear and purposeful."
      },
      "slok40": {
        "sanskrit": "न तदस्ति पृथिव्यां वा दिवि देवेषु वा पुनः। सत्त्वं प्रकृतिजैर्मुक्तं यदेभिः स्यात्त्रिभिर्गुणैः।।18.40।।",
        "transliteration": "na tad asti pṛthivyāṁ vā divi deveṣu vā punaḥ, sattvaṁ prakṛti-jair muktaṁ yad ebhiḥ syāt tribhir guṇaiḥ",
        "meaning": "There is no being on earth, or among the gods in heaven, that is free from these three gunas born of Prakriti.",
        "explanation": "Krishna states that all beings are influenced by the three gunas, as they arise from Prakriti. This sloka emphasizes the gunas’ universal impact. For Arjuna, this underscores that his war actions are shaped by gunas, urging him to transcend them through sattvic devotion to Krishna, aiming for liberation."
      },
      "slok41": {
        "sanskrit": "ब्राह्मणक्षत्रियविशां शूद्राणां च परंतप। कर्माणि प्रविभक्तानि स्वभावप्रभवैर्गुणैः।।18.41।।",
        "transliteration": "brāhmaṇa-kṣatriya-viśāṁ śūdrāṇāṁ ca paraṁtapa, karmāṇi pravibhaktāni svabhāva-prabhavair guṇaiḥ",
        "meaning": "The duties of brahmins, kshatriyas, vaishyas, and shudras, O scorcher of foes, are divided according to the gunas born of their nature.",
        "explanation": "Krishna explains that varna duties are determined by gunas inherent to one’s nature. This sloka introduces varna-based duties. For Arjuna, as a kshatriya, this affirms his duty to fight, guided by sattvic gunas, ensuring his war actions align with his natural role for spiritual progress."
      },
      "slok42": {
        "sanskrit": "शमो दमस्तपः शौचं क्षान्तिरार्जवमेव च। ज्ञानं विज्ञानमास्तिक्यं ब्रह्मकर्म स्वभावजम्।।18.42।।",
        "transliteration": "śamo damas tapaḥ śaucaṁ kṣāntir ārjavam eva ca, jñānaṁ vijñānam āstikyaṁ brahma-karma svabhāvajam",
        "meaning": "Control of mind, senses, austerity, purity, forgiveness, simplicity, knowledge, realization, and faith—these are the duties of brahmins, born of their nature.",
        "explanation": "Krishna lists brahmin duties, emphasizing sattvic qualities like knowledge and purity. This sloka defines their role. For Arjuna, understanding brahmin duties highlights the need for wisdom and purity in war, complementing his kshatriya role, ensuring his actions are informed by sattvic principles."
      },
      "slok43": {
        "sanskrit": "शौर्यं तेजो धृतिर्दाक्ष्यं युद्धे चाप्यपलायनम्। दानमीश्वरभावश्च क्षात्रं कर्म स्वभावजम्।।18.43।।",
        "transliteration": "śauryaṁ tejo dhṛtir dākṣyaṁ yuddhe cāpy apalāyanam, dānam īśvara-bhāvaś ca kṣātraṁ karma svabhāvajam",
        "meaning": "Valor, splendor, resolve, skill, not fleeing from battle, generosity, and leadership—these are the duties of kshatriyas, born of their nature.",
        "explanation": "Krishna outlines kshatriya duties, emphasizing courage, leadership, and steadfastness in battle. This sloka directly applies to Arjuna’s role. For Arjuna, this affirms his duty to fight with valor and skill, never fleeing, ensuring his war actions reflect kshatriya dharma, guided by sattvic resolve for liberation."
      },
      "slok44": {
        "sanskrit": "कृषिगौरक्ष्यवाणिज्यं वैश्यकर्म स्वभावजम्। परिचर्यात्मकं कर्म शूद्रस्यापि स्वभावजम्।।18.44।।",
        "transliteration": "kṛṣi-gaurakṣya-vāṇijyaṁ vaiśya-karma svabhāvajam, paricaryātmakaṁ karma śūdrasyāpi svabhāvajam",
        "meaning": "Agriculture, cow protection, and trade are the duties of vaishyas, born of their nature; service-oriented work is the duty of shudras, born of their nature.",
        "explanation": "Krishna defines vaishya and shudra duties, focusing on economic and service roles. This sloka completes varna duties. For Arjuna, understanding these roles contextualizes his kshatriya duty, urging him to fight as his natural role, supporting societal harmony, aligned with Krishna’s divine order."
      },
      "slok45": {
        "sanskrit": "स्वे स्वे कर्मण्यभिरतः संसिद्धिं लभते नरः। स्वकर्मनिरतः सिद्धिं यथा विन्दति तच्छृणु।।18.45।।",
        "transliteration": "sve sve karmaṇy abhirataḥ saṁsiddhiṁ labhate naraḥ, sva-karma-nirataḥ siddhiṁ yathā vindati tac chṛṇu",
        "meaning": "By being devoted to one’s own duty, a person attains perfection. Hear now how one devoted to their duty achieves perfection.",
        "explanation": "Krishna states that performing one’s duty leads to perfection, introducing its method. This sloka emphasizes duty’s role in liberation. For Arjuna, this assures that fighting as a kshatriya brings spiritual success, urging him to engage in war with devotion, following Krishna’s path to perfection."
      },
      "slok46": {
        "sanskrit": "यतः प्रवृत्तिर्भूतानां येन सर्वमिदं ततम्। स्वकर्मणा तमभ्यर्च्य सिद्धिं विन्दति मानवः।।18.46।।",
        "transliteration": "yataḥ pravṛttir bhūtānāṁ yena sarvam idaṁ tatam, sva-karmanā tam abhyarcya siddhiṁ vindati mānavaḥ",
        "meaning": "By worshipping Him, from whom all beings originate and by whom all is pervaded, through one’s own duty, a person attains perfection.",
        "explanation": "Krishna explains that performing duty as worship to the all-pervading divine leads to perfection. This sloka connects duty to devotion. For Arjuna, this means fighting as an offering to Krishna, ensuring his war duties are acts of worship, leading to spiritual liberation through divine connection."
      },
      "slok47": {
        "sanskrit": "श्रेयान् स्वधर्मो विगुणः परधर्मात् स्वनुष्ठितात्। स्वभावनियतं कर्म कुर्वन्नाप्नोति किल्बिषम्।।18.47।।",
        "transliteration": "śreyān sva-dharmo viguṇaḥ para-dharmāt svanuṣṭhitāt, svabhāva-niyataṁ karma kurvan nāpnoti kilbiṣam",
        "meaning": "Better is one’s own duty, though imperfect, than another’s duty well performed. Doing one’s natural duty, one incurs no sin.",
        "explanation": "Krishna advises sticking to one’s own duty, even if flawed, as it avoids sin, unlike adopting another’s role. This sloka emphasizes sva-dharma. For Arjuna, this reinforces his kshatriya duty to fight, despite imperfections, ensuring his actions are sinless and aligned with his nature for spiritual growth."
      },
      "slok48": {
        "sanskrit": "सहजं कर्म कौन्तेय सदोषमपि न त्यजेत्। सर्वारम्भा हि दोषेण धूमेनाग्निरिवावृताः।।18.48।।",
        "transliteration": "saha-jaṁ karma kaunteya sa-doṣam api na tyajet, sarvārambhā hi doṣeṇa dhūmenāgnir ivāvṛtāḥ",
        "meaning": "One should not abandon one’s natural duty, O son of Kunti, even if flawed, for all undertakings are covered with defects, like fire with smoke.",
        "explanation": "Krishna advises continuing one’s duty despite flaws, as all actions have imperfections. This sloka encourages perseverance. For Arjuna, this means persisting in war despite its challenges, accepting its flaws, ensuring his kshatriya duties are performed with dedication, leading to spiritual progress."
      },
      "slok49": {
        "sanskrit": "असक्तबुद्धिः सर्वत्र जितात्मा विगतस्पृहः। नैष्कर्म्यसिद्धिं परमां संन्यासेनाधिगच्छति।।18.49।।",
        "transliteration": "asakta-buddhiḥ sarvatra jitātmā vigata-spṛhaḥ, naiṣkarmya-siddhiṁ paramāṁ sannyāsena adhigacchati",
        "meaning": "One whose intellect is unattached, self-controlled, and free from desires attains the supreme perfection of freedom from action through renunciation.",
        "explanation": "Krishna states that a detached, self-controlled, desireless person achieves liberation through renunciation. This sloka highlights sannyasa’s goal. For Arjuna, this means fighting with a detached intellect, controlling desires, ensuring his war duties lead to naiṣkarmya (freedom from karmic bondage) through Krishna-focused renunciation."
      },
      "slok50": {
        "sanskrit": "सिद्धिं प्राप्तो यथा ब्रह्म तथाप्नोति निबोध मे। समासेनैव कौन्तेय निष्ठा ज्ञानस्य या परा।।18.50।।",
        "transliteration": "siddhiṁ prāpto yathā brahma tathāpnoti nibodha me, samāsenaiva kaunteya niṣṭhā jñānasya yā parā",
        "meaning": "Learn from Me, O son of Kunti, how one who has attained perfection reaches Brahman, the supreme state of knowledge, in brief.",
        "explanation": "Krishna promises to explain how perfection leads to Brahman, the ultimate knowledge. This sloka introduces the path to divine realization. For Arjuna, this assures that his war duties, performed with perfection, can lead to Brahman, urging him to fight with wisdom and devotion, aiming for the supreme spiritual goal."
      },
      "slok51": {
        "sanskrit": "बुद्ध्या विशुद्धया युक्तो धृत्यात्मानं नियम्य च। शब्दादीन् विषयांस्त्यक्त्वा रागद्वेषौ व्युदस्य च।।18.51।।",
        "transliteration": "buddhyā viśuddhayā yukto dhṛtyātmānaṁ niyamya ca, śabdādīn viṣayāṁs tyaktvā rāga-dveṣau vyudasya ca",
        "meaning": "Endowed with a pure intellect, controlling the self with resolve, renouncing sense objects like sound, and discarding attachment and aversion,",
        "explanation": "Krishna describes the qualities for attaining Brahman: pure intellect, self-control, and detachment from senses and emotions. This sloka begins the path to liberation. For Arjuna, these qualities ensure he fights with a clear, disciplined mind, free from sensory distractions or emotional biases, aligning his warrior duties with spiritual purity."
      },
      "slok52": {
        "sanskrit": "विविक्तसेवी लघ्वाशी यतवाक्कायमानसः। ध्यानयोगपरो नित्यं वैराग्यं समुपाश्रितः।।18.52।।",
        "transliteration": "vivikta-sevī laghv-āśī yata-vāk-kāya-mānasaḥ, dhyāna-yoga-paro nityaṁ vairāgyaṁ samupāśritaḥ",
        "meaning": "Dwelling in solitude, eating lightly, controlling speech, body, and mind, always engaged in meditation yoga, and taking refuge in dispassion,",
        "explanation": "Krishna continues listing qualities for liberation: solitude, moderation, control, meditation, and dispassion. This sloka emphasizes disciplined living. For Arjuna, these practices support mental clarity in war, urging him to meditate on Krishna, moderate his actions, and remain dispassionate, ensuring his duties lead to spiritual liberation."
      },
      "slok53": {
        "sanskrit": "अहङ्कारं बलं दर्पं कामं क्रोधं परिग्रहम्। विमुच्य निर्ममः शान्तो ब्रह्मभूयाय कल्पते।।18.53।।",
        "transliteration": "ahaṅkāraṁ balaṁ darpaṁ kāmaṁ krodhaṁ parigraham, vimucya nirmamaḥ śānto brahma-bhūyāya kalpate",
        "meaning": "Abandoning egoism, power, arrogance, desire, anger, and possessiveness, free from ‘mine-ness,’ peaceful, one is fit for becoming Brahman.",
        "explanation": "Krishna concludes the qualities for liberation, emphasizing freedom from ego and negative traits, leading to peace and Brahman-realization. This sloka highlights spiritual readiness. For Arjuna, relinquishing ego and anger in war ensures he fights peacefully, without possessiveness, aligning his actions with Krishna’s path to Brahman."
      },
      "slok54": {
        "sanskrit": "ब्रह्मभूतः प्रसन्नात्मा न शोचति न काङ्क्षति। समः सर्वेषु भूतेषु मद्भक्तिं लभते पराम्।।18.54।।",
        "transliteration": "brahma-bhūtaḥ prasannātmā na śocati na kāṅkṣati, samaḥ sarveṣu bhūteṣu mad-bhaktiṁ labhate parām",
        "meaning": "Having realized Brahman, with a serene self, neither grieving nor desiring, equal to all beings, one attains supreme devotion to Me.",
        "explanation": "Krishna states that Brahman-realization leads to serenity, equanimity, and supreme bhakti. This sloka connects jnana to bhakti. For Arjuna, realizing the divine in all warriors fosters equanimity, enabling him to fight without grief or desire, deepening his devotion to Krishna for ultimate liberation."
      },
      "slok55": {
        "sanskrit": "भक्त्या मामभिजानाति यावान् यश्चास्मि तत्त्वतः। ततो मां तत्त्वतो ज्ञात्वा विशति तदनन्तरम्।।18.55।।",
        "transliteration": "bhaktyā mām abhijānāti yāvān yaś cāsmi tattvataḥ, tato māṁ tattvato jñātvā viśati tad-anantaram",
        "meaning": "Through devotion, one truly knows Me, as I am; then, having known Me in truth, one enters into Me immediately.",
        "explanation": "Krishna explains that bhakti leads to true knowledge of Him, followed by union with the divine. This sloka emphasizes bhakti’s supremacy. For Arjuna, devotion to Krishna ensures he understands the divine truth, enabling him to fight as an offering, merging with Krishna through dedicated action."
      },
      "slok56": {
        "sanskrit": "सर्वकर्माण्यपि सदा कुर्वाणो मद्व्यपाश्रयः। मत्प्रसादादवाप्नोति शाश्वतं पदमव्ययम्।।18.56।।",
        "transliteration": "sarva-karmāṇy api sadā kurvāṇo mad-vyapāśrayaḥ, mat-prasādād avāpnoti śāśvataṁ padam avyayam",
        "meaning": "Performing all actions always under My refuge, by My grace, one attains the eternal, imperishable state.",
        "explanation": "Krishna assures that actions performed under His refuge lead to eternal liberation by His grace. This sloka highlights divine protection. For Arjuna, fighting under Krishna’s guidance ensures his war duties, offered to Krishna, grant eternal liberation, reinforcing his trust in divine grace."
      },
      "slok57": {
        "sanskrit": "चेतसा सर्वकर्माणि मयि संन्यास्य मत्परः। बुद्धियोगमुपाश्रित्य मच्चित्तः सततं भव।।18.57।।",
        "transliteration": "cetasā sarva-karmāṇi mayi saṁnyāsya mat-paraḥ, buddhi-yogam upāśritya mac-cittaḥ satataṁ bhava",
        "meaning": "Mentally dedicating all actions to Me, regarding Me as the supreme, resorting to the yoga of discernment, ever fix your mind on Me.",
        "explanation": "Krishna instructs dedicating all actions to Him with a discerning mind focused on Him. This sloka emphasizes surrender and focus. For Arjuna, this means offering his war efforts to Krishna, using discernment to stay devoted, ensuring his actions are divine acts, leading to liberation."
      },
      "slok58": {
        "sanskrit": "मच्चित्तः सर्वदुर्गाणि मत्प्रसादात्तरिष्यसि। अथ चेत्त्वमहङ्कारान्न श्रोष्यसि विनङ्क्ष्यसि।।18.58।।",
        "transliteration": "mac-cittaḥ sarva-durgāṇi mat-prasādāt tariṣyasi, atha cet tvam ahaṅkārān na śroṣyasi vinaṅkṣyasi",
        "meaning": "With your mind fixed on Me, by My grace, you will overcome all obstacles; but if, due to ego, you do not listen, you will perish.",
        "explanation": "Krishna promises that devotion overcomes obstacles, but ego-driven refusal leads to ruin. This sloka contrasts surrender with ego. For Arjuna, fixing his mind on Krishna ensures victory in war’s challenges, while ego could lead to failure, urging complete surrender to Krishna’s guidance."
      },
      "slok59": {
        "sanskrit": "यदहङ्कारमाश्रित्य न योत्स्य इति मन्यसे। मिथ्यैष व्यवसायस्ते प्रकृतिस्त्वां नियोक्ष्यति।।18.59।।",
        "transliteration": "yad ahaṅkāram āśritya na yotsya iti manyase, mithyaiṣa vyavasāyas te prakṛtis tvāṁ niyokṣyati",
        "meaning": "If, relying on ego, you think, ‘I will not fight,’ your resolve is in vain; your nature will compel you.",
        "explanation": "Krishna warns Arjuna that ego-driven refusal to fight is futile, as his kshatriya nature will compel action. This sloka emphasizes nature’s force. For Arjuna, this underscores that his warrior instincts will drive him to fight, urging alignment with Krishna’s will to avoid futile resistance."
      },
      "slok60": {
        "sanskrit": "स्वभावजेन कौन्तेय निबद्धः स्वेन कर्मणा। कर्तुं नेच्छसि यन्मोहात्करिष्यस्यवशोऽपि तत्।।18.60।।",
        "transliteration": "svabhāva-jena kaunteya nibaddhaḥ svena karmaṇā, kartuṁ necchasi yan mohāt kariṣyasy avaśo ’pi tat",
        "meaning": "Bound by your own duty born of your nature, O son of Kunti, you will helplessly do that which, due to delusion, you do not wish to do.",
        "explanation": "Krishna reiterates that Arjuna’s natural duty as a kshatriya will compel him to fight, despite delusional reluctance. This sloka reinforces duty’s inevitability. For Arjuna, this assures that his warrior nature will prevail, urging him to fight willingly under Krishna’s guidance for spiritual alignment."
      },
      "slok61": {
        "sanskrit": "ईश्वरः सर्वभूतानां हृद्देशेऽर्जुन तिष्ठति। भ्रामयन् सर्वभूतानि यन्त्रारूढानि मायया।।18.61।।",
        "transliteration": "īśvaraḥ sarva-bhūtānāṁ hṛd-deśe ’rjuna tiṣṭhati, bhrāmayan sarva-bhūtāni yantrārūḍhāni māyayā",
        "meaning": "The Lord resides in the hearts of all beings, O Arjuna, causing them to revolve like puppets on a machine, by His maya.",
        "explanation": "Krishna reveals that God, residing in all hearts, orchestrates actions through maya, like puppets on a machine. This sloka emphasizes divine control. For Arjuna, this teaches that Krishna directs his war actions, urging him to surrender to the divine will, fighting as an instrument of God’s plan."
      },
      "slok62": {
        "sanskrit": "तमेव शरणं गच्छ सर्वभावेन भारत। तत्प्रसादात्परां शान्तिं स्थानं प्राप्स्यसि शाश्वतम्।।18.62।।",
        "transliteration": "tam eva śaraṇaṁ gaccha sarva-bhāvena bhārata, tat-prasādāt parāṁ śāntiṁ sthānaṁ prāpsyasi śāśvatam",
        "meaning": "Seek refuge in Him alone with all your being, O Bharata; by His grace, you will attain supreme peace and the eternal abode.",
        "explanation": "Krishna instructs Arjuna to surrender fully to God for peace and eternal liberation. This sloka emphasizes complete surrender. For Arjuna, surrendering to Krishna ensures his war duties lead to peace and divine union, resolving all doubts, aligning his actions with the eternal goal."
      },
      "slok63": {
        "sanskrit": "इति ते ज्ञानमाख्यातं गुह्याद् गुह्यतरं मया। विमृश्यैतदशेषेण यथेच्छसि तथा कुरु।।18.63।।",
        "transliteration": "iti te jñānam ākhyātaṁ guhyād guhyataraṁ mayā, vimṛśyaitad aśeṣeṇa yathecchasi tathā kuru",
        "meaning": "Thus, I have declared to you the most secret knowledge; reflect on it fully and do as you wish.",
        "explanation": "Krishna concludes his teachings, having shared the most confidential knowledge, urging Arjuna to reflect and act freely. This sloka grants autonomy. For Arjuna, this invites careful consideration of Krishna’s wisdom, encouraging him to fight with informed choice, aligning his actions with divine guidance."
      },
      "slok64": {
        "sanskrit": "सर्वगुह्यतमं भूयः शृणु मे परमं वचः। इष्टोऽसि मे दृढमिति ततो वक्ष्यामि ते हितम्।।18.64।।",
        "transliteration": "sarva-guhyatamaṁ bhūyaḥ śṛṇu me paramaṁ vacaḥ, iṣṭo ’si me dṛḍham iti tato vakṣyāmi te hitam",
        "meaning": "Hear again My supreme word, the most secret of all; you are dearly beloved to Me, so I shall speak for your benefit.",
        "explanation": "Krishna, out of love for Arjuna, promises to share the most secret teaching for his welfare. This sloka emphasizes divine affection. For Arjuna, this reassures Krishna’s personal care, preparing him to receive the ultimate instruction, strengthening his resolve to fight with devotion and trust."
      },
      "slok65": {
        "sanskrit": "मन्मना भव मद्भक्तो मद्याजी मां नमस्कुरु। मामेवैष्यसि सत्यं ते प्रतिजाने प्रियोऽसि मे।।18.65।।",
        "transliteration": "man-manā bhava mad-bhakto mad-yājī māṁ namaskuru, mām evaiṣyasi satyaṁ te pratijāne priyo ’si me",
        "meaning": "Fix your mind on Me, be My devotee, worship Me, bow to Me; truly, I promise, you will come to Me, for you are dear to Me.",
        "explanation": "Krishna instructs Arjuna to focus on Him through devotion and worship, promising divine union. This sloka emphasizes bhakti’s certainty. For Arjuna, this means fighting with his mind fixed on Krishna, offering his war efforts as worship, ensuring liberation through devoted action."
      },
      "slok66": {
        "sanskrit": "सर्वधर्मान् परित्यज्य मामेकं शरणं व्रज। अहं त्वा सर्वपापेभ्यो मोक्षयिष्यामि मा शुचः।।18.66।।",
        "transliteration": "sarva-dharmān parityajya mām ekaṁ śaraṇaṁ vraja, ahaṁ tvā sarva-pāpebhyo mokṣayiṣyāmi mā śucaḥ",
        "meaning": "Abandon all dharmas and take refuge in Me alone; I will liberate you from all sins, do not grieve.",
        "explanation": "Krishna’s ultimate instruction is to surrender all duties to Him for liberation from sins. This sloka is the Gita’s pinnacle of surrender. For Arjuna, this resolves his war dilemmas, urging him to fight under Krishna’s refuge, free from guilt, ensuring liberation through complete surrender."
      },
      "slok67": {
        "sanskrit": "इदं ते नातपस्काय नाभक्ताय कदाचन। न चाशुश्रूषवे वाच्यं न च मां योऽभ्यसूयति।।18.67।।",
        "transliteration": "idaṁ te nātapaskāya nābhaktāya kadācana, na cāśuśrūṣave vācyaṁ na ca māṁ yo ’bhyasūyati",
        "meaning": "This should never be spoken by you to one who is not austere, not devoted, nor to one who does not render service, nor to one who envies Me.",
        "explanation": "Krishna restricts sharing the Gita’s teachings to those lacking austerity, devotion, service, or who envy Him. This sloka emphasizes selective transmission. For Arjuna, this underscores the sacredness of Krishna’s wisdom, urging him to cherish and apply it in war, sharing it only with worthy recipients."
      },
      "slok68": {
        "sanskrit": "य इदं परमं गुह्यं मद्भक्तेषु अभिधास्यति। भक्तिं मयि परां कृत्वा मामेवैष्यत्यसंशयः।।18.68।।",
        "transliteration": "ya idaṁ paramaṁ guhyaṁ mad-bhakteṣu abhidhāsyati, bhaktiṁ mayi parāṁ kṛtvā mām evaiṣyaty asaṁśayaḥ",
        "meaning": "One who explains this supreme secret to My devotees, performing supreme devotion to Me, will certainly come to Me without doubt.",
        "explanation": "Krishna promises that sharing the Gita with devotees, with supreme bhakti, ensures divine union. This sloka rewards dissemination. For Arjuna, this encourages sharing Krishna’s teachings with devoted allies, reinforcing his own bhakti through war, ensuring his path to Krishna is certain."
      },
      "slok69": {
        "sanskrit": "न च तस्मान्मनुष्येषु कश्चिन्मे प्रियकृत्तमः। भविता न च मे तस्मादन्यः प्रियतरो भुवि।।18.69।।",
        "transliteration": "na ca tasmān manuṣyeṣu kaścin me priya-kṛttamaḥ, bhavitā na ca me tasmād anyaḥ priyataro bhuvi",
        "meaning": "There is no one among humans dearer to Me than such a person, nor will there be anyone dearer to Me on earth.",
        "explanation": "Krishna declares that those who share His teachings are most dear to Him. This sloka emphasizes their special status. For Arjuna, this elevates his role as Krishna’s devotee, motivating him to fight with love and share the Gita’s wisdom, deepening his bond with Krishna."
      },
      "slok70": {
        "sanskrit": "अध्येष्यते च य इमं धर्म्यं संनादमावयोः। ज्ञानयज्ञेन तेनाहमिष्टः स्यामिति मे मतिः।।18.70।।",
        "transliteration": "adhyeṣyate ca ya imaṁ dharmyaṁ saṁnādam āvayoḥ, jñāna-yajñena tenāham iṣṭaḥ syām iti me matiḥ",
        "meaning": "And one who studies this sacred dialogue of ours, by the sacrifice of knowledge, will worship Me—that is My opinion.",
        "explanation": "Krishna states that studying the Gita is a sacrifice of knowledge, equivalent to worshipping Him. This sloka values study. For Arjuna, studying Krishna’s teachings equips him for war, as each reflection is worship, ensuring his actions are informed by divine wisdom, leading to liberation."
      },
      "slok71": {
        "sanskrit": "श्रद्धावाननसूयश्च शृणुयादपि यो नरः। सौऽपि मुक्तः शुभाँल्लोकान् प्राप्नुयात्पुण्यकर्मणाम्।।18.71।।",
        "transliteration": "śraddhāvān anasūyaś ca śṛṇuyād api yo naraḥ, so ’pi muktaḥ śubhāṁl lokān prāpnuyāt puṇya-karmaṇām",
        "meaning": "Even the person who hears this with faith and without envy will be liberated and attain the auspicious worlds of the righteous.",
        "explanation": "Krishna assures that faithful, non-envious listeners of the Gita attain liberation and auspicious realms. This sloka extends benefits to listeners. For Arjuna, this encourages sharing the Gita with faithful allies, ensuring even hearing it in war’s context brings spiritual merit, reinforcing his mission."
      },
      "slok72": {
        "sanskrit": "कच्चिदेतच्छ्रुतं पार्थ त्वयैकाग्रेण चेतसा। कच्चिदज्ञानसम्मोहः प्रनष्टस्ते धनञ्जय।।18.72।।",
        "transliteration": "kaccid etac chrutaṁ pārtha tvayaikāgreṇa cetasā, kaccid ajñāna-sammohaḥ pranaṣṭas te dhanañjaya",
        "meaning": "Have you heard this with a focused mind, O Partha? Has your delusion born of ignorance been destroyed, O Dhananjaya?",
        "explanation": "Krishna asks Arjuna if he has attentively understood the teachings and overcome his ignorance-induced delusion. This sloka seeks confirmation. For Arjuna, this prompts reflection on Krishna’s wisdom, ensuring his war doubts are resolved, preparing him to fight with clarity and conviction."
      },
      "slok73": {
        "sanskrit": "अर्जुन उवाच। नष्टो मोहः स्मृतिर्लब्धा त्वत्प्रसादान्मयाच्युत। स्थितोऽस्मि गतसन्देहः करिष्ये वचनं तव।।18.73।।",
        "transliteration": "arjuna uvāca naṣṭo mohaḥ smṛtir labdhā tvat-prasādān mayācyuta, sthito ’smi gata-sandehaḥ kariṣye vacanaṁ tava",
        "meaning": "Arjuna said: My delusion is destroyed, and I have regained my memory by Your grace, O Achyuta. I stand firm, free from doubt, and will do Your bidding.",
        "explanation": "Arjuna confirms that Krishna’s teachings have dispelled his delusion, restoring his resolve to fight. This sloka marks his transformation. For Arjuna, this signifies readiness to fight as Krishna’s instrument, free from doubt, ensuring his warrior duties are performed with divine guidance and purpose."
      },
      "slok74": {
        "sanskrit": "सञ्जय उवाच। इत्यहं वासुदेवस्य पार्थस्य च महात्मनः। संनादमिममश्रौषमद्भुतं रोमहर्षणम्।।18.74।।",
        "transliteration": "sañjaya uvāca ity ahaṁ vāsudevasya pārthasya ca mahātmanaḥ, saṁnādam imam aśrauṣam adbhutaṁ romaharṣaṇam",
        "meaning": "Sanjaya said: Thus, I have heard this wonderful, thrilling dialogue between Vasudeva and the great-souled Partha.",
        "explanation": "Sanjaya, narrating to Dhritarashtra, expresses awe at the Krishna-Arjuna dialogue. This sloka begins the Gita’s epilogue. For Arjuna, Sanjaya’s reaction underscores the dialogue’s profound impact, reinforcing the sacredness of Krishna’s guidance, which empowers Arjuna’s war resolve."
      },
      "slok75": {
        "sanskrit": "व्यासप्रसादाच्छ्रुतवानेतद्गुह्यमहं परम्। योगं योगेश्वरात्कृष्णात्साक्षात्कथयतः स्वयम्।।18.75।।",
        "transliteration": "vyāsa-prasādāc chrutavān etad guhyam ahaṁ param, yogaṁ yogeśvarāt kṛṣṇāt sākṣāt kathayataḥ svayam",
        "meaning": "By Vyasa’s grace, I have heard this supreme, secret yoga directly from Krishna, the Lord of Yoga, as He spoke Himself.",
        "explanation": "Sanjaya credits Vyasa for enabling him to hear Krishna’s secret yoga teachings. This sloka acknowledges divine transmission. For Arjuna, this highlights the privilege of receiving Krishna’s direct guidance, reinforcing his duty to act on it, fighting with the authority of divine wisdom."
      },
      "slok76": {
        "sanskrit": "राजन्संस्मृत्य संस्मृत्य संनादमिममद्भुतम्। केशवार्जुनयोः पुण्यं हृष्यामि च मुहुर्मुहुः।।18.76।।",
        "transliteration": "rājan saṁsmṛtya saṁsmṛtya saṁnādam imam adbhutam, keśavārjunayoḥ puṇyaṁ hṛṣyāmi ca muhur muhuḥ",
        "meaning": "O King, remembering and remembering this wonderful, holy dialogue between Keshava and Arjuna, I rejoice again and again.",
        "explanation": "Sanjaya expresses joy in recalling the sacred Krishna-Arjuna dialogue. This sloka conveys its uplifting impact. For Arjuna, Sanjaya’s joy reflects the transformative power of Krishna’s teachings, motivating him to fight with enthusiasm, inspired by the holy wisdom guiding his actions."
      },
      "slok77": {
        "sanskrit": "तच्च संस्मृत्य संस्मृत्य रूपमत्यद्भुतं हरेः। विस्मयो मे महान् राजन् हृष्यामि च पुनः पुनः।।18.77।।",
        "transliteration": "tac ca saṁsmṛtya saṁsmṛtya rūpam aty-adbhutaṁ hareḥ, vismayo me mahān rājan hṛṣyāmi ca punaḥ punaḥ",
        "meaning": "And remembering and remembering that most wonderful form of Hari, great is my amazement, O King, and I rejoice again and again.",
        "explanation": "Sanjaya marvels at Krishna’s cosmic form, rejoicing repeatedly. This sloka recalls the divine vision from Chapter 11. For Arjuna, this reminds him of Krishna’s universal form, strengthening his resolve to fight under the divine’s guidance, inspired by the awe of Krishna’s supreme reality."
      },
      "slok78": {
        "sanskrit": "यत्र योगेश्वरः कृष्णो यत्र पार्थो धनुर्धरः। तत्र श्रीर्विजयो भूतिः ध्रुवा नीतिरिति मे मतिः।।18.78।।",
        "transliteration": "yatra yogeśvaraḥ kṛṣṇo yatra pārtho dhanur-dharaḥ, tatra śrīr vijayo bhūtiḥ dhruvā nītir iti me matiḥ",
        "meaning": "Wherever there is Krishna, the Lord of Yoga, and wherever there is Partha, the archer, there are prosperity, victory, glory, and righteousness—this is my conviction.",
        "explanation": "Sanjaya concludes that Krishna and Arjuna’s union ensures success and righteousness. This sloka encapsulates the Gita’s essence. For Arjuna, this affirms that fighting with Krishna’s guidance guarantees victory and dharma, inspiring him to act with confidence, ensuring his war efforts uphold divine justice and glory."
      }
    }
  }
]
