[
  {
    "chapter3": {
      "title": "Karma Yoga (The Yoga of Action)",
      "description": "In Chapter 3, Arjuna, perplexed by Krishna’s teachings on knowledge and action, seeks clarity on why he must fight. Krishna elaborates on Karma Yoga, emphasizing selfless action performed as duty (dharma) without attachment to results. He explains the necessity of action for maintaining worldly order and spiritual growth, urging Arjuna to act with discipline and devotion.",
      "total_verses": 43,
      "slok1": {
        "sanskrit": "ज्यायसी चेत्कर्मणस्ते मता बुद्धिर्जनार्दन। तत्किं कर्मणि घोरे मां नियोजयसि केशव।।3.1।।",
        "transliteration": "jyāyasī chet karmaṇas te matā buddhir janārdana, tat kiṁ karmaṇi ghore māṁ niyojayasi keśava",
        "meaning": "Arjuna said: O Janardana (Krishna), if You consider knowledge superior to action, why then do You engage me in this terrible action (of war), O Keshava?",
        "explanation": "Arjuna begins Chapter 3 with a question stemming from his confusion over Krishna’s teachings in Chapter 2, where knowledge of the eternal soul seemed to be prioritized. He wonders why, if intellectual understanding is superior, Krishna urges him to partake in the violent act of war. This sloka sets the stage for Krishna’s discourse on Karma Yoga, highlighting Arjuna’s inner conflict between renunciation and action. Krishna will clarify that action, when performed selflessly, aligns with spiritual wisdom and is essential for fulfilling one’s duty."
      },
      "slok2": {
        "sanskrit": "व्यमिश्रेणेव वाक्येन बुद्धिं मोहयसीव मे। तदेकं वद निश्चित्य येन श्रेयोऽहमाप्नुयाम्।।3.2।।",
        "transliteration": "vyāmiśreṇeva vākyena buddhiṁ mohayasīva me, tad ekaṁ vada niścitya yena śreyo ’ham āpnuyām",
        "meaning": "Arjuna said: With these seemingly contradictory words, You are bewildering my intelligence. Please tell me definitively one path by which I may attain the highest good.",
        "explanation": "Arjuna expresses frustration, feeling that Krishna’s teachings on knowledge and action appear contradictory, causing mental confusion. He seeks a clear, singular path to spiritual welfare, reflecting his desire for simplicity amidst complex philosophical ideas. This sloka underscores Arjuna’s human struggle to reconcile conflicting duties and sets up Krishna’s explanation of Karma Yoga as a practical path that integrates action with spiritual goals, emphasizing clarity and commitment to duty."
      },
      "slok3": {
        "sanskrit": "श्रीभगवानुवाच। लोकेस्मिन्द्विविधा निष्ठा पुरा प्रोक्ता मयानघ। ज्ञानयोगेन साङ्ख्यानां कर्मयोगेन योगिनाम्।।3.3।।",
        "transliteration": "śrī bhagavān uvāca loke ’smin dvividhā niṣṭhā purā proktā mayānagha, jñāna-yogena sāṅkhyānāṁ karma-yogena yoginām",
        "meaning": "The Supreme Lord said: O sinless Arjuna, I have previously explained two paths in this world: the path of knowledge (Jnana Yoga) for the contemplative, and the path of action (Karma Yoga) for the active.",
        "explanation": "Krishna begins his response by clarifying that there are two valid spiritual paths, tailored to different temperaments. Jnana Yoga, suited for those inclined toward intellectual analysis (Sankhya philosophers), focuses on self-realization through knowledge. Karma Yoga, for those engaged in worldly duties, emphasizes selfless action. This sloka addresses Arjuna’s confusion by affirming that both paths lead to liberation, but Karma Yoga is more suitable for Arjuna, given his role as a warrior."
      },
      "slok4": {
        "sanskrit": "न कर्मणामनारम्भान्नैष्कर्म्यं पुरुषोऽश्नुते। न च संन्यासमादेव संन्यासं गच्छति।।3.4।।",
        "transliteration": "na karmaṇām anārambhān naiṣkarmyaṁ puruṣo ’śnute, na ca sannyāsam ādeva sannyāsaṁ gacchati",
        "meaning": "A person does not attain freedom from action (naishkarmya) by abstaining from actions, nor does one achieve perfection through mere renunciation.",
        "explanation": "Krishna explains that avoiding action does not lead to liberation, as inaction cannot free one from the cycle of karma. Similarly, mere external renunciation (sannyasa) without inner detachment fails to bring spiritual perfection. This sloka emphasizes that true freedom comes from performing actions selflessly, without attachment to results, laying the foundation for Karma Yoga’s core principle of disciplined action."
      },
      "slok5": {
        "sanskrit": "न हि कश्चित्क्षणमपि जातु तिष्ठत्यकर्मकृत्। कार्यते ह्यवशः कर्म सर्वः प्रकृतिजैर्गुणैः।।3.5।।",
        "transliteration": "na hi kaścit kṣaṇam api jātu tiṣṭhaty akarma-kṛt, kāryate hyavaśaḥ karma sarvaḥ prakṛti-jair guṇaiḥ",
        "meaning": "No one can remain without acting even for a moment, as everyone is compelled to act by the qualities (gunas) born of material nature (prakriti).",
        "explanation": "Krishna asserts that action is inevitable due to the influence of the three gunas (sattva, rajas, tamas) that govern material nature. Even basic survival requires action, driven by natural impulses. This sloka challenges the notion of complete inaction as a spiritual path, urging Arjuna to channel his actions toward a higher purpose through Karma Yoga, aligning them with dharma rather than resisting them."
      },
      "slok6": {
        "sanskrit": "कर्मेन्द्रियाणि संयम्य य आस्ते मनसा स्मरन्। इन्द्रियार्थान्विमूढात्मा मिथ्याचारः स उच्यते।।3.6।।",
        "transliteration": "karmendriyāṇi saṁyamya ya āste manasā smaran, indriyārthān vimūḍhātmā mithyācāraḥ sa ucyate",
        "meaning": "One who restrains the senses outwardly but dwells on sense objects in the mind is a pretender (hypocrite) and is called a false practitioner.",
        "explanation": "Krishna warns against superficial renunciation, where one outwardly controls the senses but inwardly craves sensory pleasures. Such a person is dishonest and spiritually deluded. This sloka highlights the importance of internal discipline in Karma Yoga, stressing that true detachment involves purifying the mind, not just restraining physical actions, to avoid hypocrisy."
      },
      "slok7": {
        "sanskrit": "यस्त्विन्द्रियाणि मनसा नियम्यारभतेऽर्जुन। कर्मेन्द्रियैः कर्मयोगमसक्तः स विशिष्यते।।3.7।।",
        "transliteration": "yas tv indriyāṇi manasā niyamyārabhate ’rjuna, karmendriyaiḥ karma-yogam asaktaḥ sa viśiṣyate",
        "meaning": "But one who controls the senses with the mind, O Arjuna, and engages in Karma Yoga with the organs of action, without attachment, is superior.",
        "explanation": "Krishna praises the Karma Yogi who disciplines the senses through the mind and performs duties without attachment. Unlike the hypocrite in Sloka 6, this person acts with sincerity, using their faculties for selfless work. This sloka underscores the excellence of Karma Yoga, where disciplined, unattached action leads to spiritual growth, making it a practical path for Arjuna."
      },
      "slok8": {
        "sanskrit": "नियतं कुरु कर्म त्वं कर्म ज्यायो ह्यकर्मणः। शरीरयात्रापि च ते न प्रसिद्ध्येदकर्मणः।।3.8।।",
        "transliteration": "niyataṁ kuru karma tvaṁ karma jyāyo hy akarmaṇaḥ, śarīra-yātrāpi ca te na prasiddhyed akarmaṇaḥ",
        "meaning": "Perform your prescribed duties, for action is better than inaction. Even the maintenance of your body cannot be accomplished without action.",
        "explanation": "Krishna advises Arjuna to perform his prescribed duties (niyata karma) as a warrior, as action is superior to inaction. Inaction cannot sustain even basic bodily needs, let alone spiritual progress. This sloka reinforces the necessity of action in daily life and aligns with Karma Yoga’s principle of fulfilling responsibilities while remaining detached from outcomes."
      },
      "slok9": {
        "sanskrit": "यज्ञार्थात्कर्मणोऽन्यत्र लोकोऽयं कर्मबन्धनः। तदर्थं कर्म कौन्तेय मुक्तसङ्गः समाचर।।3.9।।",
        "transliteration": "yajñārthāt karmaṇo ’nyatra loko ’yaṁ karma-bandhanaḥ, tad-arthaṁ karma kaunteya mukta-saṅgaḥ samācara",
        "meaning": "The world is bound by actions other than those performed for the sake of sacrifice (yajna). Therefore, O son of Kunti, perform your actions for that purpose, free from attachment.",
        "explanation": "Krishna explains that actions performed without a sacrificial spirit bind one to material consequences. Actions done as offerings to the divine (yajna) liberate the soul. This sloka introduces the concept of selfless action as a sacrifice, urging Arjuna to work for a higher purpose, free from personal desires, to avoid karmic bondage."
      },
      "slok10": {
        "sanskrit": "सहयज्ञाः प्रजाः सृष्ट्वा पुरोवाच प्रजापतिः। अनेन प्रसविष्यध्वमेष वोऽस्त्विष्टकामधुक्।।3.10।।",
        "transliteration": "saha-yajñāḥ prajāḥ sṛṣṭvā purovāca prajāpatiḥ, anena prasaviṣyadhvam eṣa vo ’stv iṣṭa-kāma-dhuk",
        "meaning": "Having created mankind along with sacrifices, Prajapati (the Creator) said in ancient times: By this (yajna), you shall prosper, and it shall fulfill all your desires.",
        "explanation": "Krishna recounts the cosmic order established by Prajapati, the Creator, who instituted sacrifices (yajna) as a means for humanity to thrive. Yajna symbolizes cooperative, selfless action that sustains society and fulfills righteous desires. This sloka emphasizes the divine origin of Karma Yoga, portraying action as a sacred duty integral to creation’s harmony."
      },
      "slok11": {
        "sanskrit": "देवान्भावयतानेन ते देवा भावयन्तु वः। परस्परं भावयन्तः श्रेयः परमवाप्स्यथ।।3.11।।",
        "transliteration": "devān bhāvayatānena te devā bhāvayantu vaḥ, parasparaṁ bhāvayantaḥ śreyaḥ param avāpsyatha",
        "meaning": "Nourish the gods with this (yajna), and they will nourish you. By mutually nourishing each other, you will attain the highest good.",
        "explanation": "Krishna describes a reciprocal relationship between humans and divine forces through yajna. By performing selfless actions, humans sustain cosmic order, and the gods (natural forces) provide prosperity. This sloka highlights the interdependence of creation and the spiritual benefit of selfless action, encouraging Arjuna to act for the greater good."
      },
      "slok12": {
        "sanskrit": "इष्टान्भोगान्हि वो देवा दास्यन्ति यज्ञभाविताः। तैर्दत्तानप्रदायैभ्यो यो भुङ्क्ते स्तेन एव सः।।3.12।।",
        "transliteration": "iṣṭān bhogān hi vo devā dāsyanti yajña-bhāvitāḥ, tair dattān apradāyaibhyo yo bhuṅkte stena eva saḥ",
        "meaning": "The gods, nourished by sacrifice, will grant you desired enjoyments. But one who enjoys these gifts without offering them back is indeed a thief.",
        "explanation": "Krishna warns that enjoying resources without contributing to the cycle of sacrifice is akin to stealing. The gods provide sustenance through yajna, but humans must reciprocate by offering actions back to the divine. This sloka underscores the ethical responsibility to give back, aligning with Karma Yoga’s principle of selfless contribution to society and the cosmos."
      },
      "slok13": {
        "sanskrit": "यज्ञशिष्टाशिनः सन्तो मुच्यन्ते सर्वकिल्बिषैः। भुञ्जते ते त्वघं पापा ये पचन्त्यात्मकारणात्।।3.13।।",
        "transliteration": "yajña-śiṣṭāśinaḥ santo mucyante sarva-kilbiṣaiḥ, bhuñjate te tv aghaṁ pāpā ye pacanty ātma-kāraṇāt",
        "meaning": "The righteous who eat the remnants of sacrifice are freed from all sins. But those who cook food only for themselves eat sin.",
        "explanation": "Krishna contrasts the righteous, who consume what remains after offering to the divine, with the selfish, who act only for personal gain. The former are purified, while the latter accumulate sin. This sloka emphasizes the spiritual purity of selfless action and the moral consequences of self-centeredness, reinforcing the ethos of Karma Yoga."
      },
      "slok14": {
        "sanskrit": "अन्नाद्भवन्ति भूतानि पर्जन्यादन्नसम्भवः। यज्ञाद्भवति पर्जन्यो यज्ञः कर्मसमुद्भवः।।3.14।।",
        "transliteration": "annād bhavanti bhūtāni parjanyād anna-sambhavaḥ, yajñād bhavati parjanyo yajñaḥ karma-samudbhavaḥ",
        "meaning": "All beings arise from food, food arises from rain, rain arises from sacrifice, and sacrifice arises from action.",
        "explanation": "Krishna outlines the cyclical relationship between action and sustenance. Selfless actions (yajna) lead to rain (divine blessings), which produces food, sustaining life. This sloka illustrates the interconnectedness of human effort and cosmic processes, emphasizing that Karma Yoga’s selfless actions uphold the natural order and support all existence."
      },
      "slok15": {
        "sanskrit": "कर्म ब्रह्मोद्भवं विद्धि ब्रह्माक्षरसमुद्भवम्। तस्मात्सर्वगतं ब्रह्म नित्यं यज्ञे प्रतिष्ठितम्।।3.15।।",
        "transliteration": "karma brahmodbhavaṁ viddhi brahmākṣara-samudbhavam, tasmāt sarva-gataṁ brahma nityaṁ yajñe pratiṣṭhitam",
        "meaning": "Know that action arises from the Vedas, and the Vedas arise from the Imperishable (Brahman). Therefore, the all-pervading Brahman is eternally established in sacrifice.",
        "explanation": "Krishna connects action to the divine by tracing its origin to the Vedas, which emanate from Brahman, the ultimate reality. Sacrifice (yajna), rooted in Vedic wisdom, embodies Brahman’s presence. This sloka elevates Karma Yoga to a divine act, showing that selfless action aligns with the eternal truth and sustains the cosmic order."
      },
      "slok16": {
        "sanskrit": "एवं प्रवर्तितं चक्रं नानुवर्तति यः। अघायुरिन्द्रियारामो मोघं पार्थ स जीवति।।3.16।।",
        "transliteration": "evaṁ pravartitaṁ cakraṁ nānuvartati yaḥ, aghāyur indriyārāmo moghaṁ pārtha sa jīvati",
        "meaning": "O Partha, one who does not follow the cycle of sacrifice thus established lives a sinful, sense-indulgent life, and lives in vain.",
        "explanation": "Krishna warns that ignoring the cycle of selfless action (yajna) leads to a wasteful, sinful life driven by sensory pleasures. Such a person disrupts the cosmic order and fails to achieve spiritual purpose. This sloka urges Arjuna to participate in Karma Yoga, emphasizing the futility of living solely for personal gratification."
      },
      "slok17": {
        "sanskrit": "यस्त्वात्मरतिरेव स्यादात्मतृप्तश्च मानवः। आत्मन्येव च सन्तुष्टस्तस्य कार्यं न विद्यते।।3.17।।",
        "transliteration": "yas tv ātma-ratir eva syād ātma-tṛptaś ca mānavaḥ, ātmany eva ca santuṣṭas tasya kāryaṁ na vidyate",
        "meaning": "But for one who delights in the self, is satisfied in the self, and is content in the self alone, there is no duty to perform.",
        "explanation": "Krishna describes the rare, self-realized soul who is fully content within the self, detached from external desires. Such a person, absorbed in the Atman, has no obligatory duties. This sloka contrasts with Arjuna’s situation, indicating that while liberation may free one from action, Arjuna, not yet at that stage, must follow Karma Yoga to progress spiritually."
      },
      "slok18": {
        "sanskrit": "नैव तस्य कृतेनार्थो नाकृतेनेह कश्चन। न चास्य सर्वभूतेषु कश्चिदर्थव्यपाश्रयः।।3.18।।",
        "transliteration": "naiva tasya kṛtenārtho nākṛteneha kaścana, na cāsya sarva-bhūteṣu kaścid artha-vyapāśrayaḥ",
        "meaning": "Such a person has no purpose to gain by action or inaction, nor does he depend on any being for any purpose.",
        "explanation": "Continuing from Sloka 17, Krishna explains that a self-realized soul has no motive for action or inaction, as they are free from desires and dependencies. This state of complete detachment is the ultimate goal of Karma Yoga, but it’s not Arjuna’s current reality. This sloka serves to clarify that Arjuna must act selflessly to reach such liberation, fulfilling his duties without personal motives."
      },
      "slok19": {
        "sanskrit": "तस्मादसक्तः सततं कार्यं कर्म समाचर। असक्तो ह्याचरन्कर्म परमाप्नोति पूरुषः।।3.19।।",
        "transliteration": "tasmād asaktaḥ satataṁ kāryaṁ karma samācara, asakto hy ācaran karma param āpnoti pūruṣaḥ",
        "meaning": "Therefore, always perform your prescribed duties without attachment. By performing actions without attachment, one attains the Supreme.",
        "explanation": "Krishna instructs Arjuna to consistently perform his duties without attachment, as this practice leads to liberation. This sloka encapsulates the essence of Karma Yoga, emphasizing that selfless action purifies the mind and aligns one with the divine. For Arjuna, this means fighting as a warrior, not for personal gain, but as an offering to the greater good."
      },
      "slok20": {
        "sanskrit": "कर्मणैव हि संसिद्धिमास्थिता जनकादयः। लोकसङ्ग्रहमेवापि सम्पश्यन्कर्तुमर्हसि।।3.20।।",
        "transliteration": "karmaṇaiva hi saṁsiddhim āsthitā janakādayaḥ, loka-saṅgraham evāpi sampaśyan kartum arhasi",
        "meaning": "By performing their duties alone, great souls like King Janaka attained perfection. You too should act, considering the welfare of the world.",
        "explanation": "Krishna cites the example of King Janaka, a legendary figure who achieved liberation through selfless action while fulfilling his royal duties. He urges Arjuna to act similarly, keeping the welfare of society (loka-sangraha) in mind. This sloka highlights the role of Karma Yoga in maintaining social order and inspires Arjuna to lead by example as a warrior."
      },
      "slok21": {
        "sanskrit": "यद्यदाचरति श्रेष्ठस्तत्तदेवेतरो जनः। स यत्प्रमाणं कुरुते लोकस्तदनुवर्तति।।3.21।।",
        "transliteration": "yad yad ācarati śreṣṭhas tat tad evetaro janaḥ, sa yat pramāṇaṁ kurute lokas tad anuvartati",
        "meaning": "Whatever a great person does, others follow. The standards they set are emulated by the world.",
        "explanation": "Krishna emphasizes the responsibility of influential individuals like Arjuna, whose actions set a precedent for others. As a respected warrior, Arjuna’s conduct will inspire society. If he shirks his duty, others may follow suit, disrupting social order. This sloka underscores the importance of leading by example in Karma Yoga, motivating Arjuna to act righteously."
      },
      "slok22": {
        "sanskrit": "न मे पार्थास्ति कर्तव्यं त्रिषु लोकेषु किञ्चन। नानवाप्तमवाप्तव्यं वर्त एव च कर्मणि।।3.22।।",
        "transliteration": "na me pārthāsti kartavyaṁ triṣu lokeṣu kiñcana, nānavāptam avāptavyaṁ varta eva ca karmaṇi",
        "meaning": "O Partha, there is no duty for Me to perform in the three worlds, nor do I have anything to gain or attain. Yet, I engage in action.",
        "explanation": "Krishna, as the Supreme Lord, declares that He has no personal obligations or desires, yet He continues to act to maintain cosmic order. This sloka illustrates the principle of selfless action by example, showing that even the divine engages in work for the world’s welfare. It inspires Arjuna to follow suit, performing his duties without attachment, as Krishna does."
      },
      "slok24": {
        "sanskrit": "उत्सीदेयुरिमे लोका न कुर्यां कर्म चेदहम्। सङ्करस्य च कर्ता स्यामुपहन्यामिमाः प्रजाः।।3.24।।",
        "transliteration": "utsīdeyur ime lokā na kuryāṁ karma ced aham, saṅkarasya ca kartā syām upahanyām imāḥ prajāḥ",
        "meaning": "If I did not perform actions, these worlds would perish, and I would be the cause of confusion, destroying these beings.",
        "explanation": "Krishna elaborates that His inaction would disrupt the cosmic order, causing societal collapse and moral confusion (sankara). As the sustainer of creation, His actions maintain harmony. This sloka emphasizes the broader consequences of neglecting duty, urging Arjuna to act responsibly as a warrior to prevent disorder, reinforcing Karma Yoga’s role in upholding societal and cosmic balance."
      },
      "slok25": {
        "sanskrit": "सक्ताः कर्मण्यविद्वांसो यथा कुर्वन्ति भारत। कुर्याद्विद्वांस्तथासक्तश्चिकीर्षुर्लोकसङ्ग्रहम्।।3.25।।",
        "transliteration": "saktāḥ karmaṇy avidvāṁso yathā kurvanti bhārata, kuryād vidvāṁs tathāsaktaś cikīrṣur loka-saṅgraham",
        "meaning": "O Bharata, as the ignorant perform actions with attachment, the wise should act without attachment, desiring the welfare of the world.",
        "explanation": "Krishna contrasts the ignorant, who act with selfish motives, with the wise, who perform duties selflessly for the world’s welfare (loka-sangraha). This sloka advises Arjuna to emulate the wise by fighting without attachment, setting a righteous example. It highlights Karma Yoga’s principle of detached action, emphasizing that the wise act to inspire and maintain societal harmony, not for personal gain."
      },
      "slok26": {
        "sanskrit": "न बुद्धिभेदं जनयेदज्ञानां कर्मसङ्गिनाम्। जोषयेत्सर्वकर्माणि विद्वान्युक्तः समाचरन्।।3.26।।",
        "transliteration": "na buddhi-bhedaṁ janayed ajñānāṁ karma-saṅginām, joṣayet sarva-karmāṇi vidvān yuktaḥ samācaran",
        "meaning": "The wise should not unsettle the minds of the ignorant attached to action, but by acting in a disciplined manner, encourage them in all actions.",
        "explanation": "Krishna advises the wise not to confuse the ignorant, who are attached to action, by advocating inaction or complex philosophies. Instead, they should inspire through their own disciplined actions. For Arjuna, this means performing his duties with focus, encouraging others to follow their dharma. This sloka underscores the wise’s responsibility to guide society through example, aligning with Karma Yoga’s practical approach."
      },
      "slok27": {
        "sanskrit": "प्रकृतेः क्रियमाणानि गुणैः कर्माणि सर्वशः। अहङ्कारविमूढात्मा कर्ताहमिति मन्यते।।3.27।।",
        "transliteration": "prakṛteḥ kriyamāṇāni guṇaiḥ karmāṇi sarvaśaḥ, ahaṅkāra-vimūḍhātmā kartāham iti manyate",
        "meaning": "All actions are performed by the qualities (gunas) of material nature (prakriti), but a person deluded by ego thinks, ‘I am the doer.’",
        "explanation": "Krishna explains that actions result from the interplay of the gunas (sattva, rajas, tamas) within material nature, not the self. The ego-driven person mistakenly believes they are the sole doer, leading to attachment. This sloka introduces the concept of detachment in Karma Yoga, urging Arjuna to recognize the soul’s non-doership and act without ego, aligning actions with divine will."
      },
      "slok28": {
        "sanskrit": "तत्त्ववित्तु महाबाहो गुणकर्मविभागयोः। गुणा गुणेषु वर्तन्त इति मत्वा न सज्जति।।3.28।।",
        "transliteration": "tattva-vit tu mahā-bāho guṇa-karma-vibhāgayoḥ, guṇā guṇeṣu vartanta iti matvā na sajjati",
        "meaning": "But one who knows the truth, O mighty-armed, about the divisions of the gunas and their actions, understanding that the gunas act upon the gunas, is not attached.",
        "explanation": "Krishna teaches that a wise person, understanding that actions arise from the gunas interacting with each other, remains detached. This knowledge frees one from identifying with actions. For Arjuna, this means fighting as a duty, knowing the soul is distinct from material actions. This sloka deepens Karma Yoga’s philosophy, emphasizing wisdom as the key to non-attachment."
      },
      "slok29": {
        "sanskrit": "प्रकृतेर्गुणसम्मूढाः सज्जन्ति गुणकर्मसु। तानकृत्स्नविदो मन्दान्कृत्स्नविन्न विचालति।।3.29।।",
        "transliteration": "prakṛter guṇa-sammūḍhāḥ sajjanti guṇa-karmasu, tān akṛtsna-vido mandān kṛtsna-vin na vicālati",
        "meaning": "Those deluded by the gunas of material nature are attached to actions. The knower of the whole truth should not disturb the ignorant who know only partially.",
        "explanation": "Krishna notes that the ignorant, swayed by the gunas, cling to actions due to incomplete understanding. The wise, fully aware of the truth, should not disrupt their limited perspective but guide them gently. This sloka advises Arjuna to act wisely without unsettling others, reinforcing the wise’s role in Karma Yoga to maintain harmony while pursuing liberation."
      },
      "slok30": {
        "sanskrit": "मयि सर्वं समर्प्य कर्माणि संन्यास्याध्यात्मचेतसा। निराशीर्निर्ममो भूत्वा युध्यस्व विगतज्वरः।।3.30।।",
        "transliteration": "mayi sarvaṁ samarpaya karmāṇi sannyāsyādhyātma-cetasā, nirāśīr nirmamo bhūtvā yudhyasva vigata-jvaraḥ",
        "meaning": "Surrendering all actions to Me with a mind fixed on the self, free from desire and ego, fight without mental fever.",
        "explanation": "Krishna instructs Arjuna to dedicate all actions to Him, acting with spiritual awareness, free from personal desires and ego. This surrender removes mental agitation (‘fever’), enabling focused action. This sloka encapsulates Karma Yoga’s essence, urging Arjuna to fight as an offering to Krishna, aligning duty with devotion and detachment for spiritual liberation."
      },
      "slok31": {
        "sanskrit": "ये मे मतमिदं नित्यमनुतिष्ठन्ति मानवाः। श्रद्धावन्तोऽनसूयन्तो मुच्यन्ते तेऽपि कर्मभिः।।3.31।।",
        "transliteration": "ye me matam idaṁ nityam anutiṣṭhanti mānavāḥ, śraddhāvanto ’nasūyanto mucyante te ’pi karmabhiḥ",
        "meaning": "Those who always follow this teaching of Mine with faith and without envy are also liberated from the bondage of actions.",
        "explanation": "Krishna assures that those who faithfully follow His teachings on Karma Yoga, with trust and without resentment, achieve liberation from karmic bondage. This sloka emphasizes the power of faith and sincerity in spiritual practice, encouraging Arjuna to embrace Karma Yoga wholeheartedly, knowing it leads to freedom from the cycle of action and reaction."
      },
      "slok32": {
        "sanskrit": "ये त्वेतदभ्यसूयन्तो नानुतिष्ठन्ति मे मतम्। सर्वज्ञानविमूढांस्तान्विद्धि नष्टानचेतसः।।3.32।।",
        "transliteration": "ye tv etad abhyasūyanto nānutiṣṭhanti me matam, sarva-jñāna-vimūḍhāṁs tān viddhi naṣṭān acetasaḥ",
        "meaning": "But those who, out of envy, do not follow My teaching, know them to be deluded in all knowledge, senseless, and ruined.",
        "explanation": "Krishna warns that those who reject His teachings due to envy or skepticism, dismissing Karma Yoga, are spiritually lost. Their ignorance leads to ruin, as they remain trapped in delusion. This sloka urges Arjuna to accept Krishna’s guidance earnestly, highlighting the consequences of rejecting divine wisdom and the necessity of following Karma Yoga for spiritual success."
      },
      "slok33": {
        "sanskrit": "सदृशं चेष्टति स्वस्याः प्रकृतेर्ज्ञानवानपि। प्रकृतिं यान्ति भूतानि निग्रहः किं करिष्यति।।3.33।।",
        "transliteration": "sadṛśaṁ ceṣṭati svasyāḥ prakṛter jñānavān api, prakṛtiṁ yānti bhūtāni nigrahaḥ kiṁ kariṣyati",
        "meaning": "Even a wise person acts according to their own nature. All beings follow their nature; what can restraint alone accomplish?",
        "explanation": "Krishna explains that everyone, including the wise, is influenced by their inherent nature (prakriti), shaped by the gunas. Mere suppression of actions cannot overcome this natural tendency. This sloka prepares Arjuna for the need to channel his warrior nature through disciplined Karma Yoga, rather than forcibly resisting it, emphasizing the importance of aligning actions with dharma."
      },
      "slok34": {
        "sanskrit": "इन्द्रियस्येन्द्रियस्यार्थे रागद्वेषौ व्यवस्थितौ। तयोर्न वशमागच्छेत्तौ ह्यस्य परिपन्थिनौ।।3.34।।",
        "transliteration": "indriyasyendriyasyārthe rāga-dveṣau vyavasthitau, tayor na vaśam āgacchet tau hy asya paripanthinau",
        "meaning": "Attraction and aversion to sense objects are seated in the senses. One should not come under their control, for they are obstacles in one’s path.",
        "explanation": "Krishna identifies desire (raga) and aversion (dvesha) as natural responses of the senses to objects, but warns they obstruct spiritual progress. To practice Karma Yoga, Arjuna must master these impulses, acting without being swayed by likes or dislikes. This sloka highlights the need for sense control, a key discipline in performing selfless actions."
      },
      "slok35": {
        "sanskrit": "श्रेयान्स्वधर्मो विगुणः परधर्मात्स्वनुष्ठितात्। स्वधर्मे निधनं श्रेयः परधर्मो भयावहः।।3.35।।",
        "transliteration": "śreyān sva-dharmo viguṇaḥ para-dharmāt svanuṣṭhitāt, sva-dharme nidhanaṁ śreyaḥ para-dharmo bhayāvahaḥ",
        "meaning": "It is better to perform one’s own duty imperfectly than another’s duty perfectly. Death in one’s own duty is better, for another’s duty is fraught with fear.",
        "explanation": "Krishna emphasizes the importance of following one’s own dharma (sva-dharma), even if performed imperfectly, over adopting another’s, which may lead to confusion and danger. For Arjuna, this means embracing his role as a warrior rather than seeking renunciation. This sloka reinforces Karma Yoga’s principle of adhering to one’s prescribed duties, highlighting their spiritual and practical significance."
      },
      "slok36": {
        "sanskrit": "अर्जुन उवाच। अथ केन प्रयुक्तोऽयं पापं चरति पूरुषः। अनिच्छन्नपि वार्ष्णेय बलादिव नियोजितः।।3.36।।",
        "transliteration": "arjuna uvāca atha kena prayukto ’yaṁ pāpaṁ carati pūruṣaḥ, anicchann api vārṣṇeya balād iva niyojitaḥ",
        "meaning": "Arjuna said: O Varshneya (Krishna), what compels a person to commit sin, even against their will, as if driven by force?",
        "explanation": "Arjuna, intrigued by Krishna’s teachings, asks about the force that drives people to sin despite their better judgment. This question shifts the focus to the internal obstacles to Karma Yoga, particularly desire and ignorance. It sets the stage for Krishna’s explanation of lust (kama) as the root cause, providing deeper insight into the challenges of selfless action."
      },
      "slok37": {
        "sanskrit": "श्रीभगवानुवाच। काम एष क्रोध एष रजोगुणसमुद्भवः। महाशनो महापाप्मा विद्ध्येनमिह वैरिणम्।।3.37।।",
        "transliteration": "śrī bhagavān uvāca kāma eṣa krodha eṣa rajo-guṇa-samudbhavaḥ, mahāśano mahā-pāpmā viddhy enam iha vairiṇam",
        "meaning": "The Supreme Lord said: It is lust, born of the mode of passion (rajas), which transforms into anger. Know this all-devouring, sinful enemy here.",
        "explanation": "Krishna identifies lust (kama), arising from the guna of rajas, as the primary force behind sinful actions. When unfulfilled, lust becomes anger, leading to destructive behavior. This sloka portrays desire as the greatest obstacle to Karma Yoga, urging Arjuna to recognize and overcome it to perform selfless actions, emphasizing the need for inner purification."
      },
      "slok38": {
        "sanskrit": "धूमेनाव्रियते वह्निर्यथादर्शो मलेन च। यथोल्बेनावृतो गर्भस्तथा तेनेदमावृतम्।।3.38।।",
        "transliteration": "dhūmenāvriyate vahnir yathādarśo malena ca, yatholbenāvṛto garbhas tathā tenedam āvṛtam",
        "meaning": "As fire is covered by smoke, a mirror by dust, or an embryo by the womb, so is knowledge covered by this (lust).",
        "explanation": "Krishna uses metaphors to illustrate how lust obscures wisdom: like smoke veiling fire, dust clouding a mirror, or a womb concealing an embryo. Each represents varying degrees of obstruction, showing how desire clouds judgment. This sloka highlights the challenge of practicing Karma Yoga, urging Arjuna to clear this veil through discipline and detachment to act wisely."
      },
      "slok39": {
        "sanskrit": "आवृतं ज्ञानमेतेन ज्ञानिनो नित्यवैरिणा। कामरूपेण कौन्तेय दुष्पूरेणानलेन च।।3.39।।",
        "transliteration": "āvṛtaṁ jñānam etena jñānino nitya-vairiṇā, kāma-rūpeṇa kaunteya duṣpūreṇānalena ca",
        "meaning": "O son of Kunti, the knowledge of even the wise is covered by this eternal enemy in the form of lust, which is an insatiable fire.",
        "explanation": "Krishna describes lust as an insatiable, ever-burning fire that perpetually obstructs wisdom, even in the learned. This sloka reinforces lust’s role as a formidable barrier to Karma Yoga, emphasizing its relentless nature. Arjuna is warned to remain vigilant, as desire can derail even the spiritually advanced, necessitating constant self-control."
      },
      "slok40": {
        "sanskrit": "इन्द्रियाणि मनो बुद्धिरस्याधिष्ठानमुच्यते। एतैर्विमोहति एष ज्ञानमावृत्य देहिनम्।।3.40।।",
        "transliteration": "indriyāṇi mano buddhir asyādhiṣṭhānam ucyate, etair vimohati eṣa jñānam āvṛtya dehinam",
        "meaning": "The senses, mind, and intellect are said to be its seat. Through these, it (lust) deludes the embodied soul by veiling its knowledge.",
        "explanation": "Krishna identifies the senses, mind, and intellect as the domains where lust operates, clouding the soul’s wisdom and causing delusion. This sloka provides a practical framework for Arjuna to combat desire by controlling these faculties. In Karma Yoga, mastering these seats through discipline enables selfless action, free from the distortions of lust."
      },
      "slok41": {
        "sanskrit": "तस्मात्त्वमिन्द्रियाण्यादौ नियम्य भरतर्षभ। पाप्मानं प्रजहि ह्येनं ज्ञानविज्ञाननाशनम्।।3.41।।",
        "transliteration": "tasmāt tvam indriyāṇy ādau niyamya bharatarṣabha, pāpmānaṁ prajahi hy enaṁ jñāna-vijñāna-nāśanam",
        "meaning": "Therefore, O best of the Bharatas, control the senses first and destroy this sinful destroyer of knowledge and realization.",
        "explanation": "Krishna advises Arjuna to begin by restraining the senses, the primary gateway for lust, to eliminate this sin that destroys both intellectual knowledge and spiritual realization. This sloka offers a practical starting point for Karma Yoga, emphasizing sense control as the foundation for overcoming desire and performing selfless actions with clarity and purpose."
      },
      "slok42": {
        "sanskrit": "इन्द्रियाणि पराण्याहुरिन्द्रियेभ्यः परं मनः। मनसस्तु परा बुद्धिर्यो बुद्धेः परतस्तु सः।।3.42।।",
        "transliteration": "indriyāṇi parāṇy āhur indriyebhyaḥ paraṁ manaḥ, manasas tu parā buddhir yo buddheḥ paratas tu saḥ",
        "meaning": "The senses are said to be superior to the body, the mind superior to the senses, the intellect superior to the mind, and the soul is superior to the intellect.",
        "explanation": "Krishna outlines a hierarchy of faculties: the physical body, senses, mind, intellect, and the soul, with the soul as the highest. This sloka provides a roadmap for self-mastery, showing Arjuna that controlling desire requires progressing from the senses upward to the soul. In Karma Yoga, aligning actions with the soul’s wisdom ensures detachment and spiritual progress."
      },
      "slok43": {
        "sanskrit": "एवं बुद्धेः परं बुद्ध्वा संस्तभ्यात्मानमात्मना। जहि शत्रुं महाबाहो कामरूपं दुरासदम्।।3.43।।",
        "transliteration": "evaṁ buddheḥ paraṁ buddhvā saṁstabhyātmānam ātmanā, jahi śatruṁ mahā-bāho kāma-rūpaṁ durāsadam",
        "meaning": "Thus, knowing that which is beyond the intellect (the soul), steadying the mind with the self, O mighty-armed, conquer the formidable enemy in the form of lust.",
        "explanation": "Krishna concludes Chapter 3 by urging Arjuna to realize the soul’s supremacy and use this wisdom to stabilize the mind, defeating the enemy of lust. This sloka encapsulates the culmination of Karma Yoga’s teachings: by anchoring actions in soul-consciousness, Arjuna can overcome desire and act selflessly. It empowers him to fight both the external war and the internal battle against lust, achieving spiritual victory."
      }
    }
  }
]
