[
  {
    "chapter8": {
      "title": "Akshara Brahma Yoga (The Yoga of the Imperishable Brahman)",
      "description": "In Chapter 8, Krishna answers Arjuna’s questions about Brahman, the self, karma, and the divine, explaining the imperishable nature of the Supreme, the paths of departure at death, and the importance of remembering him. He describes the yogic practices for liberation, the cosmic cycles, and the eternal path to him, guiding Arjuna toward spiritual clarity amidst his warrior duties.",
      "total_verses": 28,
      "slok1": {
        "sanskrit": "अर्जुन उवाच। किं तद्ब्रह्म किमध्यात्मं किं कर्म पुरुषोत्तम। अधिभूतं च किं प्रोक्तमधिदैवं किमुच्यते।।8.1।।",
        "transliteration": "arjuna uvāca kiṁ tad brahma kim adhyātmaṁ kiṁ karma puruṣottama, adhibhūtaṁ ca kiṁ proktam adhidaivaṁ kim ucyate",
        "meaning": "Arjuna said: O Supreme Person, what is Brahman? What is the self? What is karma? What is the material manifestation, and what is the divine?",
        "explanation": "Arjuna begins Chapter 8 with a series of profound questions, seeking clarity on key spiritual concepts: Brahman (the Absolute), the self (adhyatma), karma (action), adhibhuta (material existence), and adhidaiva (the divine). These questions arise from Krishna’s teachings in Chapter 7, reflecting Arjuna’s desire to understand the nature of existence and divinity. For Arjuna, this inquiry is crucial to align his warrior duties with spiritual truth, ensuring his actions lead to liberation."
      },
      "slok2": {
        "sanskrit": "अधियज्ञः कथं कोऽत्र देहेऽस्मिन्मधुसूदन। प्रयाणकाले च कथं ज्ञेयोऽसि नियतात्मभिः।।8.2।।",
        "transliteration": "adhiyajñaḥ kathaṁ ko ’tra dehe ’smin madhusūdana, prayāṇa-kāle ca kathaṁ jñeyo ’si niyatātmabhiḥ",
        "meaning": "Who is the Lord of sacrifice, and how is He in this body, O Madhusudana? And how can You be known at the time of death by the self-controlled?",
        "explanation": "Arjuna continues his questions, asking about adhiyajna (the Lord of sacrifice) and how Krishna is known at the time of death by disciplined souls. This sloka highlights Arjuna’s concern with practical spirituality, especially the critical moment of death, relevant to his role as a warrior facing mortality. Understanding these concepts will help Arjuna act with divine focus, ensuring his spiritual success beyond the battlefield."
      },
      "slok3": {
        "sanskrit": "श्रीभगवानुवाच। अक्षरं ब्रह्म परमं स्वभावोऽध्यात्ममुच्यते। भूतभावोद्भवकरो विसर्गः कर्मसंज्ञितः।।8.3।।",
        "transliteration": "śrī bhagavān uvāca akṣaraṁ brahma paramaṁ svabhāvo ’dhyātmam ucyate, bhūta-bhāvodbhava-karo visargaḥ karma-saṁjñitaḥ",
        "meaning": "The Supreme Lord said: The imperishable Supreme is Brahman; the self is one’s nature; and karma is the creative force that causes the existence of beings.",
        "explanation": "Krishna begins answering, defining Brahman as the imperishable Supreme, adhyatma as the individual soul’s nature, and karma as the actions that generate existence. This sloka lays the foundation for understanding the eternal and temporal aspects of existence. For Arjuna, it clarifies that his soul is eternal, and his actions (like fighting) are part of the cosmic cycle, encouraging detached performance of duty."
      },
      "slok4": {
        "sanskrit": "अधिभूतं क्षरो भावः पुरुषश्चाधिदैवतम्। अधियज्ञोऽहमेवात्र देहे देहभृतां वर।।8.4।।",
        "transliteration": "adhibhūtaṁ kṣaro bhāvaḥ puruṣaś cādhidaivatam, adhiyajño ’ham evātra dehe deha-bhṛtāṁ vara",
        "meaning": "The material manifestation is the perishable nature; the divine is the cosmic being; and I am the Lord of sacrifice, present in this body, O best of the embodied.",
        "explanation": "Krishna defines adhibhuta as the perishable material world, adhidaiva as the cosmic being (divine entities), and adhiyajna as himself, residing in the body as the Lord of sacrifice. This sloka emphasizes Krishna’s immanence in all actions. For Arjuna, it suggests that Krishna is the guiding force within him, enabling him to perform his warrior duties as a sacred offering, aligning with divine will."
      },
      "slok5": {
        "sanskrit": "अन्तकाले च मामेव स्मरन्मुक्त्वा कलेवरम्। यः प्रयाति स मद्भावं याति नास्ति तत्र संशयः।।8.5।।",
        "transliteration": "anta-kāle ca mām eva smaran muktvā kalevaram, yaḥ prayāti sa mad-bhāvaṁ yāti nāsti tatra saṁśayaḥ",
        "meaning": "One who, at the time of death, remembers Me alone and leaves the body, attains My nature. Of this, there is no doubt.",
        "explanation": "Krishna assures that remembering him at death ensures attaining his divine nature, emphasizing the power of final thoughts. This sloka introduces the importance of constant devotion. For Arjuna, facing the battlefield’s dangers, it promises that meditating on Krishna will secure spiritual liberation, encouraging him to dedicate his actions to Krishna, even amidst war."
      },
      "slok6": {
        "sanskrit": "यं यं वापि स्मरन्भावं त्यजत्यन्ते कलेवरम्। तं तमेवैति कौन्तेय सदा तद्भावभावितः।।8.6।।",
        "transliteration": "yaṁ yaṁ vāpi smaran bhāvaṁ tyajaty ante kalevaram, taṁ tam evaiti kaunteya sadā tad-bhāva-bhāvitaḥ",
        "meaning": "Whatever state one remembers at the time of leaving the body, that state one attains, O son of Kunti, due to constant contemplation of it.",
        "explanation": "Krishna explains that one’s final thoughts at death, shaped by habitual contemplation, determine their next state. This sloka underscores the importance of lifelong spiritual focus. For Arjuna, it implies that consistently thinking of Krishna during his warrior duties will ensure a divine destination, motivating him to cultivate devotion amidst the war’s chaos."
      },
      "slok7": {
        "sanskrit": "तस्मात्सर्वेषु कालेषु मामनुस्मर युध्य च। मय्यर्पितमनोबुद्धिर्मामेवैष्यस्यसंशयम्।।8.7।।",
        "transliteration": "tasmāt sarveṣu kāleṣu mām anusmara yudhya ca, mayy arpita-mano-buddhir mām evaiṣyasy asaṁśayam",
        "meaning": "Therefore, remember Me at all times and fight. With your mind and intellect surrendered to Me, you will surely come to Me, without doubt.",
        "explanation": "Krishna instructs Arjuna to remember him constantly while performing his duty to fight, assuring that such dedication will lead to him. This sloka integrates devotion with action. For Arjuna, it directly addresses his dilemma, encouraging him to fight as a warrior while keeping his mind fixed on Krishna, ensuring spiritual success alongside his worldly responsibilities."
      },
      "slok8": {
        "sanskrit": "अभ्यासयोगयुक्तेन चेतसा नान्यगामिना। परमं पुरुषं दिव्यं याति पार्थानुचिन्तयन्।।8.8।।",
        "transliteration": "abhyāsa-yoga-yuktena cetasā nānya-gāminā, paramaṁ puruṣaṁ divyaṁ yāti pārthānucintayan",
        "meaning": "With the mind disciplined by the practice of Yoga, not wandering elsewhere, meditating on the Supreme Divine Person, one attains Him, O Partha.",
        "explanation": "Krishna emphasizes that disciplined meditative practice, with a focused mind, leads to the Supreme Divine. This sloka highlights the role of consistent Yoga in attaining God. For Arjuna, it suggests that cultivating mental discipline through devotion will enable him to remain spiritually connected to Krishna, even in the battlefield’s intensity, ensuring liberation."
      },
      "slok9": {
        "sanskrit": "कविं पुराणमनुशासितारमणोरणीयांसमनुस्मरेद्यः। सर्वस्य धातारमचिन्त्यरूपमादित्यवर्णं तमसः परस्तात्।।8.9।।",
        "transliteration": "kaviṁ purāṇam anuśāsitāram aṇor aṇīyāṁsam anusmared yaḥ, sarvasya dhātāram acintya-rūpam āditya-varṇaṁ tamasaḥ parastāt",
        "meaning": "One who meditates on the omniscient, ancient, ruler, subtler than the subtle, supporter of all, of inconceivable form, radiant like the sun, beyond darkness.",
        "explanation": "Krishna describes the Supreme as omniscient, eternal, the cosmic ruler, subtler than the subtlest, the sustainer, with an inconceivable form, radiant, and beyond ignorance. This sloka provides a meditative focus. For Arjuna, it offers a vivid image of Krishna’s divine nature, inspiring him to meditate on this form, ensuring his warrior actions are infused with spiritual awareness."
      },
      "slok10": {
        "sanskrit": "प्रयाणकाले मनसाचलेन भक्त्या युक्तो योगबलेन चैव। भ्रुवोर्मध्ये प्राणमावेश्य सम्यक्तं यः प्रयाति स मद्भावं याति।।8.10।।",
        "transliteration": "prayāṇa-kāle manasācalena bhaktyā yukto yoga-balena caiva, bhruvor madhye prāṇam āveśya samyak taṁ yaḥ prayāti sa mad-bhāvaṁ yāti",
        "meaning": "At the time of death, with unwavering mind, endowed with devotion and the strength of Yoga, fixing the life force between the eyebrows, one who departs attains My divine nature.",
        "explanation": "Krishna outlines a yogic technique for liberation at death: with devotion, a steady mind, and yogic strength, focusing the prana (life force) between the eyebrows. This sloka offers practical guidance for yogis. For Arjuna, it suggests that such disciplined practice will ensure spiritual success, encouraging him to cultivate devotion to face the war’s mortal dangers with divine assurance."
      },
      "slok11": {
        "sanskrit": "यदक्षरं वेदविदो वदन्ति विशन्ति यद्यतयो वीत रागाः। यदिच्छन्तो ब्रह्मचर्यं चरन्ति तत्ते पदं संग्रहेण प्रवक्ष्ये।।8.11।।",
        "transliteration": "yad akṣaraṁ veda-vido vadanti viśanti yad yatayo vīta-rāgāḥ, yad icchanto brahmacaryaṁ caranti tat te padaṁ saṅgraheṇa pravakṣye",
        "meaning": "I shall briefly explain that imperishable goal which the knowers of the Vedas declare, which the detached ascetics enter, and desiring which they practice celibacy.",
        "explanation": "Krishna introduces the imperishable goal (Brahman), praised by Vedic scholars, attained by detached ascetics, and pursued through celibacy. This sloka sets the stage for describing the path to liberation. For Arjuna, it highlights the sanctity of the spiritual goal, motivating him to integrate such aspiration into his warrior life, ensuring his actions align with the pursuit of the eternal."
      },
      "slok12": {
        "sanskrit": "सर्वद्वाराणि संयम्य मनो हृदि निरुध्य च। मूर्ध्न्याधायात्मनः प्राणमास्थितो योगधारणाम्।।8.12।।",
        "transliteration": "sarva-dvārāṇi saṁyamya mano hṛdi nirudhya ca, mūrdhny ādhāyātmanaḥ prāṇam āsthito yoga-dhāraṇām",
        "meaning": "Controlling all the senses, confining the mind in the heart, fixing the life force in the head, established in yogic concentration.",
        "explanation": "Krishna describes the yogic process for liberation: restraining the senses, focusing the mind in the heart, and directing the prana to the head through concentration. This sloka provides technical meditation guidance. For Arjuna, it suggests that such disciplined practice can be adapted to maintain mental focus in battle, ensuring his actions are spiritually grounded and directed toward liberation."
      },
      "slok13": {
        "sanskrit": "ओमित्येकाक्षरं ब्रह्म व्याहरन्मामनुस्मरन्। यः प्रयाति त्यजन्देहं स याति परमां गतिम्।।8.13।।",
        "transliteration": "om ity ekākṣaraṁ brahma vyāharan mām anusmaran, yaḥ prayāti tyajan dehaṁ sa yāti paramāṁ gatim",
        "meaning": "Chanting the single syllable Om, representing Brahman, and remembering Me while leaving the body, one attains the supreme goal.",
        "explanation": "Krishna instructs that chanting Om and remembering him at death leads to the supreme destination. This sloka emphasizes the power of Om and devotion in achieving liberation. For Arjuna, it offers a practical spiritual practice to ensure liberation, encouraging him to cultivate constant remembrance of Krishna, even amidst the battlefield’s intensity, for ultimate salvation."
      },
      "slok14": {
        "sanskrit": "अनन्यचेताः सततं यो मां स्मरति नित्यशः। तस्याहं सुलभः पार्थ नित्ययुक्तस्य योगिनः।।8.14।।",
        "transliteration": "ananya-cetāḥ satataṁ yo māṁ smarati nityaśaḥ, tasyāhaṁ sulabhaḥ pārtha nitya-yuktasya yoginaḥ",
        "meaning": "For one who always remembers Me with an undistracted mind, constantly devoted, O Partha, I am easily attainable for that ever-united Yogi.",
        "explanation": "Krishna assures that a Yogi who constantly remembers him with single-minded devotion easily attains him. This sloka highlights the accessibility of God through unwavering devotion. For Arjuna, it promises that dedicating his warrior actions to Krishna with constant remembrance will make liberation attainable, providing spiritual confidence amidst his battlefield challenges."
      },
      "slok15": {
        "sanskrit": "मामुपेत्य पुनर्जन्म दुःखालयमशाश्वतम्। नाप्नुवन्ति महात्मानः संसिद्धिं परमां गताः।।8.15।।",
        "transliteration": "mām upetya punar janma duḥkhālayam aśāśvatam, nāpnuvanti mahātmānaḥ saṁsiddhiṁ paramāṁ gatāḥ",
        "meaning": "Having attained Me, the great souls do not take rebirth in this transient, sorrowful world, for they have achieved the highest perfection.",
        "explanation": "Krishna states that those who attain him are freed from the cycle of rebirth, escaping the transient, painful world, having achieved ultimate perfection. This sloka emphasizes liberation as the ultimate goal. For Arjuna, it assures that devotion to Krishna will lead to eternal freedom, motivating him to perform his duties with the aim of transcending worldly suffering."
      },
      "slok16": {
        "sanskrit": "आब्रह्मभुवनाल्लोकाः पुनरावर्तिनोऽर्जुन। मामुपेत्य तु कौन्तेय पुनर्जन्म न विद्यते।।8.16।।",
        "transliteration": "ā-brahma-bhuvanāl lokāḥ punarāvartino ’rjuna, mām upetya tu kaunteya punar janma na vidyate",
        "meaning": "All worlds, up to the realm of Brahma, are subject to return (rebirth), O Arjuna. But having attained Me, O son of Kunti, there is no rebirth.",
        "explanation": "Krishna explains that all material realms, even Brahma’s, are temporary, leading to rebirth, but attaining him ensures liberation from the cycle. This sloka contrasts material and spiritual destinations. For Arjuna, it underscores the superiority of devotion to Krishna, encouraging him to dedicate his warrior actions to achieving this eternal state, beyond the war’s transient outcomes."
      },
      "slok17": {
        "sanskrit": "सहस्रयुगपर्यन्तमहर्यद्ब्रह्मणो विदुः। रात्रिं युगसहस्रान्तां तेऽहोरात्रविदो जनाः।।8.17।।",
        "transliteration": "sahasra-yuga-paryantam ahar yad brahmaṇo viduḥ, rātriṁ yuga-sahasrāntāṁ te ’ho-rātra-vido janāḥ",
        "meaning": "Those who know the day of Brahma, lasting a thousand yugas, and the night, also a thousand yugas, understand day and night.",
        "explanation": "Krishna describes the cosmic cycle, where Brahma’s day and night each last a thousand yugas (4.32 billion years), governing creation and dissolution. This sloka introduces the vastness of cosmic time. For Arjuna, it contextualizes the war’s fleeting nature within the grand cosmic order, encouraging him to focus on eternal spiritual goals rather than temporary worldly conflicts."
      },
      "slok18": {
        "sanskrit": "अव्यक्ताद्व्यक्तयः सर्वाः प्रभवन्त्यहरागमे। रात्र्यागमे प्रलीयन्ते तत्रैवाव्यक्तसंज्ञके।।8.18।।",
        "transliteration": "avyaktād vyaktayaḥ sarvāḥ prabhavanty ahar-āgame, rātry-āgame pralīyante tatraivāvyakta-saṁjñake",
        "meaning": "At the dawn of Brahma’s day, all manifest beings emerge from the unmanifest; at the night’s arrival, they dissolve into that same unmanifest.",
        "explanation": "Krishna explains that during Brahma’s day, all beings manifest from the unmanifest (primordial state), and during the night, they dissolve back into it. This sloka illustrates the cyclic nature of creation. For Arjuna, it emphasizes the impermanence of the material world, including the war, urging him to seek the eternal through devotion to Krishna, transcending these cycles."
      },
      "slok19": {
        "sanskrit": "भूतग्रामः स एवायं भूत्वा भूत्वा प्रलीयते। रात्र्यागमे अवशः पार्थ प्रभवत्यहरागमे।।8.19।।",
        "transliteration": "bhūta-grāmaḥ sa evāyaṁ bhūtvā bhūtvā pralīyate, rātry-āgame avaśaḥ pārtha prabhavaty ahar-āgame",
        "meaning": "This multitude of beings, repeatedly born, dissolves helplessly at the night’s arrival, O Partha, and emerges at the day’s dawn.",
        "explanation": "Krishna reiterates that beings are involuntarily caught in the cycle of creation and dissolution, manifesting and dissolving with Brahma’s day and night. This sloka underscores the lack of control in material existence. For Arjuna, it highlights the futility of attachment to the war’s outcomes, encouraging him to focus on Krishna to escape this cycle and attain eternal liberation."
      },
      "slok20": {
        "sanskrit": "परस्तस्मात्तु भावोऽन्योऽव्यक्तोऽव्यक्तात्सनातनः। यः स सर्वेषु भूतेषु नश्यत्सु न विनश्यति।।8.20।।",
        "transliteration": "paras tasmāt tu bhāvo ’nyo ’vyakto ’vyaktāt sanātanaḥ, yaḥ sa sarveṣu bhūteṣu naśyatsu na vinaśyati",
        "meaning": "Beyond that unmanifest is another eternal unmanifest reality, which does not perish when all beings perish.",
        "explanation": "Krishna describes a higher, eternal unmanifest reality (Brahman), distinct from the material unmanifest, which remains imperishable even when all beings dissolve. This sloka introduces the eternal spiritual realm. For Arjuna, it offers a vision of the eternal beyond the war’s destruction, motivating him to seek this imperishable state through devotion, ensuring spiritual permanence."
      },
      "slok21": {
        "sanskrit": "अव्यक्तोऽक्षर इत्युक्तस्तमाहुः परमां गतिम्। यं प्राप्य न निवर्तन्ते तद्धाम परमं मम।।8.21।।",
        "transliteration": "avyakto ’kṣara ity uktas tam āhuḥ paramāṁ gatim, yaṁ prāpya na nivartante tad dhāma paramaṁ mama",
        "meaning": "That unmanifest, called the imperishable, is declared the supreme goal. Attaining it, one does not return. That is My supreme abode.",
        "explanation": "Krishna identifies the eternal unmanifest (Brahman) as the imperishable supreme goal, his divine abode, from which there is no return to rebirth. This sloka emphasizes liberation’s finality. For Arjuna, it assures that devotion to Krishna leads to this eternal abode, encouraging him to perform his warrior duties with the aim of reaching this ultimate destination, beyond worldly strife."
      },
      "slok22": {
        "sanskrit": "पुरुषः स परः पार्थ भक्त्या लभ्यस्त्वनन्यया। यस्यान्तःस्थानि भूतानि येन सर्वमिदं ततम्।।8.22।।",
        "transliteration": "puruṣaḥ sa paraḥ pārtha bhaktyā labhyas tv ananyayā, yasyāntaḥsthāni bhūtāni yena sarvam idaṁ tatam",
        "meaning": "That Supreme Person, O Partha, in whom all beings reside and who pervades all, is attainable through unwavering devotion.",
        "explanation": "Krishna declares that the Supreme Person, who contains and pervades all existence, is reached through exclusive devotion. This sloka emphasizes bhakti as the path to God. For Arjuna, it reinforces that single-minded devotion to Krishna, even amidst battle, ensures attainment of the Supreme, providing spiritual focus and purpose to his warrior actions."
      },
      "slok23": {
        "sanskrit": "यत्र काले त्वनावृत्तिमावृत्तिं चैव योगिनः। प्रयाता यान्ति तं कालं वक्ष्यामि भरतर्षभ।।8.23।।",
        "transliteration": "yatra kāle tv anāvṛttim āvṛttiṁ caiva yoginaḥ, prayātā yānti taṁ kālaṁ vakṣyāmi bharatarṣabha",
        "meaning": "I shall now declare, O best of the Bharatas, the times at which Yogis departing attain freedom from return or return, respectively.",
        "explanation": "Krishna introduces the concept of different paths at death, determined by the time of departure, leading either to liberation (no return) or rebirth (return). This sloka sets the stage for cosmic timing. For Arjuna, it provides context for understanding spiritual outcomes, encouraging him to focus on devotion to ensure liberation, regardless of the war’s temporal circumstances."
      },
      "slok24": {
        "sanskrit": "अग्निर्ज्योतिरहः शुक्लः षण्मासा उत्तरायणम्। तत्र प्रयाता गच्छन्ति ब्रह्म ब्रह्मविदो जनाः।।8.24।।",
        "transliteration": "agnir jyotir ahaḥ śuklaḥ ṣaṇ-māsā uttarāyaṇam, tatra prayātā gacchanti brahma brahma-vido janāḥ",
        "meaning": "Those who depart in the presence of fire, light, day, the bright fortnight, or the six months of the northern solstice attain Brahman, knowers of Brahman.",
        "explanation": "Krishna describes the ‘path of light’ (uttarayana, bright conditions) taken by knowers of Brahman, leading to liberation. This sloka outlines the auspicious cosmic path for Yogis. For Arjuna, it emphasizes the spiritual significance of one’s state at death, encouraging him to cultivate constant devotion to Krishna to ensure a liberated destination, beyond the war’s material constraints."
      },
      "slok25": {
        "sanskrit": "धूमो रात्रिस्तथा कृष्णः षण्मासा दक्षिणायनम्। तत्र चान्द्रमसं ज्योतिर्योगी प्राप्य निवर्तते।।8.25।।",
        "transliteration": "dhūmo rātris tathā kṛṣṇaḥ ṣaṇ-māsā dakṣiṇāyanam, tatra cāndramasaṁ jyotir yogī prāpya nivartate",
        "meaning": "Those who depart in smoke, night, the dark fortnight, or the six months of the southern solstice attain the lunar light and return (rebirth).",
        "explanation": "Krishna describes the ‘path of darkness’ (dakshinayana, inauspicious conditions), leading to temporary heavenly realms and rebirth. This sloka contrasts with the path of liberation. For Arjuna, it underscores the importance of transcending material conditions through devotion, ensuring his warrior actions align with the path of light, avoiding the cycle of rebirth."
      },
      "slok26": {
        "sanskrit": "शुक्लकृष्णे गती ह्येते जगतः शाश्वते मते। एकया यात्यनावृत्तिमन्ययावर्तते पुनः।।8.26।।",
        "transliteration": "śukla-kṛṣṇe gatī hy ete jagataḥ śāśvate mate, ekayā yāty anāvṛttim anyayāvartate punaḥ",
        "meaning": "These two paths—bright and dark—are considered eternal for the world. By one, one attains non-return; by the other, one returns again.",
        "explanation": "Krishna summarizes the two eternal paths: the bright path leading to liberation and the dark path leading to rebirth. This sloka clarifies the cosmic destinies based on spiritual state. For Arjuna, it reinforces the need to pursue the path of light through devotion to Krishna, ensuring his warrior duties contribute to liberation rather than entanglement in rebirth."
      },
      "slok27": {
        "sanskrit": "नैते सृती पार्थ जानन्योगी मुह्यति कश्चन। तस्मात्सर्वेषु कालेषु योगयुक्तो भवार्जुन।।8.27।।",
        "transliteration": "naite sṛtī pārtha jānan yogī muhyati kaścana, tasmāt sarveṣu kāleṣu yoga-yukto bhavārjuna",
        "meaning": "Knowing these two paths, O Partha, no Yogi is deluded. Therefore, at all times, be steadfast in Yoga, O Arjuna.",
        "explanation": "Krishna assures that a Yogi who understands these paths avoids delusion, urging Arjuna to remain steadfast in Yoga at all times. This sloka emphasizes the clarity gained through spiritual knowledge. For Arjuna, it encourages maintaining yogic discipline in battle, ensuring his actions are guided by divine wisdom, securing the path to liberation regardless of external conditions."
      },
      "slok28": {
        "sanskrit": "वेदेषु यज्ञेषु तपःसु चैव दानेषु यत्पुण्यफलं प्रदिष्टम्। अत्येति तत्सर्वमिदं विदित्वा योगी परं स्थानमुपैति चाद्यम्।।8.28।।",
        "transliteration": "vedeṣu yajñeṣu tapaḥsu caiva dāneṣu yat puṇya-phalaṁ pradiṣṭam, atyeti tat sarvam idaṁ viditva yogī paraṁ sthānam upaiti cādyam",
        "meaning": "The Yogi, knowing this, transcends the merits of Vedic study, sacrifices, austerities, and charity, and attains the supreme, primal abode.",
        "explanation": "Krishna concludes Chapter 8, stating that a Yogi who understands these teachings surpasses the limited fruits of Vedic rituals, austerities, and charity, attaining the supreme eternal abode. This sloka elevates Yoga above ritualistic practices. For Arjuna, it assures that dedicating his warrior duties to Krishna through Yoga will lead to the highest spiritual goal, transcending the war’s temporary outcomes and securing eternal liberation."
      }
    }
  }
]
