[
  {
    "chapter10": {
      "title": "Vibhuti Yoga (The Yoga of Divine Glories)",
      "description": "In Chapter 10, Krishna reveals his divine glories, describing his all-pervading presence in the universe’s most excellent manifestations. He explains how recognizing these vibhutis fosters devotion, enabling Arjuna to perceive his supreme nature. This knowledge strengthens Arjuna’s resolve as a warrior, aligning his duties with devotion to Krishna, leading to spiritual liberation.",
      "total_verses": 42,
      "slok1": {
        "sanskrit": "श्रीभगवानुवाच। भूय एव महाबाहो शृणु मे परमं वचः। यत्तेऽहं प्रीयमाणाय वक्ष्यामि हितकाम्यया।।10.1।।",
        "transliteration": "śrī bhagavān uvāca bhūya eva mahā-bāho śṛṇu me paramaṁ vacaḥ, yat te ’haṁ prīyamāṇāya vakṣyāmi hita-kāmyayā",
        "meaning": "The Supreme Lord said: Again, O mighty-armed, listen to My supreme words, which I shall speak to you, who are dear to Me, for your benefit.",
        "explanation": "Krishna begins Chapter 10, addressing Arjuna affectionately, promising to reveal supreme teachings for his welfare. This sloka sets the tone for Vibhuti Yoga, emphasizing Krishna’s desire to uplift Arjuna. For Arjuna, it reassures him of Krishna’s guidance, encouraging him to absorb this knowledge to gain spiritual clarity, strengthening his resolve to perform his warrior duties."
      },
      "slok2": {
        "sanskrit": "न मे विदुः सुरगणाः प्रभवं न महर्षयः। अहमादिर्हि देवानां महर्षीणां च सर्वशः।।10.2।।",
        "transliteration": "na me viduḥ sura-gaṇāḥ prabhavaṁ na maharṣayaḥ, aham ādir hi devānāṁ maharṣīṇāṁ ca sarvaśaḥ",
        "meaning": "Neither the gods nor the great sages know My origin, for I am the source of the gods and sages in every way.",
        "explanation": "Krishna declares his supreme origin, unknown even to gods and sages, as he is their source. This sloka establishes his transcendental nature. For Arjuna, it underscores Krishna’s divine authority, inspiring him to trust Krishna’s guidance in the war, recognizing that the battlefield’s events are under the control of the ultimate source."
      },
      "slok3": {
        "sanskrit": "यो मामजम्पुराणं च वेत्ति लोकमहेश्वरम्। असम्मूढः स मर्त्येषु सर्वपापैः प्रमुच्यति।।10.3।।",
        "transliteration": "yo mām ajam anādiṁ ca vetti loka-maheśvaram, asammūḍhaḥ sa martyeṣu sarva-pāpaiḥ pramucyati",
        "meaning": "One who knows Me as unborn, beginningless, and the great Lord of the worlds, undeluded among mortals, is freed from all sins.",
        "explanation": "Krishna states that recognizing him as the unborn, eternal Lord of all liberates one from delusion and sins. This sloka highlights the liberating power of true knowledge. For Arjuna, it promises that understanding Krishna’s supreme nature will purify his actions in the war, enabling him to fight without the burden of sin, aligned with divine will."
      },
      "slok4": {
        "sanskrit": "बुद्धिर्ज्ञानमसम्मोहः क्षमा सत्यं दमः शमः। सुखं दुःखं भवोऽभावो भयं चाभयमेव च।।10.4।।",
        "transliteration": "buddhir jñānam asammohaḥ kṣamā satyaṁ damaḥ śamaḥ, sukhaṁ duḥkhaṁ bhavo ’bhāvo bhayaṁ cābhayam eva ca",
        "meaning": "Intelligence, knowledge, freedom from delusion, forgiveness, truth, self-control, calmness, pleasure, pain, birth, death, fear, and fearlessness.",
        "explanation": "Krishna begins listing his divine glories, identifying himself as the source of intellectual and emotional qualities. This sloka introduces his vibhutis in abstract attributes. For Arjuna, it suggests that his own intelligence and courage in battle are manifestations of Krishna, encouraging him to wield them with devotion, seeing Krishna in his warrior qualities."
      },
      "slok5": {
        "sanskrit": "अहिंसा समता तुष्टिस्तपो दानं यशोऽयशः। भवन्ति भावा भूतानां मत्त एव पृथग्विधाः।।10.5।।",
        "transliteration": "ahiṁsā samatā tuṣṭis tapo dānaṁ yaśo ’yaśaḥ, bhavanti bhāvā bhūtānāṁ matta eva pṛthag-vidhāḥ",
        "meaning": "Non-violence, equanimity, contentment, austerity, charity, fame, and infamy—these various states of beings arise from Me alone.",
        "explanation": "Krishna continues listing his glories, encompassing moral and social qualities like non-violence, contentment, and fame. This sloka emphasizes his role as the source of all states. For Arjuna, it implies that the war’s dynamics, including honor and challenges, originate from Krishna, urging him to act with equanimity, dedicating his efforts to the divine source."
      },
      "slok6": {
        "sanskrit": "महर्षयः सप्त पूर्वं चत्वारो मनवस्तथा। मद्भावा मानसा जाता येषां लोक इमाः प्रजाः।।10.6।।",
        "transliteration": "maharṣayaḥ sapta pūrvaṁ catvāro manavas tathā, mad-bhāvā mānasā jātā yeṣāṁ loka imāḥ prajāḥ",
        "meaning": "The seven great sages and the four Manus, born of My mind, endowed with My nature, are the ancestors of all beings in this world.",
        "explanation": "Krishna identifies the seven sages and four Manus, cosmic progenitors, as originating from his mind, carrying his essence. This sloka highlights his role in cosmic ancestry. For Arjuna, it contextualizes the war within the cosmic order, encouraging him to see his role as a warrior as part of Krishna’s divine plan, acting with spiritual purpose."
      },
      "slok7": {
        "sanskrit": "एतां विभूतिं योगं च मम यो वेत्ति तत्त्वतः। सोऽविकम्पेन योगेन युज्यते नात्र संशयः।।10.7।।",
        "transliteration": "etāṁ vibhūtiṁ yogaṁ ca mama yo vetti tattvataḥ, so ’vikampena yogena yujyate nātra saṁśayaḥ",
        "meaning": "One who truly knows My glories and mystic power is united with Me through unwavering Yoga, without doubt.",
        "explanation": "Krishna assures that understanding his divine glories and mystic power leads to unshakeable union through Yoga. This sloka emphasizes the spiritual benefit of recognizing his vibhutis. For Arjuna, it promises that perceiving Krishna’s presence in the war’s elements will strengthen his devotion, enabling him to fight with unwavering spiritual focus and achieve liberation."
      },
      "slok8": {
        "sanskrit": "अहं सर्वस्य प्रभवो मत्तः सर्वं प्रवर्तति। इति मत्वा भजन्ति मां बुधा भावसमन्विताः।।10.8।।",
        "transliteration": "ahaṁ sarvasya prabhavo mattaḥ sarvaṁ pravartati, iti matvā bhajanti māṁ budhā bhāva-samanvitāḥ",
        "meaning": "I am the source of all; from Me everything proceeds. Understanding this, the wise worship Me with loving devotion.",
        "explanation": "Krishna declares himself the origin of all existence, inspiring the wise to worship him with love. This sloka underscores his universal causality and the response of devotion. For Arjuna, it encourages seeing Krishna as the source of the war’s events, motivating him to dedicate his warrior actions as an act of loving worship, aligning with divine purpose."
      },
      "slok9": {
        "sanskrit": "मच्चित्ता मद्गतप्राणा बोधयन्तः परस्परम्। कथयन्तश्च मां नित्यं तुष्यन्ति च रमन्ति च।।10.9।।",
        "transliteration": "mac-cittā mad-gata-prāṇā bodhayantaḥ parasparam, kathayantaś ca māṁ nityaṁ tuṣyanti ca ramanti ca",
        "meaning": "With minds fixed on Me, lives surrendered to Me, enlightening each other, and always speaking of Me, they are content and delighted.",
        "explanation": "Krishna describes devotees whose thoughts, lives, and conversations revolve around him, finding joy and contentment. This sloka highlights the bliss of devotion. For Arjuna, it suggests that integrating Krishna-centric thoughts into his warrior life will bring spiritual joy, transforming his battlefield struggles into a source of divine connection and fulfillment."
      },
      "slok10": {
        "sanskrit": "तेषां सततयुक्तानां भजतां प्रीतिपूर्वकम्। ददामि बुद्धियोगं तं येन ममामुपयान्ति ते।।10.10।।",
        "transliteration": "teṣāṁ satata-yuktānāṁ bhajatāṁ prīti-pūrvakam, dadāmi buddhi-yogaṁ taṁ yena mām upayānti te",
        "meaning": "To those who are constantly devoted and worship Me with love, I grant the Yoga of discernment, by which they come to Me.",
        "explanation": "Krishna promises to bestow buddhi-yoga (divine wisdom) on devoted worshippers, enabling them to reach him. This sloka emphasizes his grace in guiding devotees. For Arjuna, it assures that his devotion will bring Krishna’s wisdom, helping him navigate the war’s moral complexities with clarity, ensuring his actions lead to spiritual union."
      },
      "slok11": {
        "sanskrit": "तेषामेवानुकम्पार्थमहमज्ञानजं तमः। नाशयाम्यात्मभावस्थो ज्ञानदीपेन भास्वता।।10.11।।",
        "transliteration": "teṣām evānukampārtham aham ajñāna-jaṁ tamaḥ, nāśayāmy ātma-bhāva-stho jñāna-dīpena bhāsvatā",
        "meaning": "Out of compassion for them, I, dwelling in their hearts, destroy the darkness born of ignorance with the radiant lamp of knowledge.",
        "explanation": "Krishna describes his compassionate role, residing in devotees’ hearts and dispelling ignorance with the light of knowledge. This sloka highlights his active guidance. For Arjuna, it assures that Krishna’s presence within him will illuminate his path, helping him overcome doubts in the war, ensuring his warrior actions are guided by divine wisdom."
      },
      "slok12": {
        "sanskrit": "अर्जुन उवाच। परं ब्रह्म परं धाम पवित्रं परमं भवान्। पुरुषं शाश्वतं दिव्यमादिदेवमजं विभुम्।।10.12।।",
        "transliteration": "arjuna uvāca paraṁ brahma paraṁ dhāma pavitraṁ paramaṁ bhavān, puruṣaṁ śāśvataṁ divyam ādi-devam ajaṁ vibhum",
        "meaning": "Arjuna said: You are the Supreme Brahman, the Supreme Abode, the Supreme Purifier, the eternal divine Person, the primal God, unborn, and all-pervading.",
        "explanation": "Arjuna acknowledges Krishna as the Supreme Brahman, eternal, divine, and all-pervading, reflecting his growing understanding of Krishna’s divinity. This sloka marks Arjuna’s reverence. For Arjuna, this realization strengthens his resolve, encouraging him to see his warrior duties as service to the supreme Lord, aligning his actions with divine purpose."
      },
      "slok13": {
        "sanskrit": "आहुस्त्वामृषयः सर्वे देवर्षिर्नारदस्तथा। असितो देवलो व्यासः स्वयं चैव ब्रवीषि मे।।10.13।।",
        "transliteration": "āhus tvām ṛṣayaḥ sarve devarṣir nāradas tathā, asito devalo vyāsaḥ svayaṁ caiva bravīṣi me",
        "meaning": "All the sages, including Narada, Asita, Devala, and Vyasa, proclaim You thus, and You Yourself tell me.",
        "explanation": "Arjuna cites the authority of sages like Narada and Vyasa, and Krishna’s own words, affirming his divine nature. This sloka reinforces Krishna’s credibility through tradition. For Arjuna, it validates Krishna’s teachings, urging him to trust Krishna’s guidance in the war, knowing that his warrior actions are supported by divine and sage-endorsed truth."
      },
      "slok14": {
        "sanskrit": "सर्वमेतदृतं मन्ये यन्मां वदसि केशव। न हि ते भगवान्व्यक्तिं विदुर्देवा न दानवाः।।10.14।।",
        "transliteration": "sarvam etad ṛtaṁ manye yan māṁ vadasi keśava, na hi te bhagavan vyaktiṁ vidur devā na dānavāḥ",
        "meaning": "I believe all that You tell me to be true, O Keshava. Neither gods nor demons know Your manifestation, O Lord.",
        "explanation": "Arjuna expresses complete faith in Krishna’s words, acknowledging that even gods and demons cannot fully comprehend his divine nature. This sloka reflects Arjuna’s trust and humility. For Arjuna, this faith empowers him to follow Krishna’s guidance in the war, ensuring his warrior duties are performed with confidence in divine truth."
      },
      "slok15": {
        "sanskrit": "स्वयमेवात्मनात्मानं वेत्थ त्वं पुरुषोत्तम। भूतभावन भूतेश देवदेव जगत्पते।।10.15।।",
        "transliteration": "svayam evātmanātmānaṁ vettha tvaṁ puruṣottama, bhūta-bhāvana bhūteśa deva-deva jagat-pate",
        "meaning": "You alone know Yourself by Yourself, O Supreme Person, creator of beings, Lord of beings, God of gods, Lord of the universe.",
        "explanation": "Arjuna praises Krishna as the self-knowing Supreme, the creator and Lord of all, emphasizing his unique omniscience. This sloka exalts Krishna’s divine sovereignty. For Arjuna, it deepens his reverence, encouraging him to surrender his warrior role to Krishna, the universal Lord, ensuring his actions align with the divine will of the Supreme."
      },
      "slok16": {
        "sanskrit": "वक्तुमर्हस्यशेषेण दिव्या ह्यात्मविभूतयः। याभिर्विभूतिभिर्लोकानिमांस्त्वं व्याप्य तिष्ठसि।।10.16।।",
        "transliteration": "vaktum arhasy aśeṣeṇa divyā hy ātma-vibhūtayaḥ, yābhir vibhūtibhir lokān imāṁs tvaṁ vyāpya tiṣṭhasi",
        "meaning": "You should fully describe Your divine glories, by which You pervade and abide in all these worlds.",
        "explanation": "Arjuna requests Krishna to elaborate on his divine glories, recognizing that they permeate all existence. This sloka expresses Arjuna’s eagerness to understand Krishna’s manifestations. For Arjuna, knowing these glories will help him perceive Krishna in the war’s elements, transforming his battlefield actions into acts of devotion and spiritual awareness."
      },
      "slok17": {
        "sanskrit": "कथं विद्यामहं योगिंस्त्वां सदा परिचिन्तयन्। केषु केषु च भावेषु चिन्त्योऽसि भगवन्मया।।10.17।।",
        "transliteration": "kathaṁ vidyām ahaṁ yogins tvāṁ sadā paricintayan, keṣu keṣu ca bhāveṣu cintyo ’si bhagavan mayā",
        "meaning": "How may I know You, O Yogi, by constantly meditating on You? In what forms are You to be contemplated by me, O Lord?",
        "explanation": "Arjuna asks how to meditate on Krishna and in which forms to contemplate him, seeking practical guidance for devotion. This sloka reflects his desire for a tangible connection. For Arjuna, this knowledge will enable him to see Krishna in the war’s challenges, making his warrior duties a meditative practice, fostering spiritual focus and liberation."
      },
      "slok18": {
        "sanskrit": "विस्तरेणात्मनो योगं विभूतिं च जनार्दन। भूयः कथय तृप्तिर्हि शृण्वतो नास्ति मेऽमृतम्।।10.18।।",
        "transliteration": "vistareṇātmano yogaṁ vibhūtiṁ ca janārdana, bhūyaḥ kathaya tṛptir hi śṛṇvato nāsti me ’mṛtam",
        "meaning": "Describe again in detail Your mystic power and glories, O Janardana. I am never satiated hearing Your nectar-like words.",
        "explanation": "Arjuna, captivated by Krishna’s teachings, requests a detailed account of his mystic powers and glories, comparing his words to nectar. This sloka shows Arjuna’s spiritual enthusiasm. For Arjuna, this knowledge will deepen his devotion, allowing him to perceive Krishna’s presence in the war, transforming his warrior role into a divine offering."
      },
      "slok19": {
        "sanskrit": "श्रीभगवानुवाच। हन्त ते कथयिष्यामि दिव्या ह्यात्मविभूतयः। प्राधान्यतः कुरुश्रेष्ठ नास्त्यन्तो विस्तरस्य मे।।10.19।।",
        "transliteration": "śrī bhagavān uvāca hanta te kathayiṣyāmi divyā hy ātma-vibhūtayaḥ, prādhānyataḥ kuru-śreṣṭha nāsty anto vistarasya me",
        "meaning": "The Supreme Lord said: Very well, I shall describe My divine glories, O best of the Kurus, but only the prominent ones, for there is no end to My expanse.",
        "explanation": "Krishna agrees to describe his divine glories, focusing on the most prominent, as their full extent is limitless. This sloka introduces the enumeration of his vibhutis. For Arjuna, it prepares him to see Krishna’s presence in the war’s key elements, encouraging him to perform his duties with awe and devotion, recognizing the divine in all."
      },
      "slok20": {
        "sanskrit": "अहमात्मा गुडाकेश सर्वभूताशयस्थितः। अहमादिश्च मध्यं च भूतानामन्त एव च।।10.20।।",
        "transliteration": "aham ātmā guḍākeśa sarva-bhūtāśaya-sthitaḥ, aham ādiś ca madhyaṁ ca bhūtānām anta eva ca",
        "meaning": "I am the Self, O Gudakesha, seated in the hearts of all beings. I am the beginning, middle, and end of all beings.",
        "explanation": "Krishna identifies himself as the Self within all beings and the origin, sustenance, and dissolution of all. This sloka emphasizes his immanence and cosmic role. For Arjuna, it suggests that Krishna resides in his heart and governs the war’s events, urging him to act with the awareness of Krishna’s presence, aligning his duties with divine will."
      },
      "slok21": {
        "sanskrit": "आदित्यानामहं विष्णुर्ज्योतिषां रविरंशुमान्। मरीचिर्मरुतामस्मि नक्षत्राणामहं शशी।।10.21।।",
        "transliteration": "ādityānām ahaṁ viṣṇur jyotiṣāṁ ravir aṁśumān, marīcir marutām asmi nakṣatrāṇām ahaṁ śaśī",
        "meaning": "Among the Adityas, I am Vishnu; among luminaries, the radiant sun; among the Maruts, I am Marichi; among the stars, I am the moon.",
        "explanation": "Krishna begins listing his cosmic manifestations, identifying with the most prominent entities in various categories. This sloka showcases his divine presence in celestial realms. For Arjuna, it encourages seeing Krishna’s glory in the sun and moon, inspiring him to view the battlefield’s grandeur as a reflection of Krishna, strengthening his devotion."
      },
      "slok22": {
        "sanskrit": "वेदानां सामवेदोऽस्मि देवानामस्मि वासवः। इन्द्रियाणां मनश्चास्मि भूतानामस्मि चेतना।।10.22।।",
        "transliteration": "vedānāṁ sāma-vedo ’smi devānām asmi vāsavaḥ, indriyāṇāṁ manaś cāsmi bhūtānām asmi cetanā",
        "meaning": "Among the Vedas, I am the Sama Veda; among the gods, I am Indra; among the senses, I am the mind; among beings, I am consciousness.",
        "explanation": "Krishna continues, identifying with the Sama Veda, Indra, the mind, and consciousness, representing the finest in spiritual, divine, and sentient realms. This sloka highlights his pervasive excellence. For Arjuna, it suggests that his own consciousness and mental resolve in battle are Krishna’s manifestations, urging him to dedicate them to divine service."
      },
      "slok23": {
        "sanskrit": "रुद्राणां शङ्करश्चास्मि वित्तेशो यक्षरक्षसाम्। वसूनां पावकश्चास्मि मेरुः शिखरिणामहम्।।10.23।।",
        "transliteration": "rudrāṇāṁ śaṅkaraś cāsmi vitteśo yakṣa-rakṣasām, vasūnāṁ pāvakaś cāsmi meruḥ śikhariṇām aham",
        "meaning": "Among the Rudras, I am Shankara; among Yakshas and Rakshasas, I am Kubera; among the Vasus, I am fire; among mountains, I am Meru.",
        "explanation": "Krishna identifies with Shankara (Shiva), Kubera, fire, and Mount Meru, representing the most exalted in divine and natural categories. This sloka continues his vibhuti enumeration. For Arjuna, it encourages seeing Krishna’s glory in the war’s fierceness (like fire) and stability (like Meru), inspiring him to fight with reverence for the divine presence."
      },
      "slok24": {
        "sanskrit": "पुरोधसां च मुख्यं मां विद्धि पार्थ बृहस्पतिम्। सेनानीनामहं स्कन्दः सरसामस्मि सागरः।।10.24।।",
        "transliteration": "purodhasāṁ ca mukhyaṁ māṁ viddhi pārtha bṛhaspatim, senānīnām ahaṁ skandaḥ sarasām asmi sāgaraḥ",
        "meaning": "Among priests, know Me as Brihaspati, O Partha; among generals, I am Skanda; among bodies of water, I am the ocean.",
        "explanation": "Krishna identifies with Brihaspati (chief priest), Skanda (war god), and the ocean, representing wisdom, martial prowess, and vastness. This sloka highlights his diverse glories. For Arjuna, it connects directly to his role, suggesting that Krishna is the supreme general guiding the war, inspiring him to follow Krishna’s strategic wisdom with devotion."
      },
      "slok25": {
        "sanskrit": "महर्षीणां भृगुरहं गिरामस्म्येकमक्षरम्। यज्ञानां जपयज्ञोऽस्मि स्थावराणां हिमालयः।।10.25।।",
        "transliteration": "maharṣīṇāṁ bhṛgur ahaṁ girām asmy ekam akṣaram, yajñānāṁ japa-yajño ’smi sthāvarāṇāṁ himālayaḥ",
        "meaning": "Among great sages, I am Bhrigu; among words, I am the single syllable Om; among sacrifices, I am the chanting sacrifice; among immovable things, I am the Himalayas.",
        "explanation": "Krishna identifies with Bhrigu, the sacred Om, the japa-yajna (chanting), and the Himalayas, representing spiritual, verbal, and natural supremacy. This sloka emphasizes his sacred presence. For Arjuna, it suggests that chanting Krishna’s name or Om can sanctify his warrior actions, with the Himalayas symbolizing the steadfastness he should emulate in battle."
      },
      "slok26": {
        "sanskrit": "अश्वत्थः सर्ववृक्षाणां देवर्षीणां च नारदः। गन्धर्वाणां चित्ररथः सिद्धानां कपिलो मुनिः।।10.26।।",
        "transliteration": "aśvatthaḥ sarva-vṛkṣāṇāṁ devarṣīṇāṁ ca nāradaḥ, gandharvāṇāṁ citrarathaḥ siddhānāṁ kapilo muniḥ",
        "meaning": "Among all trees, I am the peepal; among divine sages, I am Narada; among Gandharvas, I am Chitraratha; among perfected beings, I am Kapila Muni.",
        "explanation": "Krishna lists the peepal tree, Narada, Chitraratha, and Kapila as his manifestations, representing sacred, divine, and enlightened entities. This sloka continues his vibhuti list. For Arjuna, it encourages seeing Krishna in nature and wisdom, inspiring him to approach the war with reverence, as if every element reflects Krishna’s divine glory."
      },
      "slok27": {
        "sanskrit": "उच्चैःश्रवसमश्वानां विद्धि माममृतोद्भवम्। ऐरावतं गजेन्द्राणां नराणां च नराधिपम्।।10.27।।",
        "transliteration": "uccaiḥśravasam aśvānāṁ viddhi mām amṛtodbhavam, airāvataṁ gajendrāṇāṁ narāṇāṁ ca narādhipam",
        "meaning": "Among horses, know Me as Ucchaishravas, born of nectar; among elephants, Airavata; among men, the king.",
        "explanation": "Krishna identifies with Ucchaishravas (divine horse), Airavata (Indra’s elephant), and the king among men, symbolizing nobility and leadership. This sloka highlights his regal manifestations. For Arjuna, it connects to his kshatriya role, suggesting that Krishna’s leadership guides the war, inspiring him to act as a noble warrior under divine authority."
      },
      "slok28": {
        "sanskrit": "आयुधानामहं वज्रं धेनूनामस्मि कामधुक्। प्रजनश्चास्मि कन्दर्पः सर्पाणामस्मि वासुकिः।।10.28।।",
        "transliteration": "āyudhānām ahaṁ vajraṁ dhenūnām asmi kāmadhuk, prajanaś cāsmi kandarpaḥ sarpāṇām asmi vāsukiḥ",
        "meaning": "Among weapons, I am the thunderbolt; among cows, I am Kamadhuk; I am Kandarpa, the progenitor; among serpents, I am Vasuki.",
        "explanation": "Krishna identifies with the thunderbolt, Kamadhuk (wish-fulfilling cow), Kandarpa (Cupid), and Vasuki (king of serpents), representing power, abundance, and mysticism. This sloka showcases his diverse glories. For Arjuna, the thunderbolt symbolizes the war’s destructive power, urging him to wield his weapons as Krishna’s instruments, with devotion and purpose."
      },
      "slok29": {
        "sanskrit": "अनन्तश्चास्मि नागानां वरुणो यादसामहम्। पितॄणामर्यमा चास्मि यमः संयमतामहम्।।10.29।।",
        "transliteration": "anantaś cāsmi nāgānāṁ varuṇo yādasām aham, pitṝṇām aryamā cāsmi yamaḥ saṁyamatām aham",
        "meaning": "Among Nagas, I am Ananta; among aquatic beings, I am Varuna; among ancestors, I am Aryama; among controllers, I am Yama.",
        "explanation": "Krishna identifies with Ananta, Varuna, Aryama, and Yama, representing eternal, aquatic, ancestral, and disciplinary powers. This sloka continues his divine manifestations. For Arjuna, Yama’s presence as death reminds him of the war’s inevitability, urging him to act righteously under Krishna’s guidance, ensuring spiritual alignment amidst mortality."
      },
      "slok30": {
        "sanskrit": "प्रह्लादश्चास्मि दैत्यानां कालः कलयतामहम्। मृगाणां च मृगेन्द्रोऽहं वैनतेयश्च पक्षिणाम्।।10.30।।",
        "transliteration": "prahlādaś cāsmi daityānāṁ kālaḥ kalayatām aham, mṛgāṇāṁ ca mṛgendro ’haṁ vainateyaś ca pakṣiṇām",
        "meaning": "Among Daityas, I am Prahlada; among subduers, I am time; among animals, I am the lion; among birds, I am Garuda.",
        "explanation": "Krishna identifies with Prahlada, time, the lion, and Garuda, symbolizing devotion, inevitability, strength, and divine service. This sloka highlights his multifaceted glories. For Arjuna, time’s mention underscores the war’s transient nature, while the lion and Garuda inspire courage and devotion, urging him to fight with Krishna’s strength and support."
      },
      "slok31": {
        "sanskrit": "पवनः पवतामस्मि रामः शस्त्रभृतामहम्। झषाणां मकरश्चास्मि स्रोतसामस्मि जाह्नवी।।10.31।।",
        "transliteration": "pavanaḥ pavatām asmi rāmaḥ śastra-bhṛtām aham, jhaṣāṇāṁ makaraś cāsmi srotasām asmi jāhnavī",
        "meaning": "Among purifiers, I am the wind; among warriors, I am Rama; among fish, I am the crocodile; among rivers, I am the Ganga.",
        "explanation": "Krishna identifies with the wind, Rama, the crocodile, and the Ganga, representing purity, heroism, aquatic power, and sanctity. This sloka continues his vibhuti list. For Arjuna, Rama’s mention as a warrior inspires him to emulate Krishna’s heroic qualities, while the Ganga’s purity encourages sanctifying his actions through devotion."
      },
      "slok32": {
        "sanskrit": "सर्गाणामादिरन्तश्च मध्यं चैवाहमर्जुन। अध्यात्मविद्या विद्यानां वादः प्रवदतामहम्।।10.32।।",
        "transliteration": "sargāṇām ādir antaś ca madhyaṁ caivāham arjuna, adhyātma-vidyā vidyānāṁ vādaḥ pravadatām aham",
        "meaning": "Among creations, I am the beginning, end, and middle, O Arjuna; among sciences, I am the science of the self; among debaters, I am logic.",
        "explanation": "Krishna identifies with the entirety of creation, the science of the self (spirituality), and logical discourse, representing temporal, intellectual, and philosophical supremacy. For Arjuna, this suggests that Krishna governs the war’s duration and his own spiritual quest, urging him to rely on Krishna’s wisdom for strategic and spiritual success."
      },
      "slok33": {
        "sanskrit": "अक्षराणामकारोऽस्मि द्वन्द्वः सामासिकस्य च। अहमेवाक्षयः कालो धाताहं विश्वतोमुखः।।10.33।।",
        "transliteration": "akṣarāṇām akāro ’smi dvandvaḥ sāmāsikasya ca, aham evākṣayaḥ kālo dhātāhaṁ viśvato-mukhaḥ",
        "meaning": "Among letters, I am the letter A; among compound words, I am the dual compound; I am imperishable time; I am the creator facing all directions.",
        "explanation": "Krishna identifies with the letter A, the dual compound, eternal time, and the all-facing creator, symbolizing linguistic, grammatical, and cosmic supremacy. This sloka highlights his foundational role. For Arjuna, time’s eternity reminds him of the war’s impermanence, urging him to act with Krishna’s eternal perspective, ensuring spiritual alignment."
      },
      "slok34": {
        "sanskrit": "मृत्युः सर्वहरश्चाहमुद्भवश्च भविष्यताम्। कीर्तिः श्रीर्वाक्च नारीणां स्मृतिर्मेधा धृतिः क्षमा।।10.34।।",
        "transliteration": "mṛtyuḥ sarva-haraś cāham udbhavaś ca bhaviṣyatām, kīrtiḥ śrīr vāk ca nārīṇāṁ smṛtir medhā dhṛtiḥ kṣamā",
        "meaning": "I am all-devouring death and the origin of all to come; among feminine qualities, I am fame, prosperity, speech, memory, intelligence, steadfastness, and forgiveness.",
        "explanation": "Krishna identifies with death, the source of future beings, and feminine qualities like fame and intelligence. This sloka encompasses life, death, and virtues. For Arjuna, death’s mention highlights the war’s stakes, while virtues like steadfastness inspire him to embody Krishna’s qualities, dedicating his actions to the divine for spiritual success."
      },
      "slok35": {
        "sanskrit": "बृहत्साम तथा साम्नां गायत्री छन्दसामहम्। मासानां मार्गशीर्षोऽहमृतूनां कुसुमाकरः।।10.35।।",
        "transliteration": "bṛhat-sāma tathā sāmnāṁ gāyatrī chandasām aham, māsānāṁ mārgaśīrṣo ’ham ṛtūnāṁ kusumākaraḥ",
        "meaning": "Among Sama hymns, I am Brihat-sama; among meters, I am Gayatri; among months, I am Margashirsha; among seasons, I am the flower-bearing spring.",
        "explanation": "Krishna identifies with the Brihat-sama, Gayatri meter, Margashirsha month, and spring, representing sacred and vibrant manifestations. This sloka highlights his cultural and natural glories. For Arjuna, spring’s vitality inspires renewed vigor in battle, while Gayatri’s sanctity encourages sanctifying his actions through devotion to Krishna."
      },
      "slok36": {
        "sanskrit": "द्यूतं छलयतामस्मि तेजस्तेजस्विनामहम्। जयोऽस्मि व्यवसायोऽस्मि सत्त्वं सत्त्ववतामहम्।।10.36।।",
        "transliteration": "dyūtaṁ chalayatām asmi tejas tejasvinām aham, jayo ’smi vyavasāyo ’smi sattvaṁ sattvavatām aham",
        "meaning": "Among deceitful acts, I am gambling; I am the splendor of the splendid; I am victory, determination, and the goodness of the virtuous.",
        "explanation": "Krishna identifies with gambling (as a strategic act), splendor, victory, determination, and goodness, representing dynamic and virtuous qualities. This sloka includes complex manifestations. For Arjuna, victory and determination are directly relevant, inspiring him to fight with Krishna’s strength and resolve, ensuring his warrior efforts lead to divine success."
      },
      "slok37": {
        "sanskrit": "वृष्णीनां वासुदेवोऽस्मि पाण्डवानां धनञ्जयः। मुनीनामप्यहं व्यासः कवीनामुशना कविः।।10.37।।",
        "transliteration": "vṛṣṇīnāṁ vāsudevo ’smi pāṇḍavānāṁ dhanañjayaḥ, munīnām apy ahaṁ vyāsaḥ kavīnām uśanā kaviḥ",
        "meaning": "Among the Vrishnis, I am Vasudeva; among the Pandavas, I am Dhananjaya; among sages, I am Vyasa; among poets, I am Ushana.",
        "explanation": "Krishna identifies with himself as Vasudeva, Arjuna (Dhananjaya), Vyasa, and Ushana, personalizing his glories. This sloka directly connects to Arjuna, affirming his divine association. For Arjuna, being Krishna’s manifestation boosts his confidence, urging him to fight as Krishna’s instrument, with the wisdom of Vyasa guiding his spiritual path."
      },
      "slok38": {
        "sanskrit": "दण्डो दमयतामस्मि नीतिरस्मि जिगीषताम्। मौनं चैवास्मि गुह्यानां ज्ञानं ज्ञानवतामहम्।।10.38।।",
        "transliteration": "daṇḍo damayatām asmi nītir asmi jigīṣatām, maunaṁ caivāsmi guhyānāṁ jñānaṁ jñānavatām aham",
        "meaning": "Among means of discipline, I am punishment; among those desiring victory, I am strategy; among secrets, I am silence; among the wise, I am knowledge.",
        "explanation": "Krishna identifies with punishment, strategy, silence, and knowledge, representing authority, tactics, and wisdom. This sloka highlights practical and subtle glories. For Arjuna, strategy and knowledge are key in war, inspiring him to rely on Krishna’s guidance for tactical success and spiritual insight, ensuring his actions are disciplined and wise."
      },
      "slok39": {
        "sanskrit": "यच्चापि सर्वभूतानां बीजं तदहमर्जुन। न तदस्ति विना यत्स्यान्मया भूतं चराचरम्।।10.39।।",
        "transliteration": "yac cāpi sarva-bhūtānāṁ bījaṁ tad aham arjuna, na tad asti vinā yat syān mayā bhūtaṁ carācaram",
        "meaning": "I am the seed of all beings, O Arjuna. There is no being, moving or non-moving, that exists without Me.",
        "explanation": "Krishna declares himself the universal seed, the source of all existence, asserting that nothing exists without him. This sloka emphasizes his all-pervading essence. For Arjuna, it means the war, its warriors, and outcomes are rooted in Krishna, urging him to act with the awareness of Krishna’s universal presence, aligning with divine purpose."
      },
      "slok40": {
        "sanskrit": "नान्तोऽस्ति मम दिव्यानां विभूतीनां परन्तप। एष तूद्देशतः प्रोक्तो विभूतेर्विस्तरो मया।।10.40।।",
        "transliteration": "nānto ’sti mama divyānāṁ vibhūtīnāṁ parantapa, eṣa tūddeśataḥ prokto vibhūter vistaro mayā",
        "meaning": "There is no end to My divine glories, O scorcher of foes. This description of My glories is but a brief indication.",
        "explanation": "Krishna concludes his enumeration, stating that his glories are infinite, and he has only provided a sample. This sloka underscores the limitless nature of his divinity. For Arjuna, it inspires awe, encouraging him to see Krishna’s presence in every aspect of the war, transforming his warrior duties into a continuous recognition of the divine."
      },
      "slok41": {
        "sanskrit": "यद्यद्विभूतिमत्सत्त्वं श्रीमदूर्जितमेव वा। तत्तदेवावगच्छ त्वं मम तेजोऽंशसंभवम्।।10.41।।",
        "transliteration": "yad yad vibhūtimat sattvaṁ śrīmad ūrjitam eva vā, tat tad evāvagaccha tvaṁ mama tejo-’ṁśa-sambhavam",
        "meaning": "Whatever being is glorious, prosperous, or powerful, know that to be a manifestation of a fragment of My splendor.",
        "explanation": "Krishna instructs Arjuna to recognize anything glorious or powerful as a spark of his divine splendor. This sloka generalizes his vibhutis to all excellence. For Arjuna, it means seeing Krishna in the war’s heroes, strategies, and victories, inspiring him to dedicate his actions to Krishna, perceiving divine splendor in every moment."
      },
      "slok42": {
        "sanskrit": "अथवा बहुनैतेन किं ज्ञानेन तवार्जुन। विष्टभ्याहमिदं कृत्स्नमेकांशेन स्थितो जगत्।।10.42।।",
        "transliteration": "atha vā bahunaitena kiṁ jñānena tavārjuna, viṣṭabhyāham idaṁ kṛtsnam ekāṁśena sthito jagat",
        "meaning": "But what need is there for all this knowledge, O Arjuna? With a single fragment of Myself, I pervade and support the entire universe.",
        "explanation": "Krishna concludes Chapter 10, stating that a single fragment of his being sustains the universe, rendering detailed knowledge secondary to his all-encompassing nature. This sloka emphasizes his supreme power. For Arjuna, it assures that Krishna’s mere presence governs the war, inspiring him to surrender his warrior duties to Krishna, acting with devotion for liberation."
      }
    }
  }
]
