[
  {
    "chapter17": {
      "title": "Shraddha Traya Vibhaga Yoga (The Yoga of the Threefold Faith)",
      "description": "In Chapter 17, Krishna explains how faith (shraddha) shaped by the three gunas—sattva (goodness), rajas (passion), and tamas (ignorance)—influences worship, austerity, charity, and food. He emphasizes sattvic practices as the path to spiritual growth and liberation. For Arjuna, this knowledge helps him align his warrior duties with sattvic faith, ensuring actions are righteous and devoted to Krishna, free from rajasic or tamasic influences.",
      "total_verses": 28,
      "slok1": {
        "sanskrit": "अर्जुन उवाच। ये शास्त्रविधिमुत्सृज्य यजन्ते श्रद्धयान्विताः। तेषां निष्ठा तु का कृष्ण सत्त्वमाहो रजस्तमः।।17.1।।",
        "transliteration": "arjuna uvāca ye śāstra-vidhim utsṛjya yajante śraddhayānvitāḥ, teṣāṁ niṣṭhā tu kā kṛṣṇa sattvam āho rajas tamaḥ",
        "meaning": "Arjuna said: Those who, setting aside scriptural injunctions, perform worship with faith—what is their condition, O Krishna? Is it sattva, rajas, or tamas?",
        "explanation": "Arjuna asks about the nature of faith in those who worship without following scriptures, questioning which guna dominates. This sloka initiates the chapter’s focus on faith. For Arjuna, this question is relevant to ensure his war efforts, driven by faith in Krishna, align with sattvic principles, avoiding unscriptural or misguided actions."
      },
      "slok2": {
        "sanskrit": "श्रीभगवानुवाच। त्रिविधा भवति श्रद्धा देहिनां सा स्वभावजा। सात्त्विकी राजसी चैव तामसी चेति तां शृणु।।17.2।।",
        "transliteration": "śrī bhagavān uvāca trividhā bhavati śraddhā dehināṁ sā svabhāvajā, sāttvikī rājasī caiva tāmasī ceti tāṁ śṛṇu",
        "meaning": "The Supreme Lord said: The faith of embodied beings is of three kinds, born of their nature—sattvic, rajasic, and tamasic. Hear about it now.",
        "explanation": "Krishna introduces the threefold nature of faith, shaped by the gunas, setting the stage for their detailed description. This sloka establishes the chapter’s framework. For Arjuna, understanding these distinctions helps him cultivate sattvic faith in battle, ensuring his warrior duties are guided by goodness, not passion or ignorance."
      },
      "slok3": {
        "sanskrit": "सत्त्वानुरूपा सर्वस्य श्रद्धा भवति भारत। श्रद्धामयोऽयं पुरुषो यो यच्छ्रद्धः स एव सः।।17.3।।",
        "transliteration": "sattvānurūpā sarvasya śraddhā bhavati bhārata, śraddhāmayo ’yaṁ puruṣo yo yacchraddhaḥ sa eva saḥ",
        "meaning": "The faith of each is according to their nature, O Bharata. A person is made of faith; as is their faith, so are they.",
        "explanation": "Krishna explains that faith reflects one’s inherent nature, defining their character. This sloka underscores faith’s role in shaping identity. For Arjuna, this means his faith in Krishna shapes his warrior identity, urging him to foster sattvic faith to ensure his actions in war reflect divine goodness and purpose."
      },
      "slok4": {
        "sanskrit": "यजन्ते सात्त्विका देवान्यक्षरक्षांसि राजसाः। प्रेतान्भूतगणांश्चान्ये यजन्ते तामसा जनाः।।17.4।।",
        "transliteration": "yajante sāttvikā devān yakṣa-rakṣāṁsi rājasāḥ, pretān bhūta-gaṇāṁś cānye yajante tāmasā janāḥ",
        "meaning": "Sattvic people worship gods, rajasic worship yakshas and rakshasas, and tamasic worship ghosts and spirits.",
        "explanation": "Krishna describes how faith influences worship: sattvic worship divine beings, rajasic worship demi-gods, and tamasic worship lower entities. This sloka connects faith to worship. For Arjuna, this urges directing his faith toward Krishna in battle, ensuring his warrior actions are sattvic offerings, not driven by rajasic ambition or tamasic delusion."
      },
      "slok5": {
        "sanskrit": "अशास्त्रविहितं घोरं तप्यन्ते ये तपो जनाः। दम्भाहङ्कारसंयुक्ताः कामरागबलान्विताः।।17.5।।",
        "transliteration": "aśāstra-vihitaṁ ghoraṁ tapyante ye tapo janāḥ, dambhāhaṅkāra-saṁyuktāḥ kāma-rāga-balānvitāḥ",
        "meaning": "Those who perform severe austerities not enjoined by scriptures, driven by hypocrisy, ego, desire, and passion,",
        "explanation": "Krishna criticizes unscriptural, ego-driven austerities motivated by desire and pride. This sloka warns against misguided spiritual practices. For Arjuna, this cautions against war efforts driven by ego or passion, urging him to act with scriptural guidance and sattvic discipline, ensuring his duties align with Krishna’s teachings."
      },
      "slok6": {
        "sanskrit": "कर्षयन्तः शरीरस्थं भूतग्राममचेतसः। मां चैवन्तःशरीरस्थं तान्विद्ध्यासुरनिश्चयान्।।17.6।।",
        "transliteration": "karṣayantaḥ śarīra-sthaṁ bhūta-grāmam acetasaḥ, māṁ caivāntaḥ-śarīra-sthaṁ tān viddhy āsura-niścayān",
        "meaning": "Mindlessly torturing the elements in their body and Me, who dwell within, know them to be of demonic resolve.",
        "explanation": "Krishna condemns those who harm their body and the divine within through reckless austerities, labeling them demonic. This sloka emphasizes respect for the divine presence. For Arjuna, this warns against self-destructive war tactics, urging him to honor Krishna within, ensuring his warrior actions are sattvic and respectful of divine guidance."
      },
      "slok7": {
        "sanskrit": "आहारस्त्वपि सर्वस्य त्रिविधो भवति प्रियः। यज्ञस्तपस्तथा दानं तेषां भेदमिमं शृणु।।17.7।।",
        "transliteration": "āhāras tv api sarvasya trividho bhavati priyaḥ, yajñas tapas tathā dānaṁ teṣāṁ bhedam imaṁ śṛṇu",
        "meaning": "Even the food preferred by all is of three kinds; so are sacrifice, austerity, and charity. Hear now their distinctions.",
        "explanation": "Krishna introduces the threefold nature of food, sacrifice, austerity, and charity, influenced by gunas. This sloka sets the stage for their analysis. For Arjuna, this helps him choose sattvic practices in war, ensuring his sustenance and actions reflect goodness, aligning his warrior duties with spiritual purity."
      },
      "slok8": {
        "sanskrit": "आयुःसत्त्वबलारोग्यसुखप्रीतिविवर्धनाः। रस्याः स्निग्धाः स्थिरा हृद्या आहाराः सात्त्विकप्रियाः।।17.8।।",
        "transliteration": "āyuḥ-sattva-balārogya-sukha-prīti-vivardhanāḥ, rasyāḥ snigdhāḥ sthirā hṛdyā āhārāḥ sāttvika-priyāḥ",
        "meaning": "Foods that promote longevity, strength, health, happiness, and satisfaction, which are juicy, smooth, substantial, and agreeable, are dear to the sattvic.",
        "explanation": "Krishna describes sattvic food as nourishing and pleasing, promoting health and happiness. This sloka outlines sattvic dietary preferences. For Arjuna, choosing sattvic food sustains his strength for battle, ensuring his physical and mental clarity align with divine goodness, supporting righteous warrior duties."
      },
      "slok9": {
        "sanskrit": "कट्वम्ललवणात्युष्णतीक्ष्णरूक्षविदाहिनः। आहारा राजसस्येष्टा दुःखशोकामयप्रदाः।।17.9।।",
        "transliteration": "kaṭv-amla-lavaṇāty-uṣṇa-tīkṣṇa-rūkṣa-vidāhinaḥ, āhārā rājasasyeṣṭā duḥkha-śokāmaya-pradāḥ",
        "meaning": "Foods that are bitter, sour, salty, excessively hot, pungent, dry, and burning, causing pain, grief, and disease, are dear to the rajasic.",
        "explanation": "Krishna describes rajasic food as intense and harmful, leading to suffering. This sloka highlights rajasic dietary flaws. For Arjuna, avoiding such food prevents agitation in battle, ensuring his warrior actions remain calm and sattvic, free from the distress caused by rajasic indulgence."
      },
      "slok10": {
        "sanskrit": "यातयामं गतरसं पूति पर्युषितं च यत्। उच्छिष्टमपि चामेध्यं भोजनं तामसप्रियम्।।17.10।।",
        "transliteration": "yāta-yāmaṁ gata-rasaṁ pūti paryuṣitaṁ ca yat, ucchiṣṭam api cāmedhyaṁ bhojanaṁ tāmasa-priyam",
        "meaning": "Food that is stale, tasteless, putrid, leftover, and impure is dear to the tamasic.",
        "explanation": "Krishna describes tamasic food as stale, tasteless, putrid, leftover, and impure, unfit for consumption due to its degrading qualities. This sloka highlights dietary preferences influenced by tamas, which cloud mental and physical clarity. For Arjuna, avoiding tamasic food is crucial in the context of war, as it ensures physical vitality and mental purity, enabling him to maintain sattvic clarity and strength. By choosing sattvic nourishment, he aligns his warrior duties with divine standards, fostering focus and righteousness in battle, free from the lethargy and confusion induced by tamasic consumption."
      },
      "slok11": {
        "sanskrit": "अफलाकाङ्क्षिभिर्यज्ञो विधिदृष्टो य इज्यते। यष्टव्यमेवेति मनः समाधाय स सात्त्विकः।।17.11।।",
        "transliteration": "aphalākāṅkṣibhir yajño vidhi-dṛṣṭo ya ijyate, yaṣṭavyam eveti manaḥ samādhāya sa sāttvikaḥ",
        "meaning": "The sacrifice offered by those desiring no fruit, as prescribed by scriptures, with the mind focused on the act as a duty, is sattvic.",
        "explanation": "Krishna describes sattvic sacrifice as selfless and scripturally guided, performed as duty. This sloka defines sattvic worship. For Arjuna, this means fighting as a selfless act of duty to Krishna, ensuring his warrior actions are sattvic sacrifices, free from desire for personal gain."
      },
      "slok12": {
        "sanskrit": "अभिसन्धाय तु फलं दम्भार्थमपि चैव यत्। इज्यते भरतश्रेष्ठ तं यज्ञं राजसं विदुः।।17.12।।",
        "transliteration": "abhisandhāya tu phalaṁ dambhārtham api caiva yat, ijyate bharata-śreṣṭha taṁ yajñaṁ rājasaṁ viduḥ",
        "meaning": "The sacrifice performed for show or with expectation of reward, O best of the Bharatas, know that to be rajasic.",
        "explanation": "Krishna describes rajasic sacrifice as motivated by rewards or ostentation. This sloka highlights its flaws. For Arjuna, this warns against fighting for fame or rewards, urging him to act with sattvic purity, ensuring his warrior duties are true offerings to Krishna, not ego-driven displays."
      },
      "slok13": {
        "sanskrit": "विधिहीनमसृष्टान्नं मन्त्रहीनमदक्षिणम्। श्रद्धाविरहितं यज्ञं तामसं परिचक्षते।।17.13।।",
        "transliteration": "vidhi-hīnam asṛṣṭānnaṁ mantra-hīnam adakṣiṇam, śraddhā-virahitaṁ yajñaṁ tāmasaṁ paricakṣate",
        "meaning": "The sacrifice performed without following scriptures, without food distribution, mantras, or fees, and devoid of faith, is said to be tamasic.",
        "explanation": "Krishna describes tamasic sacrifice as unscriptural and faithless. This sloka critiques its deficiencies. For Arjuna, this cautions against careless or faithless war efforts, urging him to fight with scriptural guidance and faith in Krishna, ensuring his actions are sattvic and meaningful."
      },
      "slok14": {
        "sanskrit": "देवद्विजगुरुप्राज्ञपूजनं शौचमार्जवम्। ब्रह्मचर्यमहिंसा च शारीरं तप उच्यते।।17.14।।",
        "transliteration": "deva-dvija-guru-prājña-pūjanaṁ śaucam ārjavam, brahmacaryam ahiṁsā ca śārīraṁ tapa ucyate",
        "meaning": "Worship of gods, brahmins, gurus, and the wise, purity, straightforwardness, celibacy, and non-violence—these are called physical austerity.",
        "explanation": "Krishna defines sattvic physical austerity, involving worship, purity, and non-violence. This sloka outlines disciplined living. For Arjuna, these practices ensure physical discipline in war, maintaining purity and non-violent intent, aligning his warrior duties with sattvic austerity for spiritual growth."
      },
      "slok15": {
        "sanskrit": "अनुद्वेगकरं वाक्यं सत्यं प्रियहितं च यत्। स्वाध्यायाभ्यसनं चैव वाङ्मयं तप उच्यते।।17.15।।",
        "transliteration": "anudvega-karaṁ vākyaṁ satyaṁ priya-hitaṁ ca yat, svādhyāyābhyasanaṁ caiva vāṅmayaṁ tapa ucyate",
        "meaning": "Speech that causes no distress, is truthful, pleasant, and beneficial, and the practice of scriptural study is called verbal austerity.",
        "explanation": "Krishna describes sattvic verbal austerity as truthful, kind speech and scriptural study. This sloka emphasizes disciplined speech. For Arjuna, this means speaking truthfully and kindly in war councils, studying Krishna’s teachings, ensuring his words support sattvic warrior duties, fostering harmony and wisdom."
      },
      "slok16": {
        "sanskrit": "मनःप्रसादः सौम्यत्वं मौनमात्मविनिग्रहः। भावसंशुद्धिरित्येतत्तपो मानसमुच्यते।।17.16।।",
        "transliteration": "manaḥ-prasādaḥ saumyatvaṁ maunam ātma-vinigrahaḥ, bhāva-saṁśuddhir ity etat tapo mānasam ucyate",
        "meaning": "Mental serenity, gentleness, silence, self-control, and purity of intention—these are called mental austerity.",
        "explanation": "Krishna defines sattvic mental austerity, including serenity and self-control. This sloka focuses on mental discipline. For Arjuna, maintaining mental calm and purity in war ensures sattvic decision-making, aligning his warrior actions with Krishna’s guidance, free from agitation or impure motives."
      },
      "slok17": {
        "sanskrit": "श्रद्धया परया तप्तं तपस्तत्त्रिविधं नरैः। अफलाकाङ्क्षिभिः युक्तैः सात्त्विकं परिचक्षते।।17.17।।",
        "transliteration": "śraddhayā parayā taptaṁ tapas tat trividhaṁ naraiḥ, aphalākāṅkṣibhiḥ yuktaiḥ sāttvikaṁ paricakṣate",
        "meaning": "The threefold austerity performed with supreme faith by those without desire for reward, steadfast, is said to be sattvic.",
        "explanation": "Krishna describes sattvic austerity as selfless, faith-driven, and disciplined. This sloka summarizes sattvic austerity. For Arjuna, this means performing war duties with faith and without reward-seeking, ensuring his actions are sattvic austerities, dedicated to Krishna for spiritual liberation."
      },
      "slok18": {
        "sanskrit": "सत्कारमानपूजार्थं तपो दम्भेन चैव यत्। क्रियते तदिह प्रोक्तं राजसं चपलं ध्रुवम्।।17.18।।",
        "transliteration": "satkāra-māna-pūjārthaṁ tapo dambhena caiva yat, kriyate tad iha proktaṁ rājasaṁ capalaṁ dhruvam",
        "meaning": "Austerity performed for recognition, honor, or worship, with hypocrisy, is said to be rajasic, unstable, and temporary.",
        "explanation": "Krishna describes rajasic austerity as hypocritical and fame-seeking, lacking permanence. This sloka critiques its motives. For Arjuna, this warns against fighting for glory, urging sattvic austerity in war, ensuring his actions are stable and sincere offerings to Krishna, not transient displays."
      },
      "slok19": {
        "sanskrit": "मूढग्राहेणात्मनो यत्पीडया क्रियते तपः। परस्योत्सादनार्थं वा तत्तामसमुदाहृतम्।।17.19।।",
        "transliteration": "mūḍha-grāheṇa ātmano yat pīḍayā kriyate tapaḥ, parasya utsādanārthaṁ vā tat tāmasam udāhṛtam",
        "meaning": "Austerity performed with foolish stubbornness, causing self-torture or harm to others, is said to be tamasic.",
        "explanation": "Krishna describes tamasic austerity as self-destructive or harmful, driven by delusion. This sloka condemns its folly. For Arjuna, this cautions against reckless or harmful war tactics, urging sattvic austerity, ensuring his actions avoid self-harm or cruelty, aligning with Krishna’s divine principles."
      },
      "slok20": {
        "sanskrit": "दातव्यमिति यद्दानं दीयतेऽनुपकारिणे। देशे काले च पात्रे च तद्दानं सात्त्विकं स्मृतम्।।17.20।।",
        "transliteration": "dātavyam iti yad dānaṁ dīyate ’nupakāriṇe, deśe kāle ca pātre ca tad dānaṁ sāttvikaṁ smṛtam",
        "meaning": "The charity given as a duty to one who does no favor in return, at the right place, time, and to a worthy recipient, is considered sattvic.",
        "explanation": "Krishna describes sattvic charity as selfless, timely, and given to worthy recipients. This sloka defines ideal giving. For Arjuna, this means supporting war efforts selflessly, aiding allies without expecting returns, ensuring his contributions are sattvic, enhancing dharma with pure intent."
      },
      "slok21": {
        "sanskrit": "यत्तु प्रत्युपकारार्थं फलमुद्दिश्य वा पुनः। दीयते च परिक्लिष्टं तद्दानं राजसं स्मृतम्।।17.21।।",
        "transliteration": "yat tu pratyupakārārthaṁ phalam uddiśya vā punaḥ, dīyate ca parikliṣṭaṁ tad dānaṁ rājasaṁ smṛtam",
        "meaning": "The charity given expecting something in return or for a reward, or given reluctantly, is considered rajasic.",
        "explanation": "Krishna describes rajasic charity as motivated by reciprocation or reward, given grudgingly. This sloka highlights its flaws. For Arjuna, this warns against aiding war efforts for personal gain, urging sattvic charity, ensuring his contributions are selfless, supporting dharma without ulterior motives."
      },
      "slok22": {
        "sanskrit": "अदेशकाले यद्दानमपात्रेभ्यश्च दीयते। असत्कृतमवज्ञातं तत्तामसमुदाहृतम्।।17.22।।",
        "transliteration": "adeśa-kāle yad dānam apātrebhyaś ca dīyate, asatkṛtam avajñātaṁ tat tāmasam udāhṛtam",
        "meaning": "The charity given at the wrong place and time, to unworthy recipients, without respect or with contempt, is said to be tamasic.",
        "explanation": "Krishna describes tamasic charity as ill-timed, disrespectful, and given to the unworthy. This sloka critiques its impropriety. For Arjuna, this cautions against misguided support in war, urging sattvic charity, ensuring his aid is respectful and timely, enhancing dharma with proper intent."
      },
      "slok23": {
        "sanskrit": "ॐ तत्सदिति निर्देशो ब्रह्मणस्त्रिविधः स्मृतः। ब्राह्मणास्तेन वेदाश्च यज्ञाश्च विहिताः पुरा।।17.23।।",
        "transliteration": "oṁ tat sad iti nirdeśo brahmaṇas trividhaḥ smṛtaḥ, brāhmaṇās tena vedāś ca yajñāś ca vihitāḥ purā",
        "meaning": "‘Om Tat Sat’ is the threefold designation of Brahman; by that were created the brahmins, Vedas, and sacrifices in the past.",
        "explanation": "Krishna introduces ‘Om Tat Sat’ as Brahman’s sacred syllables, associated with creation and rituals. This sloka establishes their spiritual significance. For Arjuna, invoking these in war aligns his actions with Brahman, ensuring his warrior duties are sacred offerings, rooted in divine truth and purpose."
      },
      "slok24": {
        "sanskrit": "तस्मादोमित्युदाहृत्य यज्ञदानतपःक्रियाः। प्रवर्तन्ते विधानोक्ताः सततं ब्रह्मवादिनाम्।।17.24।।",
        "transliteration": "tasmād oṁ ity udāhṛtya yajña-dāna-tapaḥ-kriyāḥ, pravartante vidhānoktāḥ satataṁ brahma-vādinām",
        "meaning": "Therefore, the acts of sacrifice, charity, and austerity, as prescribed by scriptures, are always begun with ‘Om’ by those who follow Brahman.",
        "explanation": "Krishna states that scriptural acts begin with ‘Om’ for spiritual alignment. This sloka emphasizes ritual purity. For Arjuna, starting war efforts with ‘Om’ sanctifies his actions, ensuring his warrior duties are Brahman-aligned, performed with divine focus and scriptural adherence."
      },
      "slok25": {
        "sanskrit": "तदित्यनभिसन्धाय फलं यज्ञतपःक्रियाः। दानक्रियाश्च विविधाः क्रियन्ते मोक्षकाङ्क्षिभिः।।17.25।।",
        "transliteration": "tad ity anabhisandhāya phalaṁ yajña-tapaḥ-kriyāḥ, dāna-kriyāś ca vividhāḥ kriyante mokṣa-kāṅkṣibhiḥ",
        "meaning": "With ‘Tat,’ without aiming for reward, the acts of sacrifice, austerity, and charity are performed by those seeking liberation.",
        "explanation": "Krishna explains that ‘Tat’ accompanies selfless acts for liberation. This sloka highlights selfless spirituality. For Arjuna, performing war duties with ‘Tat’ ensures they are liberation-focused, free from reward-seeking, aligning his actions with the eternal truth for spiritual freedom."
      },
      "slok26": {
        "sanskrit": "सद्भावे साधुभावे च सदित्येतत्प्रयुज्यते। प्रशस्ते कर्मणि तथा सच्छब्दः पार्थ युज्यते।।17.26।।",
        "transliteration": "sad-bhāve sādhu-bhāve ca sad ity etat prayujyate, praśaste karmaṇi tathā sac-chabdaḥ pārtha yujyate",
        "meaning": "The word ‘Sat’ is used in the sense of reality and goodness, and also in praiseworthy actions, O Partha.",
        "explanation": "Krishna defines ‘Sat’ as denoting truth, goodness, and commendable acts. This sloka clarifies its usage. For Arjuna, using ‘Sat’ in war affirms his actions’ truth and goodness, ensuring his warrior duties are praiseworthy, rooted in divine reality and righteousness."
      },
      "slok27": {
        "sanskrit": "यज्ञे तपसि दाने च स्थितिः सदिति चोच्यते। कर्म चैव तदर्थीयं सदित्येवाभिधीयते।।17.27।।",
        "transliteration": "yajñe tapasi dāne ca sthitiḥ sad iti cocyate, karma caiva tad-arthīyaṁ sad ity evābhidhīyate",
        "meaning": "Steadfastness in sacrifice, austerity, and charity is called ‘Sat,’ and actions for that purpose are also called ‘Sat.’",
        "explanation": "Krishna states that steadfastness and actions for sacrifice, austerity, and charity are termed ‘Sat.’ This sloka reinforces their divine association. For Arjuna, steadfast war efforts for dharma are ‘Sat,’ ensuring his actions are enduring and divine, dedicated to Krishna’s purpose."
      },
      "slok28": {
        "sanskrit": "अश्रद्धया हुतं दत्तं तपस्तप्तं कृतं च यत्। असदित्युच्यते पार्थ न च तत्प्रेत्य नो इह।।17.28।।",
        "transliteration": "aśraddhayā hutaṁ dattaṁ tapas taptaṁ kṛtaṁ ca yat, asad ity ucyate pārtha na ca tat pretya no iha",
        "meaning": "Whatever is sacrificed, given, or performed, and whatever austerity is practiced without faith, is called ‘Asat,’ O Partha; it is of no avail here or hereafter.",
        "explanation": "Krishna concludes that faithless acts are ‘Asat,’ lacking value in this life or beyond. This sloka underscores faith’s necessity. For Arjuna, this warns against faithless war efforts, urging him to fight with sattvic faith in Krishna, ensuring his actions are ‘Sat,’ bearing fruit for liberation."
      }
    }
  }
]
