[
  {
    "chapter13": {
      "title": "Kshetra Kshetrajna Vibhaga Yoga (The Yoga of the Field and the Knower of the Field)",
      "description": "In Chapter 13, Krishna explains the distinction between the field (Kshetra), which includes the material body and nature, and the knower of the field (Kshetrajna), the soul. He elaborates on true knowledge, the qualities that cultivate it, and the means to liberation through understanding the soul’s eternal nature. For Arjuna, this knowledge enables him to perform his warrior duties with detachment, recognizing his soul’s distinction from the transient body and battlefield events.",
      "total_verses": 34,
      "slok1": {
        "sanskrit": "अर्जुन उवाच। प्रकृतिं पुरुषं चैव क्षेत्रं क्षेत्रज्ञमेव च। एतद्वेदितुमिच्छामि ज्ञानं ज्ञेयं च केशव।।13.1।।",
        "transliteration": "arjuna uvāca prakṛtiṁ puruṣaṁ caiva kṣetraṁ kṣetrajñam eva ca, etad veditum icchāmi jñānaṁ jñeyaṁ ca keśava",
        "meaning": "Arjuna said: O Keshava, I wish to understand Prakriti (nature), Purusha (the soul), the field, the knower of the field, knowledge, and the object of knowledge.",
        "explanation": "Arjuna seeks clarification on key philosophical concepts: nature, soul, the field, its knower, knowledge, and what is to be known. This sloka initiates the discourse on metaphysical distinctions. For Arjuna, understanding these concepts is crucial to navigate his warrior duties, enabling him to act with wisdom, detached from the material outcomes of the war."
      },
      "slok2": {
        "sanskrit": "श्रीभगवानुवाच। इदं शरीरं कौन्तेय क्षेत्रमित्यभिधीयते। एतद्यो वेत्ति तं प्राहुः क्षेत्रज्ञ इति तद्विदः।।13.2।।",
        "transliteration": "śrī bhagavān uvāca idaṁ śarīraṁ kaunteya kṣetram ity abhidhīyate, etad yo vetti taṁ prāhuḥ kṣetrajña iti tad-vidaḥ",
        "meaning": "The Supreme Lord said: This body, O son of Kunti, is called the field; one who knows it is called the knower of the field by those who understand.",
        "explanation": "Krishna defines the body as the field (Kshetra) and the soul, which knows it, as the knower (Kshetrajna). This sloka establishes the chapter’s core distinction. For Arjuna, recognizing his body as a temporary field separate from his eternal soul helps him approach the war with detachment, focusing on his soul’s immortality rather than bodily harm."
      },
      "slok3": {
        "sanskrit": "क्षेत्रज्ञं चापि मां विद्धि सर्वक्षेत्रेषु भारत। क्षेत्रक्षेत्रज्ञयोर्ज्ञानं यत्तज्ज्ञानं मतं मम।।13.3।।",
        "transliteration": "kṣetrajñaṁ cāpi māṁ viddhi sarva-kṣetreṣu bhārata, kṣetra-kṣetrajñayor jñānaṁ yat taj jñānaṁ mataṁ mama",
        "meaning": "Know Me as the Knower of the Field in all fields, O Bharata. The knowledge of the field and its knower is true knowledge, in My opinion.",
        "explanation": "Krishna reveals himself as the supreme Knower in all fields, stating that understanding the field and knower constitutes true knowledge. This sloka elevates the discourse to the divine. For Arjuna, knowing Krishna as the universal soul encourages him to surrender his warrior actions to Krishna, acting with the wisdom that all fields are pervaded by the divine."
      },
      "slok4": {
        "sanskrit": "तत्क्षेत्रं यच्च यादृक् च यद्विकारि यतश्च यत्। स च यो यत्प्रभावश्च तत्समासेन मे शृणु।।13.4।।",
        "transliteration": "tat kṣetraṁ yac ca yādṛk ca yad-vikāri yataś ca yat, sa ca yo yat-prabhāvaś ca tat samāsena me śṛṇu",
        "meaning": "Listen briefly from Me about what the field is, its nature, modifications, source, and who the knower is, and its influence.",
        "explanation": "Krishna promises a concise explanation of the field’s nature, changes, origin, and the knower’s influence. This sloka sets the stage for detailed exposition. For Arjuna, this knowledge will clarify the transient nature of the battlefield (body and world), enabling him to fight without attachment, focused on the eternal knower within."
      },
      "slok5": {
        "sanskrit": "ऋषिभिर्बहुधा गीतं छन्दोभिर्विविधैः पृथक्। ब्रह्मसूत्रपदैश्चैव हेतुमद्भिर्विनिश्चितैः।।13.5।।",
        "transliteration": "ṛṣibhir bahudhā gītaṁ chandobhir vividhaiḥ pṛthak, brahma-sūtra-padaiś caiva hetumadbhir viniścitaiḥ",
        "meaning": "This has been sung by sages in various ways, in different Vedic hymns, and in the definitive, reasoned words of the Brahma Sutras.",
        "explanation": "Krishna notes that the knowledge of the field and knower has been expounded by sages, Vedas, and Brahma Sutras, affirming its scriptural authority. This sloka validates the teaching’s tradition. For Arjuna, this assurance roots his understanding in ancient wisdom, encouraging him to trust Krishna’s guidance to navigate his warrior duties with spiritual clarity."
      },
      "slok6": {
        "sanskrit": "महाभूतान्यहङ्कारो बुद्धिरव्यक्तमेव च। इन्द्रियाणि दशैकं च पञ्च चेन्द्रियगोचराः।।13.6।।",
        "transliteration": "mahā-bhūtāny ahaṅkāro buddhir avyaktam eva ca, indriyāṇi daśaikaṁ ca pañca cendriya-gocarāḥ",
        "meaning": "The great elements, ego, intellect, the unmanifested, the ten senses, the mind, and the five sense objects,",
        "explanation": "Krishna begins describing the field, listing the five elements, ego, intellect, unmanifested nature, ten senses, and five sense objects. This sloka outlines the field’s material components. For Arjuna, understanding the body and world as a composite field helps him see the war’s events as transient, urging him to act as a detached soul, not a material entity."
      },
      "slok7": {
        "sanskrit": "इच्छा द्वेषः सुखं दुःखं सङ्घातश्चेतना धृतिः। एतत्क्षेत्रं समासेन सविकारमुदाहृतम्।।13.7।।",
        "transliteration": "icchā dveṣaḥ sukhaṁ duḥkhaṁ saṅghātaś cetanā dhṛtiḥ, etat kṣetraṁ samāsena sa-vikāram udāhṛtam",
        "meaning": "Desire, hatred, pleasure, pain, the aggregate, consciousness, and fortitude—this field, with its modifications, is briefly described.",
        "explanation": "Krishna completes the field’s description, adding psychological aspects like desire, hatred, pleasure, pain, and physical aspects like the body’s aggregate. This sloka encompasses the field’s dynamic nature. For Arjuna, recognizing emotions like fear and desire as part of the field allows him to detach from them, performing warrior duties with steady, soul-centric resolve."
      },
      "slok8": {
        "sanskrit": "अमानित्वमदम्भित्वमहिंसा क्षान्तिरार्जवम्। आचार्योपासनं शौचं स्थैर्यमात्मविनिग्रहः।।13.8।।",
        "transliteration": "amānitvam adambhitvam ahiṁsā kṣāntir ārjavam, ācāryopāsanaṁ śaucaṁ sthairyam ātma-vinigrahaḥ",
        "meaning": "Humility, modesty, non-violence, forgiveness, simplicity, service to the teacher, purity, steadfastness, and self-control,",
        "explanation": "Krishna begins listing qualities of true knowledge, starting with humility, modesty, and other virtues. This sloka initiates the description of knowledge’s attributes. For Arjuna, cultivating these qualities ensures his warrior actions are guided by wisdom, not pride or violence, aligning his duties with the soul’s purity and divine purpose."
      },
      "slok9": {
        "sanskrit": "इन्द्रियार्थेषु वैराग्यमनहङ्कार एव च। जन्ममृत्युजराव्याधिदुःखदोषानुदर्शनम्।।13.9।।",
        "transliteration": "indriyārtheṣu vairāgyam anahaṅkāra eva ca, janma-mṛtyu-jarā-vyādhi-duḥkha-doṣānudarśanam",
        "meaning": "Detachment from sense objects, absence of ego, and perception of the evils of birth, death, old age, disease, and suffering,",
        "explanation": "Krishna continues describing knowledge, emphasizing detachment, egolessness, and awareness of life’s inherent miseries. This sloka highlights knowledge’s introspective nature. For Arjuna, these qualities help him view the war’s violence and losses as transient, enabling him to fight without attachment, focused on the soul’s liberation from material suffering."
      },
      "slok10": {
        "sanskrit": "असक्तिः अनभिष्वङ्गः पुत्रदारगृहादिषु। नित्यं च समचित्तत्वमिष्टानिष्टोपपत्तिषु।।13.10।।",
        "transliteration": "asaktiḥ anabhiṣvaṅgaḥ putra-dāra-gṛhādiṣu, nityaṁ ca sama-cittatvam iṣṭāniṣṭopapattiṣu",
        "meaning": "Non-attachment, non-identification with son, wife, home, and the like, and constant even-mindedness in desirable and undesirable events,",
        "explanation": "Krishna lists further qualities of knowledge: non-attachment to family and possessions, and equanimity in all circumstances. This sloka emphasizes emotional balance. For Arjuna, this equanimity allows him to face the war’s ups and downs without personal bias, performing his duties as a detached soul, aligned with Krishna’s wisdom."
      },
      "slok11": {
        "sanskrit": "मयि चानन्ययोगेन भक्तिरव्यभिचारिणी। विविक्तदेशसेवित्वमरतिर्जनसंसदि।।13.11।।",
        "transliteration": "mayi cānanya-yogena bhaktir avyabhicāriṇī, vivikta-deśa-sevitvam aratir jana-saṁsadi",
        "meaning": "Unswerving devotion to Me with single-minded Yoga, preference for solitude, and distaste for crowded society,",
        "explanation": "Krishna includes devotion to him, love for solitude, and aversion to worldly crowds as qualities of knowledge. This sloka integrates bhakti into knowledge. For Arjuna, single-minded devotion to Krishna during battle ensures his actions are spiritual, while solitude in thought helps him focus on the soul, not the war’s chaos."
      },
      "slok12": {
        "sanskrit": "अध्यात्मज्ञाननित्यत्वं तत्त्वज्ञानार्थदर्शनम्। एतज्ज्ञानमिति प्रोक्तमज्ञानं यदतोऽन्यथा।।13.12।।",
        "transliteration": "adhyātma-jñāna-nityatvaṁ tattva-jñānārtha-darśanam, etaj jñānam iti proktam ajñānaṁ yad ato ’nyathā",
        "meaning": "Constancy in spiritual knowledge, and insight into the goal of true knowledge—this is declared as knowledge; anything contrary is ignorance.",
        "explanation": "Krishna concludes the qualities of knowledge, emphasizing persistent spiritual understanding and its purpose. This sloka defines knowledge and ignorance. For Arjuna, this clarity guides him to act with spiritual wisdom, recognizing the war as part of the material field, while his soul remains focused on Krishna’s eternal truth."
      },
      "slok13": {
        "sanskrit": "ज्ञेयं यत्तत्प्रवक्ष्यामि यज्ज्ञात्वाऽमृतमश्नुति। अनादिमत्परं ब्रह्म न सत्तन्नासदुच्यते।।13.13।।",
        "transliteration": "jñeyaṁ yat tat pravakṣyāmi yaj jñātvā ’mṛtam aśnuti, anādimat paraṁ brahma na sat tan nāsad ucyate",
        "meaning": "I will declare that which is to be known, knowing which one attains immortality: the beginningless supreme Brahman, neither being nor non-being.",
        "explanation": "Krishna introduces the object of knowledge, the supreme Brahman, which is eternal and beyond existence or non-existence. This sloka begins describing the ultimate reality. For Arjuna, knowing Brahman as the war’s underlying truth helps him act without attachment, focusing on his soul’s immortality, ensuring his duties align with divine liberation."
      },
      "slok14": {
        "sanskrit": "सर्वतः पाणिपादं तत्सर्वतोऽक्षिशिरोमुखम्। सर्वतः श्रुतिमल्लोके सर्वमावृत्य तिष्ठति।।13.14।।",
        "transliteration": "sarvataḥ pāṇi-pādaṁ tat sarvato ’kṣi-śiro-mukham, sarvataḥ śrutimal loke sarvam āvṛtya tiṣṭhati",
        "meaning": "With hands and feet everywhere, eyes, heads, and mouths everywhere, with ears everywhere, it exists, pervading all in the world.",
        "explanation": "Krishna describes Brahman as all-pervading, with infinite limbs and senses, encompassing everything. This sloka emphasizes Brahman’s omnipresence. For Arjuna, this vision of Brahman pervading the battlefield helps him see all warriors and events as part of the divine, urging him to fight with universal awareness, detached from personal outcomes."
      },
      "slok15": {
        "sanskrit": "सर्वेन्द्रियगुणाभासं सर्वेन्द्रियविवर्जितम्। असक्तं सर्वभृच्चैव निर्गुणं गुणभोक्तृ च।।13.15।।",
        "transliteration": "sarvendriya-guṇābhāsaṁ sarvendriya-vivarjitam, asaktaṁ sarva-bhṛc caiva nirguṇaṁ guṇa-bhoktṛ ca",
        "meaning": "Shining with the functions of all senses yet devoid of senses, unattached yet supporting all, free from qualities yet experiencing qualities,",
        "explanation": "Krishna describes Brahman as transcending senses and qualities while appearing to engage with them, unattached yet sustaining all. This sloka highlights Brahman’s paradoxical nature. For Arjuna, this teaches that the soul, like Brahman, is unattached, enabling him to fight without clinging to the war’s sensory experiences, acting as a detached supporter of dharma."
      },
      "slok16": {
        "sanskrit": "बहिरन्तश्च भूतानामचरं चरमेव च। सूक्ष्मत्वात्तदविज्ञेयं दूरस्थं चान्तिके च तत्।।13.16।।",
        "transliteration": "bahir antaś ca bhūtānām acaraṁ caram eva ca, sūkṣmatvāt tad avijñeyaṁ dūra-sthaṁ cāntike ca tat",
        "meaning": "Outside and inside beings, unmoving and moving, imperceptible due to subtlety, far yet near,",
        "explanation": "Brahman is described as existing within and beyond beings, both static and dynamic, subtle, and simultaneously distant and near. This sloka emphasizes its all-pervasive subtlety. For Arjuna, this helps him see Krishna’s presence in the war’s chaos, encouraging him to act with the awareness that the subtle divine is near, guiding his soul through detached action."
      },
      "slok17": {
        "sanskrit": "अविभक्तं च भूतेषु विभक्तमिव च स्थितम्। भूतभर्तृ च तज्ज्ञेयं ग्रसिष्णु प्रभविष्णु च।।13.17।।",
        "transliteration": "avibhaktaṁ ca bhūteṣu vibhaktam iva ca sthitam, bhūta-bhartṛ ca taj jñeyaṁ grasiṣṇu prabhaviṣṇu ca",
        "meaning": "Undivided yet appearing divided in beings, the sustainer, destroyer, and creator of beings, that is to be known.",
        "explanation": "Brahman is undivided but appears divided, sustaining, destroying, and creating all. This sloka highlights its unified yet multifaceted role. For Arjuna, this reveals the war’s events as Brahman’s play—creation and destruction—urging him to fight as part of this divine cycle, detached from the apparent divisions of friend and foe."
      },
      "slok18": {
        "sanskrit": "ज्योतिषामपि तज्ज्योतिस्तमसः परमुच्यते। ज्ञानं ज्ञेयं ज्ञानगम्यं हृदि सर्वस्य विष्ठितम्।।13.18।।",
        "transliteration": "jyotiṣām api taj jyotis tamasaḥ param ucyate, jñānaṁ jñeyaṁ jñāna-gamyaṁ hṛdi sarvasya viṣṭhitam",
        "meaning": "The light of all lights, beyond darkness, it is knowledge, the object of knowledge, and attainable by knowledge, situated in the heart of all.",
        "explanation": "Brahman is the ultimate light, beyond ignorance, known through knowledge, and resides in all hearts. This sloka emphasizes its spiritual essence. For Arjuna, this light in his heart guides his warrior actions, enabling him to fight with knowledge of the soul’s divine presence, dispelling the darkness of attachment and fear."
      },
      "slok19": {
        "sanskrit": "इति क्षेत्रं तथा ज्ञानं ज्ञेयं चोक्तं समासतः। मद्भक्त एतद्विज्ञाय मद्भावायोपपद्यति।।13.19।।",
        "transliteration": "iti kṣetraṁ tathā jñānaṁ jñeyaṁ coktaṁ samāsataḥ, mad-bhakta etad vijñāya mad-bhāvāyopapadyati",
        "meaning": "Thus, the field, knowledge, and the object of knowledge have been briefly described. My devotee, understanding this, attains My nature.",
        "explanation": "Krishna summarizes the teachings on the field, knowledge, and Brahman, stating that devotees who understand this attain his divine nature. This sloka connects knowledge to devotion. For Arjuna, this knowledge ensures his warrior duties, performed with devotion, lead to union with Krishna, aligning his actions with the divine state of liberation."
      },
      "slok20": {
        "sanskrit": "प्रकृतिं पुरुषं चैव विद्ध्यनादी उभौ अपि। विकारांश्च गुणांश्चैव विद्धि प्रकृतिसम्भवान्।।13.20।।",
        "transliteration": "prakṛtiṁ puruṣaṁ caiva viddhy anādī ubhau api, vikārāṁś ca guṇāṁś caiva viddhi prakṛti-sambhavān",
        "meaning": "Know that both Prakriti (nature) and Purusha (soul) are beginningless; know that modifications and qualities arise from Prakriti.",
        "explanation": "Krishna explains that both nature and soul are eternal, but changes and qualities stem from nature. This sloka distinguishes the eternal soul from material changes. For Arjuna, this clarifies that the war’s events are nature’s modifications, not the soul’s, urging him to fight as an eternal soul, detached from transient material outcomes."
      },
      "slok21": {
        "sanskrit": "कार्यकारणकर्तृत्वे हेतुः प्रकृतिरुच्यते। पुरुषः सुखदुःखानां भोक्तृत्वे हेतुरुच्यते।।13.21।।",
        "transliteration": "kārya-kāraṇa-kartṛtve hetuḥ prakṛtir ucyate, puruṣaḥ sukha-duḥkhānāṁ bhoktṛtve hetur ucyate",
        "meaning": "Prakriti is said to be the cause of agency in actions and their causes, while Purusha is the cause of experiencing pleasure and pain.",
        "explanation": "Krishna attributes actions to Prakriti and experiences of pleasure and pain to Purusha. This sloka clarifies their roles in material existence. For Arjuna, this means his warrior actions arise from nature, but his soul experiences their effects, urging him to act without attachment, focusing on the soul’s transcendence over pain and pleasure."
      },
      "slok22": {
        "sanskrit": "पुरुषः प्रकृतिस्थो हि भुङ्क्ते प्रकृतिजान्गुणान्। कारणं गुणसङ्गोऽस्य सदसद्योनिजन्मसु।।13.22।।",
        "transliteration": "puruṣaḥ prakṛti-stho hi bhuṅkte prakṛti-jān guṇān, kāraṇaṁ guṇa-saṅgo ’sya sad-asad-yoni-janmasu",
        "meaning": "The Purusha, situated in Prakriti, experiences the qualities born of Prakriti; attachment to these qualities is the cause of birth in good and evil wombs.",
        "explanation": "Krishna explains that the soul, entangled in nature, experiences its qualities, and attachment to them causes rebirth. This sloka highlights the cycle of samsara. For Arjuna, this teaches that attachment to the war’s outcomes binds the soul, urging him to fight with detachment, ensuring his soul’s freedom from material entanglement."
      },
      "slok23": {
        "sanskrit": "उपद्रष्टानुमन्ता च भर्ता भोक्ता महेश्वरः। परमात्मेति चाप्युक्तो देहेऽस्मिन्पुरुषः परः।।13.23।।",
        "transliteration": "upadraṣṭānumantā ca bhartā bhoktā maheśvaraḥ, paramātmeti cāpy ukto dehe ’smin puruṣaḥ paraḥ",
        "meaning": "The supreme Purusha in this body is the witness, approver, supporter, enjoyer, great Lord, and also called the supreme Self.",
        "explanation": "Krishna describes the supreme soul in the body as the witness, approver, and supreme Lord. This sloka elevates the soul to its divine status. For Arjuna, recognizing Krishna as the supreme Self within guides his warrior actions, ensuring he fights as an instrument of the divine witness, detached from personal agency."
      },
      "slok24": {
        "sanskrit": "य एवं वेत्ति पुरुषं प्रकृतिं च गुणैः सह। सर्वथा वर्तमानोऽपि न स भूयोऽभिजायते।।13.24।।",
        "transliteration": "ya evaṁ vetti puruṣaṁ prakṛtiṁ ca guṇaiḥ saha, sarvathā vartamāno ’pi na sa bhūyo ’bhijāyate",
        "meaning": "One who understands Purusha, Prakriti, and the qualities, in whatever condition, is not born again.",
        "explanation": "Krishna states that understanding the soul, nature, and qualities liberates one from rebirth. This sloka emphasizes knowledge’s liberating power. For Arjuna, this knowledge ensures that fighting with awareness of his soul’s distinction from nature frees him from samsara, aligning his warrior duties with the path to liberation."
      },
      "slok25": {
        "sanskrit": "ध्यानेनात्मनि पश्यन्ति केचिदात्मानमात्मना। अन्ये साङ्ख्येन योगेन कर्मयोगेन चापरे।।13.25।।",
        "transliteration": "dhyānenātmani paśyanti kecid ātmānam ātmanā, anye sāṅkhyena yogena karma-yogena cāpare",
        "meaning": "Some behold the Self in the self by meditation, others by the Yoga of knowledge, and others by the Yoga of action.",
        "explanation": "Krishna outlines paths to realize the soul: meditation, knowledge (Sankhya), and action (Karma Yoga). This sloka presents diverse spiritual practices. For Arjuna, Karma Yoga suits his warrior role, allowing him to realize his soul through detached action in battle, aligning his duties with spiritual growth and self-realization."
      },
      "slok26": {
        "sanskrit": "अन्ये त्वेवमजानन्तः श्रुत्वान्येभ्य उपासते। तेऽपि चातितरन्त्येव मृत्युं श्रुतिपरायणाः।।13.26।।",
        "transliteration": "anye tv evam ajānantaḥ śrutvānyebhya upāsate, te ’pi cātitaranty eva mṛtyuṁ śruti-parāyaṇāḥ",
        "meaning": "Others, not knowing thus, worship as they have heard from others; they too cross beyond death, devoted to what they have heard.",
        "explanation": "Krishna acknowledges those who worship based on teachings they’ve heard, stating they also transcend death. This sloka highlights faith’s efficacy. For Arjuna, this assures that following Krishna’s teachings with faith, even without deep understanding, liberates him, Encouraging him to fight with trust in Krishna’s guidance."
      },
      "slok27": {
        "sanskrit": "यावत्सञ्जायते किञ्चित्सत्त्वं स्थावरजङ्गमम्। क्षेत्रक्षेत्रज्ञसंयोगात्तद्विद्धि भरतर्षभ।।13.27।।",
        "transliteration": "yāvat sañjāyate kiñcit sattvaṁ sthāvara-jaṅgamam, kṣetra-kṣetrajña-saṁyogāt tad viddhi bharatarṣabha",
        "meaning": "Whatever being is born, moving or unmoving, know it arises from the union of the field and the knower of the field, O best of the Bharatas.",
        "explanation": "Krishna explains that all existence results from the interaction of the field and its knower. This sloka clarifies the origin of creation. For Arjuna, this means the war’s events and warriors arise from this union, urging him to act with the awareness that all phenomena are transient, focusing on the eternal soul."
      },
      "slok28": {
        "sanskrit": "समं सर्वेषु भूतेषु तिष्ठन्तं परमेश्वरम्। विनश्यत्स्वविनश्यन्तं यः पश्यति स पश्यति।।13.28।।",
        "transliteration": "samaṁ sarveṣu bhūteṣu tiṣṭhantaṁ parameśvaram, vinaśyatsv avinaśyantaṁ yaḥ paśyati sa paśyati",
        "meaning": "One who sees the supreme Lord equally present in all beings, imperishable amidst the perishable, truly sees.",
        "explanation": "Krishna states that true vision recognizes the imperishable Lord in all beings, despite their perishable nature. This sloka emphasizes spiritual perception. For Arjuna, seeing Krishna in all warriors fosters equality, enabling him to fight without hatred, recognizing the imperishable soul in all, aligning with divine vision."
      },
      "slok29": {
        "sanskrit": "समं पश्यन्हि सर्वत्र समवस्थितमीश्वरम्। न हिनस्त्यात्मनात्मानं ततो याति परां गतिम्।।13.29।।",
        "transliteration": "samaṁ paśyan hi sarvatra samavasthitam īśvaram, na hinasty ātmanātmānaṁ tato yāti parāṁ gatim",
        "meaning": "Seeing the Lord equally everywhere, one does not harm oneself by oneself and thus attains the supreme destination.",
        "explanation": "Krishna explains that equal vision prevents self-harm through harmful actions, leading to liberation. This sloka connects perception to liberation. For Arjuna, this means fighting with equal respect for all, avoiding harm to his soul through hatred, ensuring his warrior duties lead to the supreme goal of union with Krishna."
      },
      "slok30": {
        "sanskrit": "प्रकृत्यैव च कर्माणि क्रियमाणानि सर्वशः। यः पश्यति तथात्मानमकर्तारं स पश्यति।।13.30।।",
        "transliteration": "prakṛtyaiva ca karmāṇi kriyamāṇāni sarvaśaḥ, yaḥ paśyati tathātmānam akartāraṁ sa paśyati",
        "meaning": "One who sees all actions performed by Prakriti alone and the self as non-doer truly sees.",
        "explanation": "Krishna teaches that true vision recognizes nature as the doer of actions, not the soul. This sloka emphasizes the soul’s non-agency. For Arjuna, this means his warrior actions are nature’s play, not his soul’s, allowing him to fight without ego, detached from the war’s outcomes, aligned with spiritual truth."
      },
      "slok31": {
        "sanskrit": "यदा भूतपृथग्भावमेकस्थमनुपश्यति। तत एव च विस्तारं ब्रह्म सम्पद्यति तदा।।13.31।।",
        "transliteration": "yadā bhūta-pṛthag-bhāvam eka-stham anupaśyati, tata eva ca vistāraṁ brahma sampadyati tadā",
        "meaning": "When one sees the diversity of beings as rooted in unity and their expansion from that alone, then one attains Brahman.",
        "explanation": "Krishna states that realizing the unity behind diverse beings leads to Brahman. This sloka emphasizes unity in diversity. For Arjuna, seeing all warriors as rooted in Krishna’s unity helps him fight without division, attaining spiritual unity through his duties, recognizing the war as Brahman’s expansion."
      },
      "slok32": {
        "sanskrit": "अनादित्वान्निर्गुणत्वात्परमात्मायमव्ययः। शरीरस्थोऽपि कौन्तेय न करोति न लिप्यते।।13.32।।",
        "transliteration": "anāditvān nirguṇatvāt paramātmāyam avyayaḥ, śarīra-stho ’pi kaunteya na karoti na lipyate",
        "meaning": "Being beginningless and without qualities, this imperishable supreme Self, though dwelling in the body, O son of Kunti, neither acts nor is tainted.",
        "explanation": "Krishna describes the supreme Self as eternal, quality-less, and untainted despite residing in the body. This sloka highlights the soul’s purity. For Arjuna, this assures that his soul remains untainted by the war’s violence, enabling him to fight as a pure, non-acting witness, free from material contamination."
      },
      "slok33": {
        "sanskrit": "यथा सर्वगतं सौक्ष्म्यादाकाशं नोपलिप्यते। सर्वत्रावस्थितो देहे तथात्मा नोपलिप्यते।।13.33।।",
        "transliteration": "yathā sarva-gataṁ saukṣmyād ākāśaṁ nopalipyate, sarvatrāvasthito dehe tathātmā nopalipyate",
        "meaning": "As the all-pervading ether is not tainted due to its subtlety, so the Self, present everywhere in the body, is not tainted.",
        "explanation": "Krishna compares the soul to ether, which remains untainted despite its presence. This sloka reinforces the soul’s purity. For Arjuna, this analogy ensures that his soul, like ether, remains pure amidst the war’s chaos, encouraging him to fight with the confidence that his spiritual essence is unaffected by material actions."
      },
      "slok34": {
        "sanskrit": "यथा प्रकाशति एकः कृत्स्नं लोकमिमं रविः। क्षेत्रं क्षेत्री तथा कृत्स्नं प्रकाशति भारत।।13.34।।",
        "transliteration": "yathā prakāśati ekaḥ kṛtsnaṁ lokam imaṁ raviḥ, kṣetraṁ kṣetrī tathā kṛtsnaṁ prakāśati bhārata",
        "meaning": "As the one sun illuminates the entire world, so the knower of the field illuminates the entire field, O Bharata.",
        "explanation": "Krishna compares the soul to the sun, illuminating the body as the sun lights the world. This sloka concludes Chapter 13, emphasizing the soul’s illuminating presence. For Arjuna, this vision of his soul as the illuminator of his body inspires him to fight with clarity, knowing his eternal self enlightens his actions, leading to liberation."
      }
    }
  }
]
