[
  {
    "chapter15": {
      "title": "Purushottama Yoga (The Yoga of the Supreme Person)",
      "description": "In Chapter 15, Krishna describes the cosmic tree of samsara, its roots, and how to cut it down with detachment. He explains the perishable (Kshara), imperishable (Akshara), and supreme Purusha (Purushottama), emphasizing devotion to the Supreme Person as the path to liberation. For Arjuna, this knowledge enables him to perform his warrior duties with detachment, focusing on Krishna as the Supreme Person, transcending the material world of war.",
      "total_verses": 20,
      "slok1": {
        "sanskrit": "श्रीभगवानुवाच। ऊर्ध्वमूलमधःशाखमश्वत्थं प्राहुरव्ययम्। छन्दांसि यस्य पर्णानि यस्तं वेद स वेदवित्।।15.1।।",
        "transliteration": "śrī bhagavān uvāca ūrdhva-mūlam adhaḥ-śākham aśvatthaṁ prāhur avyayam, chandāṁsi yasya parṇāni yas taṁ veda sa veda-vit",
        "meaning": "The Supreme Lord said: They speak of an imperishable banyan tree with roots above and branches below, whose leaves are the Vedas; one who knows it knows the Vedas.",
        "explanation": "Krishna introduces the cosmic banyan tree, symbolizing samsara, with roots in the divine and branches in the material world, its leaves representing the Vedas. This sloka sets the metaphor for material existence. For Arjuna, the war represents a branch of this tree, urging him to understand its illusory nature and perform his duties with knowledge of the eternal, rooted in Krishna."
      },
      "slok2": {
        "sanskrit": "अधश्चोर्ध्वं प्रसृतास्तस्य शाखा गुणप्रवृद्धा विषयप्रवालाः। अधश्च मूलान्यनुसन्ततानि कर्मानुबन्धीनि मनुष्यलोके।।15.2।।",
        "transliteration": "adhaś cordhvaṁ prasṛtās tasya śākhā guṇa-pravṛddhā viṣaya-pravālāḥ, adhaś ca mūlāny anusantatāni karmānubandhīni manuṣya-loke",
        "meaning": "Its branches spread below and above, nourished by the gunas, with sense objects as sprouts; its roots extend downward, binding to actions in the human world.",
        "explanation": "Krishna describes the tree’s branches, fed by the three gunas, with sense objects as sprouts, and secondary roots binding humans through actions. This sloka elaborates samsara’s entanglement. For Arjuna, the war’s conflicts are sprouts of sense desires, driven by gunas; understanding this helps him act without attachment, cutting through the tree’s roots with detached duty."
      },
      "slok3": {
        "sanskrit": "न रूपमस्येह तथोपलभ्यते नान्तो न चादिर्न च सम्प्रतिष्ठा। अश्वत्थमेनं सुविरूढमूलमसङ्गशस्त्रेण दृढेन छित्त्वा।।15.3।।",
        "transliteration": "na rūpam asyeha tathopalabhyate nānto na cādir na ca sampratiṣṭhā, aśvattham enaṁ suvirūḍha-mūlam asaṅga-śastreṇa dṛḍhena chittvā",
        "meaning": "Its form is not perceived here, nor its end, beginning, or foundation; having cut this deeply rooted banyan tree with the strong axe of detachment,",
        "explanation": "Krishna explains that the tree’s true form is imperceptible, with no clear origin or end, and must be cut with detachment’s axe. This sloka emphasizes liberation through non-attachment. For Arjuna, the war’s complexities are part of this illusory tree; detaching from outcomes allows him to fight as a warrior, severing material ties with Krishna-focused action."
      },
      "slok4": {
        "sanskrit": "ततः पदं तत्परिमार्गितव्यं यत्र गता न निवर्तन्ति भूयः। तमेव चाद्यं पुरुषं प्रपद्ये यतः प्रवृत्तिः प्रसृता पुराणी।।15.4।।",
        "transliteration": "tataḥ padaṁ tat parimārgitavyaṁ yatra gatā na nivartanti bhūyaḥ, tam eva cādyaṁ puruṣaṁ prapadye yataḥ pravṛttiḥ prasṛtā purāṇī",
        "meaning": "Then, one must seek that place from which, having gone, one never returns, and surrender to the primal Purusha, from whom this ancient activity emanated.",
        "explanation": "Krishna instructs to seek the supreme destination, attainable by surrendering to the primal Purusha, ending rebirth. This sloka points to liberation through devotion. For Arjuna, surrendering to Krishna while fighting ensures he reaches this non-returning state, aligning his warrior duties with devotion to the Supreme Person, transcending samsara."
      },
      "slok5": {
        "sanskrit": "निर्मानमोहा जितसङ्गदोषा अध्यात्मनित्या विनिवृत्तकामाः। द्वन्द्वैर्विमुक्ताः सुखदुःखसंज्ञैर्गच्छन्त्यमूढाः पदमव्ययं तत्।।15.5।।",
        "transliteration": "nirmāna-mohā jita-saṅga-doṣā adhyātma-nityā vinivṛtta-kāmāḥ, dvandvair vimuktāḥ sukha-duḥkha-saṁjñair gacchanty amūḍhāḥ padam avyayaṁ tat",
        "meaning": "Free from pride and delusion, victorious over attachment’s flaws, constant in spiritual knowledge, desires subdued, liberated from dualities like pleasure and pain, the undeluded reach that imperishable state.",
        "explanation": "Krishna describes the qualities of those who attain the supreme state: freedom from pride, attachment, desires, and dualities. This sloka outlines the path’s prerequisites. For Arjuna, cultivating these qualities in battle—overcoming pride, desire, and emotional swings—ensures his warrior actions lead to Krishna’s eternal abode, free from the war’s dualities."
      },
      "slok6": {
        "sanskrit": "न तद्भासति सूर्यः न शशाङ्को न पावकः। यद्गत्वा न निवर्तन्ति तद् धाम परमं मम।।15.6।।",
        "transliteration": "na tad bhāsati sūryaḥ na śaśāṅko na pāvakaḥ, yad gatvā na nivartanti tad dhāma paramaṁ mama",
        "meaning": "Neither the sun, moon, nor fire illumines that; having gone there, one does not return—that is My supreme abode.",
        "explanation": "Krishna describes his supreme abode, beyond material illumination, from which there is no return. This sloka emphasizes the divine destination’s transcendence. For Arjuna, this vision inspires him to fight with devotion to Krishna, knowing his warrior duties can lead to this eternal abode, free from the war’s material conflicts and rebirth."
      },
      "slok7": {
        "sanskrit": "ममैवांशो जीवलोके जीवभूतः सनातनः। मनःषष्ठानीन्द्रियाणि प्रकृतिस्थानि कर्षति।।15.7।।",
        "transliteration": "mamaivāṁśo jīva-loke jīva-bhūtaḥ sanātanaḥ, manaḥ-ṣaṣṭhānīndriyāṇi prakṛti-sthāni karṣati",
        "meaning": "An eternal fragment of Myself becomes the living soul in the world of beings, drawing to itself the five senses and the mind, situated in Prakriti.",
        "explanation": "Krishna reveals that the soul is an eternal fragment of himself, entangled in nature with the mind and senses. This sloka clarifies the soul’s divine origin. For Arjuna, recognizing his soul as Krishna’s fragment empowers him to fight as a divine extension, detaching from the senses’ pull in the war’s sensory chaos."
      },
      "slok8": {
        "sanskrit": "शरीरं यदवाप्नोति यच्चाप्युत्क्रामतीश्वरः। गृहीत्वैतानि संयाति वायुर्गन्धानिवाशयात्।।15.8।।",
        "transliteration": "śarīraṁ yad avāpnoti yac cāpy utkrāmatīśvaraḥ, gṛhītvaitāni saṁyāti vāyur gandhān ivāśayāt",
        "meaning": "When the Lord (soul) takes a body and leaves it, it carries these (senses and mind), as the wind carries fragrances from their source.",
        "explanation": "Krishna compares the soul’s movement between bodies to the wind carrying scents, taking the senses and mind. This sloka explains transmigration. For Arjuna, this assures that his soul, not the body, is the true self, enabling him to fight without fear of death, knowing his essence persists beyond the war’s physical losses."
      },
      "slok9": {
        "sanskrit": "श्रोत्रं चक्षुः स्पर्शनं च रसनं घ्राणमेव च। अधिष्ठाय मनश्चायं विषयानुपसेवति।।15.9।।",
        "transliteration": "śrotraṁ cakṣuḥ sparśanaṁ ca rasanaṁ ghrāṇam eva ca, adhiṣṭhāya manaś cāyaṁ viṣayān upasevati",
        "meaning": "Presiding over the ear, eye, touch, taste, smell, and mind, it (the soul) experiences sense objects.",
        "explanation": "Krishna explains that the soul, through the senses and mind, engages with sense objects. This sloka highlights the soul’s interaction with the material world. For Arjuna, this teaches that his war experiences are sense-driven, urging him to detach from sensory outcomes, focusing his soul on Krishna while performing warrior duties."
      },
      "slok10": {
        "sanskrit": "उत्क्रामन्तं स्थितं वाऽपि भुञ्जानं वा गुणान्वितम्। विमूढा नानुपश्यन्ति पश्यन्ति ज्ञानचक्षुषः।।15.10।।",
        "transliteration": "utkrāmantaṁ sthitaṁ vāpi bhuñjānaṁ vā guṇānvitam, vimūḍhā nānupaśyanti paśyanti jñāna-cakṣuṣaḥ",
        "meaning": "The deluded do not see it (the soul) departing, residing, or enjoying, endowed with gunas; those with the eye of knowledge see it.",
        "explanation": "Krishna contrasts the ignorant, who cannot perceive the soul’s actions, with the wise, who see it through knowledge. This sloka emphasizes spiritual vision. For Arjuna, this encourages cultivating wisdom to see his soul beyond the war’s material events, enabling him to fight with insight, detached from the gunas’ influence."
      },
      "slok11": {
        "sanskrit": "यतन्तो योगिनश्चैनं पश्यन्त्यात्मन्यवस्थितम्। यतन्तोऽप्यकृतात्मानो नैनं पश्यन्त्यचेतसः।।15.11।।",
        "transliteration": "yatanto yoginaś cainaṁ paśyanty ātmany avasthitam, yatanto ’py akṛtātmāno nainaṁ paśyanty acetasaḥ",
        "meaning": "Striving yogis see it (the soul) situated in the self, but the unrefined, despite striving, do not see it, lacking discernment.",
        "explanation": "Krishna states that disciplined yogis perceive the soul, while the undisciplined cannot, despite effort. This sloka stresses spiritual discipline. For Arjuna, this urges refining his mind through devotion to Krishna, enabling him to see his soul amidst war’s chaos, ensuring his warrior actions align with spiritual realization."
      },
      "slok12": {
        "sanskrit": "यदादित्यगतं तेजो जगद्भासति सर्वम्। यच्चन्द्रमसि यच्चाग्नौ तत्तेजो विद्धि मामकम्।।15.12।।",
        "transliteration": "yad āditya-gataṁ tejo jagad bhāsati sarvam, yac candramasi yac cāgnau tat tejo viddhi māmakam",
        "meaning": "The splendor in the sun that illumines the whole world, in the moon, and in fire—know that splendor to be Mine.",
        "explanation": "Krishna declares his divine presence as the radiance in the sun, moon, and fire. This sloka reveals his cosmic influence. For Arjuna, seeing Krishna’s splendor in the battlefield’s elements inspires awe, encouraging him to fight with devotion, recognizing the war’s events as manifestations of Krishna’s divine energy."
      },
      "slok13": {
        "sanskrit": "गामाविश्य च भूतानि धारयाम्यहमोजसा। पुष्णामि चौषधीः सर्वाः सोमो भूत्वा रसात्मकः।।15.13।।",
        "transliteration": "gām āviśya ca bhūtāni dhārayāmy aham ojasā, puṣṇāmi cauṣadhīḥ sarvāḥ somo bhūtvā rasātmakaḥ",
        "meaning": "Entering the earth, I sustain all beings with My energy; becoming the moon’s essence, I nourish all plants.",
        "explanation": "Krishna describes sustaining life through his energy in the earth and nourishing plants as the moon’s essence. This sloka emphasizes his life-giving role. For Arjuna, this reveals Krishna’s presence in the war’s environment, urging him to fight with gratitude, offering his actions to the divine sustainer of all life."
      },
      "slok14": {
        "sanskrit": "अहं वैश्वानरो भूत्वा प्राणिनां देहमाश्रितः। प्राणापानसमायुक्तः पचाम्यन्नं चतुर्विधम्।।15.14।।",
        "transliteration": "ahaṁ vaiśvānaro bhūtvā prāṇināṁ deham āśritaḥ, prāṇāpāna-samāyuktaḥ pacāmy annaṁ catur-vidham",
        "meaning": "Becoming the digestive fire in the bodies of living beings, united with prana and apana, I digest the four kinds of food.",
        "explanation": "Krishna identifies himself as the digestive fire, processing food with vital breaths. This sloka highlights his role in bodily functions. For Arjuna, this teaches that Krishna sustains his physical strength for battle, encouraging him to fight with dedication, recognizing his energy as Krishna’s divine support."
      },
      "slok15": {
        "sanskrit": "सर्वस्य चाहं हृदि सन्निविष्टो मत्तः स्मृतिर्ज्ञानमपोहनं च। वेदैश्च सर्वैरहमेव वेद्यो वेदान्तकृद्वेदविदेव चाहम्।।15.15।।",
        "transliteration": "sarvasya cāhaṁ hṛdi sanniviṣṭo mattaḥ smṛtir jñānam apohanaṁ ca, vedaiś ca sarvair aham eva vedyo vedānta-kṛd veda-vid eva cāham",
        "meaning": "I am seated in the hearts of all; from Me come memory, knowledge, and their loss; I alone am to be known by all the Vedas; I am the author of Vedanta and the knower of the Vedas.",
        "explanation": "Krishna resides in all hearts, governing memory and knowledge, and is the Vedas’ ultimate object and author. This sloka establishes his supreme divinity. For Arjuna, this assures Krishna’s presence in his heart, guiding his war decisions, urging him to fight with devotion, seeking the divine known through Vedic wisdom."
      },
      "slok16": {
        "sanskrit": "द्वाविमौ पुरुषौ लोके क्षरश्चाक्षर एव च। क्षरः सर्वं भूतानि कूटस्थोऽक्षर उच्यते।।15.16।।",
        "transliteration": "dvāv imau puruṣau loke kṣaraś cākṣara eva ca, kṣaraḥ sarvaṁ bhūtāni kūṭa-stho ’kṣara ucyate",
        "meaning": "There are two Purushas in this world: the perishable and the imperishable; all beings are perishable, and the unchanging is called imperishable.",
        "explanation": "Krishna introduces two Purushas: the perishable (all beings) and the imperishable (unchanging soul). This sloka begins the distinction of spiritual entities. For Arjuna, this clarifies that the war’s warriors are perishable, but their souls are imperishable, enabling him to fight without attachment, focusing on the eternal essence."
      },
      "slok17": {
        "sanskrit": "उत्तमः पुरुषस्त्वन्यः परमात्मेत्युदाहृतः। यो लोकत्रयमाविश्य बिभर्त्यव्यय ईश्वरः।।15.17।।",
        "transliteration": "uttamaḥ puruṣas tv anyaḥ paramātmety udāhṛtaḥ, yo loka-trayam āviśya bibharty avyaya īśvaraḥ",
        "meaning": "But distinct is the Supreme Purusha, called the Supreme Self, the imperishable Lord who pervades and sustains the three worlds.",
        "explanation": "Krishna introduces the Supreme Purusha (Purushottama), the Supreme Self sustaining all existence. This sloka elevates the discourse to the ultimate divinity. For Arjuna, recognizing Krishna as the Supreme Purusha inspires him to fight as an instrument of the divine, ensuring his warrior duties align with the imperishable Lord’s will."
      },
      "slok18": {
        "sanskrit": "यस्मात्क्षरमतीतोऽहमक्षरादपि चोत्तमः। अतोऽस्मि लोके वेदे च प्रथितः पुरुषोत्तमः।।15.18।।",
        "transliteration": "yasmāt kṣaram atīto ’ham akṣarād api cottamaḥ, ato ’smi loke vede ca prathitaḥ puruṣottamaḥ",
        "meaning": "As I transcend the perishable and am above the imperishable, I am celebrated as the Supreme Person in the world and the Vedas.",
        "explanation": "Krishna declares himself as Purushottama, transcending both perishable and imperishable, renowned in scriptures and the world. This sloka affirms his supreme status. For Arjuna, this inspires absolute devotion to Krishna in battle, ensuring his actions are offerings to the Supreme Person, transcending the war’s perishable and imperishable elements."
      },
      "slok19": {
        "sanskrit": "यो मामेवमसंमूढो जानाति पुरुषोत्तमम्। स सर्वविद्भजति मां सर्वभावेन भारत।।15.19।।",
        "transliteration": "yo mām evam asaṁmūḍho jānāti puruṣottamam, sa sarva-vid bhajati māṁ sarva-bhāvena bhārata",
        "meaning": "One who, undeluded, knows Me as the Supreme Person, knows all and worships Me with their whole being, O Bharata.",
        "explanation": "Krishna states that knowing him as Purushottama without delusion leads to complete knowledge and wholehearted devotion. This sloka emphasizes devotion’s culmination. For Arjuna, this urges fighting with full devotion to Krishna, knowing him as the Supreme, ensuring his warrior duties are acts of worship, leading to spiritual fulfillment."
      },
      "slok20": {
        "sanskrit": "इति गुह्यतमं शास्त्रमिदमुक्तं मयानघ। एतद्बुद्ध्वा बुद्धिमान्स्यात्कृतकृत्यश्च भारत।।15.20।।",
        "transliteration": "iti guhyatamaṁ śāstram idam uktaṁ mayānagha, etad buddhvā buddhimān syāt kṛta-kṛtyaś ca bhārata",
        "meaning": "Thus, I have taught this most secret scripture, O sinless one; understanding it, one becomes wise and fulfills their duties, O Bharata.",
        "explanation": "Krishna concludes Chapter 15, calling it the most confidential teaching, leading to wisdom and duty fulfillment. This sloka summarizes the chapter’s essence. For Arjuna, this assures that internalizing Purushottama Yoga makes him wise, enabling him to fight with divine understanding, fulfilling his warrior duties as acts of devotion to Krishna."
      }
    }
  }
]
