[
  {
    "chapter12": {
      "title": "Bhakti Yoga (The Yoga of Devotion)",
      "description": "In Chapter 12, Krishna elucidates the path of devotion (bhakti), comparing it to other spiritual paths and declaring it supreme. He describes the qualities of a true devotee and offers practical steps for those striving to cultivate devotion. For Arjuna, this teaching provides a direct, accessible way to align his warrior duties with love and surrender to Krishna, ensuring spiritual liberation.",
      "total_verses": 20,
      "slok1": {
        "sanskrit": "अर्जुन उवाच। एवं सततयुक्ता ये भक्तास्त्वां पर्युपासते। येचाप्यक्षरमव्यक्तं तेषां के योगवित्तमाः।।12.1।।",
        "transliteration": "arjuna uvāca evaṁ satata-yuktā ye bhaktās tvāṁ paryupāsate, ye cāpy akṣaram avyaktaṁ teṣāṁ ke yoga-vittamāḥ",
        "meaning": "Arjuna said: Those devotees who, ever steadfast, worship You thus, and those who worship the imperishable, unmanifested— which of them are better versed in Yoga?",
        "explanation": "Arjuna asks Krishna to compare devotees who worship his personal form with those who worship the impersonal, unmanifested Brahman, seeking clarity on the superior path. This sloka sets the stage for Krishna’s exposition on bhakti. For Arjuna, this question reflects his need to choose a spiritual practice that supports his warrior duties, seeking a path that ensures clarity and liberation amidst the war’s chaos."
      },
      "slok2": {
        "sanskrit": "श्रीभगवानुवाच। मय्यावेश्य मनो ये मां नित्ययुक्ता उपासते। श्रद्धया परयोपेतास्ते मे युक्ततमा मताः।।12.2।।",
        "transliteration": "śrī bhagavān uvāca mayy āveśya mano ye māṁ nitya-yuktā upāsate, śraddhayā parayopetās te me yuktatamā matāḥ",
        "meaning": "The Supreme Lord said: Those who, fixing their minds on Me, worship Me, ever steadfast, endowed with supreme faith, they are the most perfect in Yoga, in My opinion.",
        "explanation": "Krishna declares that devotees who worship his personal form with steadfast focus and supreme faith are the most perfect in Yoga. This sloka prioritizes bhakti yoga. For Arjuna, this affirms that dedicating his warrior actions to Krishna with faith is the highest path, enabling him to fight with devotion, aligning his duties with divine love."
      },
      "slok3": {
        "sanskrit": "ये त्वक्षरमनिर्देश्यमव्यक्तं पर्युपासते। सर्वत्रगमचिन्त्यं च कूटस्थमचलं ध्रुवम्।।12.3।।",
        "transliteration": "ye tv akṣaram anirdeśyam avyaktaṁ paryupāsate, sarvatra-gam acintyaṁ ca kūṭa-stham acalaṁ dhruvam",
        "meaning": "But those who worship the imperishable, indefinable, unmanifested, all-pervading, inconceivable, unchanging, immovable, and eternal,",
        "explanation": "Krishna describes the worshippers of the impersonal Brahman, who focus on its abstract, unchanging, and all-pervading nature. This sloka begins the comparison with bhakti. For Arjuna, this abstract path is less relatable, as his warrior context requires a tangible focus like Krishna’s personal form to inspire devotion and guide his actions in the war."
      },
      "slok4": {
        "sanskrit": "सन्नियम्येन्द्रियग्रामं सर्वत्र समबुद्धयः। ते प्राप्नुवन्ति मामेव सर्वभूतहिते रताः।।12.4।।",
        "transliteration": "sanniyamyendriya-grāmaṁ sarvatra sama-buddhayaḥ, te prāpnuventi mām eva sarva-bhūta-hite ratāḥ",
        "meaning": "Controlling all their senses, even-minded everywhere, engaged in the welfare of all beings, they also attain Me.",
        "explanation": "Krishna explains that those who worship the unmanifested, by controlling senses, maintaining equanimity, and working for others’ welfare, also reach him. This sloka acknowledges the validity of the impersonal path. For Arjuna, this suggests that equanimity in battle can lead to Krishna, but bhakti remains more practical for his emotionally charged warrior role."
      },
      "slok5": {
        "sanskrit": "क्लेशोऽधिकतरस्तेषामव्यक्तासक्तचेतसाम्। अव्यक्ता हि गतिर्दुःखं देहवद्भिरवाप्यते।।12.5।।",
        "transliteration": "kleśo ’dhikataras teṣām avyaktāsakta-cetasām, avyaktā hi gatir duḥkhaṁ dehavadbhir avāpyate",
        "meaning": "Greater is their trouble whose minds are set on the unmanifested, for the goal of the unmanifested is hard to attain for embodied beings.",
        "explanation": "Krishna states that worshipping the unmanifested is more difficult for embodied beings, as it involves greater struggle. This sloka highlights bhakti’s accessibility. For Arjuna, this confirms that devotion to Krishna’s personal form is easier, enabling him to focus his warrior efforts on Krishna with love, avoiding the abstract path’s challenges."
      },
      "slok6": {
        "sanskrit": "ये तु सर्वं कर्माणि मयि संन्यास्य मत्पराः। अनन्येनैव योगेन मां ध्यायन्त उपासते।।12.6।।",
        "transliteration": "ye tu sarvaṁ karmāṇi mayi saṁnyāsya mat-parāḥ, ananyenaiva yogena māṁ dhyāyanta upāsate",
        "meaning": "But those who surrender all actions to Me, devoted to Me, meditate on Me with exclusive Yoga, and worship Me,",
        "explanation": "Krishna describes devotees who surrender all actions to him, focusing exclusively on him through meditation and worship. This sloka outlines the essence of bhakti yoga. For Arjuna, this means dedicating his warrior duties to Krishna, meditating on him during battle, ensuring his actions are acts of devotion, leading to spiritual liberation."
      },
      "slok7": {
        "sanskrit": "तेषामहं समुद्धर्ता मृत्युसंसारसागरात्। भवामि नचिरात्पार्थ मय्यावेशितचेतसाम्।।12.7।।",
        "transliteration": "teṣām ahaṁ samuddhartā mṛtyu-saṁsāra-sāgarāt, bhavāmi nacirāt pārtha mayy āveśita-cetasām",
        "meaning": "For those whose minds are fixed on Me, I become their swift deliverer from the ocean of death and worldly existence, O Partha.",
        "explanation": "Krishna promises to swiftly liberate devotees who fix their minds on him, rescuing them from the cycle of birth and death. This sloka emphasizes his grace in bhakti. For Arjuna, this assurance means that devotion during the war will lead to liberation, encouraging him to fight with love for Krishna, trusting in divine deliverance."
      },
      "slok8": {
        "sanskrit": "मय्येव मन आधत्स्व मयि बुद्धिं निवेशय। निवसिष्यसि मय्येव अत ऊर्ध्वं न संशयः।।12.8।।",
        "transliteration": "mayy eva mana ādhatsva mayi buddhiṁ niveśaya, nivasiṣyasi mayy eva ata ūrdhvaṁ na saṁśayaḥ",
        "meaning": "Fix your mind on Me alone, place your intellect in Me; thereafter, you will surely dwell in Me, without doubt.",
        "explanation": "Krishna instructs Arjuna to focus his mind and intellect solely on him, assuring union with him. This sloka provides a direct practice for bhakti. For Arjuna, this means centering his thoughts on Krishna during battle, ensuring his warrior actions are offerings of love, leading to spiritual union with the divine."
      },
      "slok9": {
        "sanskrit": "अथ चित्तं समाधातुं न शक्नोषि मयि स्थिरम्। अभ्यासयोगेन ततो मां इच्छाप्तुं धनञ्जय।।12.9।।",
        "transliteration": "atha cittaṁ samādhātuṁ na śaknoṣi mayi sthiram, abhyāsa-yogena tato māṁ icchāptuṁ dhanañjaya",
        "meaning": "If you cannot fix your mind steadily on Me, then seek to attain Me through the Yoga of constant practice, O Dhananjaya.",
        "explanation": "Krishna offers an alternative for those unable to focus steadily: practice yoga through repeated effort. This sloka shows bhakti’s accessibility. For Arjuna, this suggests that if constant devotion is challenging amidst war, he can practice focusing on Krishna repeatedly, gradually aligning his warrior duties with divine love through persistent effort."
      },
      "slok10": {
        "sanskrit": "अभ्यासेऽप्यसमर्थोऽसि मत्कर्मपरमो भव। मदर्थं कर्माणि कुर्वन्सिद्धिं प्राप्स्यसि।।12.10।।",
        "transliteration": "abhyāse ’py asamartho ’si mat-karma-paramo bhava, mad-arthaṁ karmāṇi kurvan siddhiṁ prāpsyasi",
        "meaning": "If you are unable even to practice, then be intent on working for Me. Performing actions for My sake, you will attain perfection.",
        "explanation": "Krishna suggests that if practice is too difficult, one can perform actions dedicated to him to achieve perfection. This sloka further simplifies bhakti. For Arjuna, this means dedicating his warrior tasks to Krishna, transforming battles into acts of service, ensuring spiritual success even if deep meditation is challenging."
      },
      "slok11": {
        "sanskrit": "अथैतदप्यशक्तोऽसि कर्तुं मद्योगमाश्रितः। सर्वकर्मफलत्यागं ततः कुरु यतात्मवान्।।12.11।।",
        "transliteration": "athaitad apy aśakto ’si kartuṁ mad-yogam āśritaḥ, sarva-karma-phala-tyāgaṁ tataḥ kuru yatātmavān",
        "meaning": "If you are unable to do even this, then, taking refuge in My Yoga, renounce the fruits of all actions with self-control.",
        "explanation": "Krishna advises that if dedicating actions is difficult, one can renounce the fruits of actions while relying on him. This sloka offers the simplest bhakti practice. For Arjuna, this means performing his warrior duties without attachment to outcomes, surrendering results to Krishna, ensuring his actions align with divine will through self-control."
      },
      "slok12": {
        "sanskrit": "श्रेयो हि ज्ञानमभ्यासाज्ज्ञानाद्ध्यानं विशिष्यते। ध्यानात्कर्मफलत्यागस्त्यागाच्छान्तिरनन्तरम्।।12.12।।",
        "transliteration": "śreyo hi jñānam abhyāsāj jñānād dhyānaṁ viśiṣyate, dhyānāt karma-phala-tyāgas tyāgāc chāntir anantaram",
        "meaning": "Knowledge is better than practice, meditation is better than knowledge, renunciation of action’s fruits is better than meditation; from renunciation, peace follows immediately.",
        "explanation": "Krishna ranks spiritual practices, stating that renouncing action’s fruits surpasses meditation, knowledge, and practice, leading to immediate peace. This sloka emphasizes detachment’s efficacy. For Arjuna, this suggests that renouncing the war’s outcomes brings peace, enabling him to fight with a calm mind, devoted to Krishna without attachment."
      },
      "slok13": {
        "sanskrit": "अद्वेष्टा सर्वभूतानां मैत्रः करुण एव च। निर्ममो निरहङ्कारः समदुःखसुखः क्षमी।।12.13।।",
        "transliteration": "adveṣṭā sarva-bhūtānāṁ maitraḥ karuṇa eva ca, nirmamo nirahaṅkāraḥ sama-duḥkha-sukhaḥ kṣamī",
        "meaning": "One who hates no being, is friendly and compassionate, free from attachment and ego, balanced in pleasure and pain, and forgiving,",
        "explanation": "Krishna begins describing a devotee’s qualities: non-hatred, friendliness, compassion, detachment, egolessness, equanimity, and forgiveness. This sloka outlines the ideal devotee’s character. For Arjuna, these qualities guide his conduct in war, urging him to fight without hatred, with compassion and equanimity, aligning his warrior role with divine virtues."
      },
      "slok14": {
        "sanskrit": "सन्तुष्टः सततं योगी यतात्मा दृढनिश्चयः। मय्यर्पितमनोबुद्धिर्यो मद्भक्तः स मे प्रियः।।12.14।।",
        "transliteration": "santuṣṭaḥ satataṁ yogī yatātmā dṛḍha-niścayaḥ, mayy arpita-mano-buddhir yo mad-bhaktaḥ sa me priyaḥ",
        "meaning": "Ever content, steady in Yoga, self-controlled, firm in resolve, with mind and intellect dedicated to Me, such a devotee is dear to Me.",
        "explanation": "Krishna continues listing devotee qualities: contentment, steadfastness, self-control, firm resolve, and dedication of mind and intellect to him. This sloka highlights devotion’s rewards. For Arjuna, these traits inspire him to remain content and resolute in battle, dedicating his actions to Krishna, ensuring his warrior duties are acts of love, dear to the divine."
      },
      "slok15": {
        "sanskrit": "यस्मान्नोद्विजति लोकः लोकान्नोद्विजति च यः। हर्षामर्षभयोद्वेगैर्मुक्तो यः स च मे प्रियः।।12.15।।",
        "transliteration": "yasmān nodvijati lokaḥ lokān nodvijati ca yaḥ, harṣāmarṣa-bhaya-udvegair mukto yaḥ sa ca me priyaḥ",
        "meaning": "One who does not disturb the world, nor is disturbed by the world, free from joy, envy, fear, and anxiety, is dear to Me.",
        "explanation": "Krishna describes a devotee who neither causes nor suffers disturbance, free from emotional extremes. This sloka emphasizes emotional stability. For Arjuna, this means maintaining composure in the war, neither causing unnecessary harm nor being swayed by battle’s emotions, ensuring his actions reflect devotion and divine favor."
      },
      "slok16": {
        "sanskrit": "अनपेक्षः शुचिर्दक्षः उदासीनो गतव्यथः। सर्वारम्भपरित्यागी यो मद्भक्तः स मे प्रियः।।12.16।।",
        "transliteration": "anapekṣaḥ śucir dakṣaḥ udāsīno gata-vyathaḥ, sarvārambha-parityāgī yo mad-bhaktaḥ sa me priyaḥ",
        "meaning": "One who is desireless, pure, skillful, impartial, free from anxiety, and renounces all undertakings, such a devotee is dear to Me.",
        "explanation": "Krishna lists further qualities: desirelessness, purity, skill, impartiality, freedom from anxiety, and renunciation of initiatives. This sloka highlights a devotee’s detachment. For Arjuna, these traits guide him to fight skillfully without personal desires, remaining pure and impartial, ensuring his warrior actions are selfless offerings to Krishna."
      },
      "slok17": {
        "sanskrit": "यो न हृष्यति न द्वेष्टि न शोचति न काङ्क्षति। शुभाशुभपरित्यागी भक्तिमान्यः स मे प्रियः।।12.17।।",
        "transliteration": "yo na hṛṣyati na dveṣṭi na śocati na kāṅkṣati, śubhāśubha-parityāgī bhaktimān yaḥ sa me priyaḥ",
        "meaning": "One who neither rejoices nor hates, neither grieves nor desires, renouncing good and evil, full of devotion, is dear to Me.",
        "explanation": "Krishna describes a devotee who is emotionally neutral, detached from good and evil, and devoted. This sloka emphasizes transcendence through devotion. For Arjuna, this means fighting without attachment to victory or loss, free from grief or desire, ensuring his warrior duties are performed with pure devotion to Krishna."
      },
      "slok18": {
        "sanskrit": "समः शत्रौ च मित्रे च तथा मानापमानयोः। शीतोष्णसुखदुःखेषु समः सङ्गविवर्जितः।।12.18।।",
        "transliteration": "samaḥ śatrau ca mitre ca tathā māna-apamānayoḥ, śītoṣṇa-sukha-duḥkheṣu samaḥ saṅga-vivarjitaḥ",
        "meaning": "One who is equal to friend and foe, honor and dishonor, cold and heat, pleasure and pain, free from attachment,",
        "explanation": "Krishna continues describing a devotee’s equanimity toward opposites and detachment from attachments. This sloka highlights a balanced mindset. For Arjuna, this equanimity is vital in war, enabling him to treat allies and enemies alike, remain unaffected by battle’s ups and downs, and fight as a detached, devoted servant of Krishna."
      },
      "slok19": {
        "sanskrit": "तुल्यनिन्दास्तुतिर्मौनी सन्तुष्टो येन केनचित्। अनिकेतः स्थिरमतिर्भक्तिमान्मे प्रियो नरः।।12.19।।",
        "transliteration": "tulya-nindā-stutir maunī santuṣṭo yena kenacit, aniketaḥ sthira-matir bhaktimān me priyo naraḥ",
        "meaning": "One who is equal to praise and blame, silent, content with anything, homeless, steady-minded, full of devotion, such a person is dear to Me.",
        "explanation": "Krishna describes a devotee who is unaffected by praise or blame, content, unattached to a home, and steady in devotion. This sloka completes the devotee’s qualities. For Arjuna, these traits inspire him to remain steady and content in war, unaffected by outcomes, fighting with a devoted, unwavering mind dedicated to Krishna."
      },
      "slok20": {
        "sanskrit": "ये तु धर्म्यामृतमिदं यथोक्तं पर्युपासते। श्रद्धाना मत्परमा भक्तास्तेऽतीव मे प्रियाः।।12.20।।",
        "transliteration": "ye tu dharmyāmṛtam idaṁ yathoktaṁ paryupāsate, śraddhānā mat-paramā bhaktās te ’tīva me priyaḥ",
        "meaning": "Those who follow this immortal path of devotion as described, with faith, considering Me supreme, those devotees are exceedingly dear to Me.",
        "explanation": "Krishna concludes Chapter 12, stating that devotees who faithfully follow the path of bhakti, prioritizing him, are exceedingly dear to him. This sloka reaffirms bhakti’s supremacy. For Arjuna, this assures that fighting with faith and devotion to Krishna makes him dear to the divine, ensuring his warrior duties lead to spiritual fulfillment and divine love."
      }
    }
  }
]
