[
  {
    "chapter6": {
      "title": "Dhyana Yoga (The Yoga of Meditation)",
      "description": "In Chapter 6, Krishna elaborates on the path of meditation (Dhyana Yoga) as a means to self-realization and liberation. He explains the qualities of a true Yogi, the techniques of meditation, the importance of self-discipline, and the challenges of controlling the mind. Krishna assures Arjuna that consistent practice and detachment lead to spiritual success, addressing concerns about failure and the mind’s restlessness, guiding him toward inner peace and union with the divine.",
      "total_verses": 47,
      "slok1": {
        "sanskrit": "श्रीभगवानुवाच। अनाश्रितः कर्मफलं कार्यं कर्म करोति यः। स संन्यासी च योगी च न निरग्निर्न चाक्रियः।।6.1।।",
        "transliteration": "śrī bhagavān uvāca anāśritaḥ karma-phalaṁ kāryaṁ karma karoti yaḥ, sa sannyāsī ca yogī ca na niragnir na cākriyaḥ",
        "meaning": "The Supreme Lord said: One who performs prescribed duties without attachment to results is a true renunciant and Yogi, not one who merely renounces fire or action.",
        "explanation": "Krishna begins Chapter 6 by defining a true Yogi and sannyasi as one who performs duties selflessly, unattached to outcomes, rather than someone who simply abandons rituals (fire sacrifices) or physical action. This sloka integrates Karma Yoga with renunciation, emphasizing that true spirituality lies in detached action. For Arjuna, it suggests that fighting in the war, if done without selfish motives, aligns with the path of a Yogi, setting the tone for the chapter’s focus on disciplined practice."
      },
      "slok2": {
        "sanskrit": "यं संन्यासमिति प्राहुर्योगं तं विद्धि पाण्डव। न ह्यसंन्यस्तसङ्कल्पो योगी भवति कश्चन।।6.2।।",
        "transliteration": "yaṁ sannyāsam iti prāhur yogaṁ taṁ viddhi pāṇḍava, na hy asannyasta-saṅkalpo yogī bhavati kaścana",
        "meaning": "Know that what is called renunciation is the same as Yoga, O Pandava. One does not become a Yogi without renouncing selfish intentions.",
        "explanation": "Krishna equates true renunciation (sannyasa) with Yoga, emphasizing that a Yogi must abandon selfish desires and motives (sankalpa). This sloka clarifies that renunciation is internal, not merely external, and is essential for Yoga. For Arjuna, it implies that fighting the war with a pure mind, free from personal gain, aligns with both renunciation and Yoga, reinforcing the need for mental discipline."
      },
      "slok3": {
        "sanskrit": "आरुरुक्षोर्मुनेर्योगं कर्म कारणमुच्यते। योगारूढस्य तस्यैव शमः कारणमुच्यते।।6.3।।",
        "transliteration": "ārurukṣor muner yogaṁ karma kāraṇam ucyate, yogārūḍhasya tasyaiva śamaḥ kāraṇam ucyate",
        "meaning": "For a sage aspiring to ascend to Yoga, action is said to be the means. For one who has attained Yoga, tranquility is said to be the means.",
        "explanation": "Krishna explains that for a beginner in Yoga, selfless action (Karma Yoga) is the path to progress, while for an advanced Yogi, inner tranquility (mental stillness) sustains their state. This sloka outlines the progressive stages of spiritual practice, suggesting to Arjuna that his warrior duties, performed selflessly, are a stepping stone to higher meditative states, bridging action and meditation."
      },
      "slok4": {
        "sanskrit": "यदा हि नेन्द्रियार्थेषु न कर्मस्वनुषज्जति। सर्वसङ्कल्पसंन्यासी योगारूढस्तदोच्यते।।6.4।।",
        "transliteration": "yadā hi nendriyārtheṣu na karmasv anuṣajjati, sarva-saṅkalpa-sannyāsī yogārūḍhas tadocyate",
        "meaning": "When one is neither attached to sense objects nor to actions, having renounced all selfish intentions, then one is said to have attained Yoga.",
        "explanation": "Krishna describes the state of a Yogi who has mastered Yoga, characterized by detachment from sensory pleasures, actions, and selfish motives. This sloka defines the pinnacle of Yoga as complete mental freedom. For Arjuna, it implies that fighting without attachment to victory or personal gain elevates his actions to a yogic level, preparing him for meditation and liberation."
      },
      "slok5": {
        "sanskrit": "उद्धरेदात्मनात्मानं नात्मानमवसादयेत्। आत्मैव ह्यात्मनो बन्धुरात्मैव रिपुरात्मनः।।6.5।।",
        "transliteration": "uddhared ātmanātmānaṁ nātmānam avasādayet, ātmaiva hy ātmano bandhur ātmaiva ripur ātmanaḥ",
        "meaning": "One should uplift oneself by the self and not degrade oneself. The self alone is one’s friend, and the self alone is one’s enemy.",
        "explanation": "Krishna emphasizes self-reliance, urging one to elevate their mind through discipline rather than succumb to weakness. The mind can be a friend (leading to liberation) or an enemy (causing bondage). This profound sloka encourages Arjuna to master his mind, especially in his current dejection, to perform his duties and pursue meditation, highlighting personal responsibility in spiritual growth."
      },
      "slok6": {
        "sanskrit": "बन्धुरात्मात्मनस्तस्य येनात्मैवात्मना जितः। अनात्मनस्तु शत्रुत्वे वर्तेतात्मैव शत्रुवत्।।6.6।।",
        "transliteration": "bandhur ātmātmanas tasya yenātmaivātmanā jitaḥ, anātmanas tu śatrutve vartetātmaiva śatru-vat",
        "meaning": "For one who has conquered the self, the self is a friend. For one who has not subdued the self, the self acts as an enemy like a foe.",
        "explanation": "Krishna elaborates that a disciplined mind, subdued through self-control, becomes an ally, while an uncontrolled mind behaves like an enemy. This sloka reinforces the importance of mental discipline for a Yogi. For Arjuna, it suggests that mastering his emotions and doubts is essential to transform his mind into a supportive force for his warrior duties and spiritual practice."
      },
      "slok7": {
        "sanskrit": "जितात्मनः प्रशान्तस्य परमात्मा समाहितः। शीतोष्णसुखदुःखेषु तथा मानावमानयोः।।6.7।।",
        "transliteration": "jitātmanaḥ praśāntasya paramātmā samāhitaḥ, śītoṣṇa-sukha-duḥkheṣu tathā māna-avamānayoḥ",
        "meaning": "For one who has conquered the self and is tranquil, the Supreme Self is steadfast, in cold and heat, pleasure and pain, honor and dishonor.",
        "explanation": "Krishna describes a self-realized Yogi whose mind is tranquil and connected to the Supreme Self, remaining unaffected by dualities like cold-heat, pleasure-pain, or honor-dishonor. This sloka highlights the equanimity of a true Yogi. For Arjuna, it suggests that cultivating such balance through meditation will enable him to face the war’s challenges with inner peace, aligning with Dhyana Yoga."
      },
      "slok8": {
        "sanskrit": "ज्ञानविज्ञानतृप्तात्मा कूटस्थो विजितेन्द्रियः। युक्त इत्युच्यते योगी समलोष्टाश्मकाञ्चनः।।6.8।।",
        "transliteration": "jñāna-vijñāna-tṛptātmā kūṭastho vijitendriyaḥ, yukta ity ucyate yogī sama-loṣṭāśma-kāñcanaḥ",
        "meaning": "A Yogi, satisfied with knowledge and realization, steady, with senses controlled, viewing a clod, stone, and gold equally, is said to be united (yukta).",
        "explanation": "Krishna portrays a Yogi who is content with spiritual knowledge and realization, unwavering, sense-controlled, and impartial to material objects (clod, stone, or gold). This sloka defines the ideal Yogi’s equanimity and detachment. For Arjuna, it implies that meditative practice can help him view victory or defeat impartially, enabling him to act as a warrior without attachment."
      },
      "slok9": {
        "sanskrit": "सुहृन्मित्रार्युदासीनमध्यस्थद्वेष्यबन्धुषु। साधुष्वपि च पापेषु समबुद्धिर्विशिष्यते।।6.9।।",
        "transliteration": "suhṛn-mitrāry-udāsīna-madhyastha-dveṣya-bandhuṣu, sādhuṣv api ca pāpeṣu sama-buddhir viśiṣyate",
        "meaning": "One who maintains equal vision toward friend, foe, neutral, mediator, hateful, kinsman, saint, and sinner excels.",
        "explanation": "Krishna praises the Yogi who sees all beings—friends, enemies, neutrals, mediators, adversaries, relatives, saints, and sinners—with equal vision. This sloka emphasizes universal equality, a hallmark of spiritual maturity. For Arjuna, it suggests that meditation can cultivate impartiality, enabling him to face allies and enemies in battle with a balanced mind, free from personal bias."
      },
      "slok10": {
        "sanskrit": "योगी युञ्जीत सततमात्मानं रहसि स्थितः। एकाकी यतचित्तात्मा निराशीः अपरिग्रहः।।6.10।।",
        "transliteration": "yogī yuñjīta satatam ātmānaṁ rahasi sthitaḥ, ekākī yata-cittātmā nirāśīḥ aparigrahaḥ",
        "meaning": "The Yogi should constantly engage in Yoga, dwelling in solitude, alone, with controlled mind and self, free from desires and possessions.",
        "explanation": "Krishna outlines the practical discipline for meditation: a Yogi should practice in solitude, with a controlled mind, free from desires and material attachments. This sloka introduces the meditative lifestyle, emphasizing focus and detachment. For Arjuna, it implies that cultivating mental discipline through meditative practices will support his ability to perform warrior duties with clarity and detachment."
      },
      "slok11": {
        "sanskrit": "शुचौ देशे प्रतिष्ठाप्य स्थिरमासनमात्मनः। नात्युच्छ्रितं नातिनीचं चैलाजिनकुशोत्तरम्।।6.11।।",
        "transliteration": "śucau deśe pratiṣṭhāpya sthiram āsanam ātmanaḥ, nātyucchritaṁ nāti-nīcaṁ caila-ajina-kuśottaram",
        "meaning": "In a clean place, establishing a firm seat, neither too high nor too low, covered with cloth, deerskin, and kusha grass.",
        "explanation": "Krishna describes the physical setup for meditation: a clean, stable seat in a pure environment, moderately elevated, layered with kusha grass, deerskin, and cloth. This sloka provides practical guidance for creating a conducive meditative space. For Arjuna, it suggests that disciplined preparation, even in mental focus, is essential for spiritual practice, paralleling the discipline needed in battle."
      },
      "slok12": {
        "sanskrit": "तत्रैकाग्रं मनः कृत्वा यतचित्तेन्द्रियक्रियः। उपविश्यासने युञ्ज्याद्योगमात्मविशुद्धये।।6.12।।",
        "transliteration": "tatraikāgraṁ manaḥ kṛtvā yata-cittendriya-kriyaḥ, upaviśyāsane yuñjyād yogam ātma-viśuddhaye",
        "meaning": "There, focusing the mind, controlling the activities of mind and senses, seated on the seat, one should practice Yoga for self-purification.",
        "explanation": "Krishna instructs the Yogi to sit on the prepared seat, concentrate the mind, and restrain sensory and mental activities to practice Yoga for self-purification. This sloka emphasizes mental focus and sensory control in meditation. For Arjuna, it suggests that mental discipline, akin to meditative focus, will purify his resolve, enabling him to act selflessly in the war."
      },
      "slok13": {
        "sanskrit": "समं कायशिरोग्रीवं धारयन्नचलं स्थिरः। संनादति दिशश्चैव न च स्मरति संनादति।।6.13।।",
        "transliteration": "samaṁ kāya-śiro-grīvaṁ dhārayann acalaṁ sthiraḥ, saṁnādati diśaś caiva na ca smarati saṁnādati",
        "meaning": "Holding the body, head, and neck erect, steady, and still, gazing at the tip of the nose, not looking around.",
        "explanation": "Krishna details the meditative posture: keeping the body, head, and neck aligned and motionless, with the gaze fixed on the nose tip to avoid distractions. This sloka provides specific physical instructions for meditation, promoting stability and focus. For Arjuna, it implies that physical and mental steadiness are crucial for maintaining resolve in battle, paralleling the discipline of a Yogi."
      },
      "slok14": {
        "sanskrit": "प्रशान्तात्मा विगतभीर्ब्रह्मचारिव्रते स्थितः। मनः संनादति मां च युञ्जन्नेवं सदात्मनि।।6.14।।",
        "transliteration": "praśāntātmā vigata-bhīr brahmacāri-vrate sthitaḥ, manaḥ saṁnādati māṁ ca yuñjann evaṁ sadātmani",
        "meaning": "With a tranquil soul, fearless, steadfast in the vow of celibacy, controlling the mind, meditating on Me, thus always absorbed in the self.",
        "explanation": "Krishna describes the Yogi’s mental state during meditation: calm, fearless, committed to celibacy (self-control), with a controlled mind focused on Krishna (the divine). This sloka emphasizes the spiritual attitude for meditation. For Arjuna, it suggests that cultivating inner peace and divine focus through disciplined practice will strengthen his resolve to face the war fearlessly."
      },
      "slok15": {
        "sanskrit": "युञ्जन्नेवं सदात्मानं योगी नियतमानसः। शान्तिं निर्वाणपरमां मत्संस्थामधिगच्छति।।6.15।।",
        "transliteration": "yuñjann evaṁ sadātmānaṁ yogī niyata-mānasaḥ, śāntiṁ nirvāṇa-paramāṁ mat-saṁsthām adhigacchati",
        "meaning": "Thus, always engaging the self, the Yogi with a disciplined mind attains supreme peace, the ultimate liberation, residing in Me.",
        "explanation": "Krishna promises that a Yogi who consistently practices meditation with a controlled mind achieves supreme peace and liberation, merging with the divine. This sloka highlights the ultimate goal of Dhyana Yoga. For Arjuna, it assures that disciplined practice, even amidst his warrior duties, will lead to spiritual peace, encouraging him to integrate meditation into his life."
      },
      "slok16": {
        "sanskrit": "नात्यश्नतस्तु योगोऽस्ति न चैकान्तमनश्नतः। न चातिस्वप्नशीलस्य जाग्रतो नैव चार्जुन।।6.16।।",
        "transliteration": "nātyaśnataḥ tu yogo ’sti na caikāntam anaśnataḥ, na cāti-svapna-śīlasya jāgrato naiva cārjuna",
        "meaning": "Yoga is not for one who eats too much or too little, nor for one who sleeps too much or stays awake too long, O Arjuna.",
        "explanation": "Krishna stresses moderation in lifestyle for successful Yoga, advising against extremes in eating or sleeping. This sloka introduces the principle of balance in physical habits to support meditation. For Arjuna, it suggests that maintaining a balanced lifestyle will enhance his mental clarity and discipline, enabling him to perform his warrior duties effectively while pursuing spiritual growth."
      },
      "slok17": {
        "sanskrit": "युक्ताहारविहारस्य युक्तचेष्टस्य कर्मसु। युक्तस्वप्नावबोधस्य योगो भवति दुःखहा।।6.17।।",
        "transliteration": "yuktāhāra-vihārasya yukta-ceṣṭasya karmasu, yukta-svapnāvabodhasya yogo bhavati duḥkha-hā",
        "meaning": "For one who is moderate in eating and recreation, disciplined in actions, and balanced in sleep and wakefulness, Yoga becomes the destroyer of suffering.",
        "explanation": "Krishna explains that a balanced lifestyle—moderate eating, recreation, disciplined action, and regulated sleep—enables Yoga to eliminate suffering. This sloka emphasizes holistic discipline as a foundation for spiritual practice. For Arjuna, it implies that adopting moderation in his warrior life will support mental stability, helping him overcome the emotional turmoil of war through Yoga."
      },
      "slok18": {
        "sanskrit": "यदा विनियतं चित्तमात्मन्येवावतिष्ठति। निःस्पृहः सर्वकामेभ्यो युक्त इत्युच्यते तदा।।6.18।।",
        "transliteration": "yadā viniyataṁ cittam ātmany evāvatiṣṭhati, niḥspṛhaḥ sarva-kāmebhyo yukta ity ucyate tadā",
        "meaning": "When the disciplined mind rests in the self alone, free from desire for all objects, then one is said to be united (yukta).",
        "explanation": "Krishna describes a Yogi whose controlled mind is absorbed in the self, free from material desires, as truly united in Yoga. This sloka highlights the meditative state of self-absorption. For Arjuna, it suggests that cultivating a focused, desireless mind through meditation will enable him to act in the war with spiritual clarity, unattached to outcomes."
      },
      "slok19": {
        "sanskrit": "यथा दीपो निवातस्थो नेङ्गति सोपमा स्मृता। योगिनो यतचित्तस्य युञ्जतो योगमात्मनः।।6.19।।",
        "transliteration": "yathā dīpo nivāta-stho neṅgati sopamā smṛtā, yogino yata-cittasya yuñjato yogam ātmanaḥ",
        "meaning": "As a lamp in a windless place does not flicker, so is the disciplined mind of a Yogi practicing meditation on the self.",
        "explanation": "Krishna uses the metaphor of a steady lamp in a windless place to describe the unwavering mind of a meditating Yogi. This sloka vividly illustrates the calm focus achieved through Dhyana Yoga. For Arjuna, it implies that a steady mind, cultivated through meditation, will help him maintain composure in the chaotic battlefield, aligning his actions with spiritual purpose."
      },
      "slok20": {
        "sanskrit": "यत्रोपरमते चित्तं निरुद्धं योगसेवया। यत्र चैवात्मनात्मानं पश्यन्नात्मनि तुष्यति।।6.20।।",
        "transliteration": "yatroparamate cittaṁ niruddhaṁ yoga-sevayā, yatra caivātmanātmānaṁ paśyann ātmani tuṣyati",
        "meaning": "Where the mind, restrained by the practice of Yoga, ceases to wander, and where, seeing the self by the self, one is satisfied in the self.",
        "explanation": "Krishna describes the meditative state where the controlled mind becomes still through Yoga, and the Yogi, perceiving the self, finds contentment within. This sloka highlights the inner joy of self-realization. For Arjuna, it suggests that meditation can lead to inner satisfaction, enabling him to face external conflicts with a fulfilled and peaceful mind."
      },
      "slok21": {
        "sanskrit": "सुखमात्यन्तिकं यत्तद् बुद्धिग्राह्यमतीन्द्रियम्। वेत्ति यत्र न चैवायं स्थितश्चलति तत्त्वतः।।6.21।।",
        "transliteration": "sukham ātyantikaṁ yat tad buddhi-grāhyam atīndriyam, vetti yatra na caivāyaṁ sthitaś calati tattvataḥ",
        "meaning": "Where one knows the supreme, infinite bliss, grasped by the intellect, beyond the senses, and, established thus, does not deviate from the truth.",
        "explanation": "Krishna explains that in meditation, the Yogi experiences infinite bliss, perceived through the intellect, transcending sensory pleasures, and remains steadfast in truth. This sloka emphasizes the superior joy of spiritual realization. For Arjuna, it promises that meditative practice will reveal a higher bliss, supporting his ability to act in the war without seeking transient rewards."
      },
      "slok22": {
        "sanskrit": "यं लब्ध्वा चापरं लाभं मन्यते नाधिकं ततः। यत्र न दुःखेन संनादति न च संनादति सुखेन।।6.22।।",
        "transliteration": "yaṁ labdhvā cāparaṁ lābhaṁ manyate nādhikaṁ tataḥ, yatra na duḥkhena saṁnādati na ca saṁnādati sukhena",
        "meaning": "Having attained which, one considers no greater gain, and where, established, one is not shaken by sorrow or joy.",
        "explanation": "Krishna describes the meditative state as the ultimate gain, beyond which nothing is superior, where the Yogi remains unshaken by sorrow or joy. This sloka underscores the stability and fulfillment of self-realization. For Arjuna, it suggests that achieving this state through meditation will provide unshakeable resolve, enabling him to face the war’s challenges with equanimity."
      },
      "slok23": {
        "sanskrit": "तं विद्याद् दुःखसंयोगवियोगं योगसंज्ञितम्। स निश्चयेन योक्तव्यो योगोऽनिर्विण्णचेतसा।।6.23।।",
        "transliteration": "taṁ vidyād duḥkha-saṁyoga-viyogaṁ yoga-saṁjñitam, sa niścayena yoktavyo yogo ’nirviṇṇa-cetasā",
        "meaning": "Know that Yoga as the state of severance from contact with suffering. It must be practiced with determination and an undaunted mind.",
        "explanation": "Krishna defines Yoga as liberation from suffering, achievable through resolute and unwavering practice. This sloka emphasizes perseverance in meditation. For Arjuna, it encourages steadfast effort in cultivating mental discipline, assuring him that persistent practice, even amidst war’s turmoil, will lead to freedom from emotional suffering and spiritual success."
      },
      "slok24": {
        "sanskrit": "सङ्कल्पप्रभवान्कामांस्त्यक्त्वा सर्वानशेषतः। मनसैवेन्द्रियग्रामं विनियस्य समन्ततः।।6.24।।",
        "transliteration": "saṅkalpa-prabhavān kāmāṁs tyaktvā sarvān aśeṣataḥ, manasaivendriya-grāmaṁ viniyamya samantataḥ",
        "meaning": "Abandoning all desires born of mental resolves completely, restraining the senses with the mind from all sides.",
        "explanation": "Krishna instructs the Yogi to renounce all desires arising from mental intentions and control the senses through the mind. This sloka emphasizes mental discipline in meditation, crucial for detaching from sensory distractions. For Arjuna, it suggests that controlling desires and senses will help him focus on his duties, ensuring his actions in battle are pure and spiritually aligned."
      },
      "slok25": {
        "sanskrit": "शनैः शनैरुपरमेद् बुद्ध्या धृतिगृहीतया। आत्मसंस्थं मनः कृत्वा न किञ्चिदपि चिन्तयेत्।।6.25।।",
        "transliteration": "śanaiḥ śanair uparamed buddhyā dhṛti-gṛhītayā, ātma-saṁsthaṁ manaḥ kṛtvā na kiñcid api cintayet",
        "meaning": "Gradually withdrawing with the intellect held by firm resolve, fixing the mind on the self, one should think of nothing else.",
        "explanation": "Krishna advises a gradual approach to meditation, using a resolute intellect to focus the mind on the self, avoiding all other thoughts. This sloka highlights patience and focus in meditative practice. For Arjuna, it implies that steady mental discipline, cultivated gradually, will enable him to maintain clarity and purpose in the chaotic battlefield."
      },
      "slok26": {
        "sanskrit": "यतो यतो निश्चरति मनश्चञ्चलमस्थिरम्। ततस्ततो नियम्यैतदात्मन्येव वशं नयेत्।।6.26।।",
        "transliteration": "yato yato niścarati manaś cañcalam asthiram, tatas tato niyamyaitad ātmany eva vaśaṁ nayet",
        "meaning": "Whenever the restless and unsteady mind wanders, bring it back under control, directing it to the self alone.",
        "explanation": "Krishna addresses the challenge of a wandering mind, instructing the Yogi to repeatedly redirect it to the self whenever it strays. This sloka acknowledges the mind’s restlessness and emphasizes persistent effort. For Arjuna, it offers practical advice for managing distractions and doubts, ensuring his focus remains on his spiritual and warrior duties through disciplined practice."
      },
      "slok27": {
        "sanskrit": "प्रशान्तमनसं ह्येनं योगिनं सुखमुत्तमम्। उपैति शान्तरजसं ब्रह्मभूतमकल्मषम्।।6.27।।",
        "transliteration": "praśānta-manasaṁ hy enaṁ yoginaṁ sukham uttamam, upaiti śānta-rajasaṁ brahma-bhūtam akalmaṣam",
        "meaning": "The Yogi with a tranquil mind, free from passion, purified, and established in Brahman, attains supreme happiness.",
        "explanation": "Krishna describes the reward of meditation: a Yogi with a calm mind, free from passion (rajas) and impurities, realizes Brahman and experiences supreme bliss. This sloka highlights the spiritual joy of self-realization. For Arjuna, it promises that meditative discipline will lead to inner peace, enabling him to face the war with a purified and blissful mind."
      },
      "slok28": {
        "sanskrit": "युञ्जन्नेवं सदात्मानं योगी विगतकल्मषः। सुखेन ब्रह्मसंस्पर्शमत्यन्तं सुखमश्नुते।।6.28।।",
        "transliteration": "yuñjann evaṁ sadātmānaṁ yogī vigata-kalmaṣaḥ, sukhena brahma-saṁsparśam atyantaṁ sukham aśnute",
        "meaning": "Thus, constantly engaging the self, the Yogi, free from impurities, easily attains the infinite bliss of contact with Brahman.",
        "explanation": "Krishna reiterates that a purified Yogi, through consistent meditation, effortlessly experiences the boundless joy of union with Brahman. This sloka emphasizes the ease and joy of spiritual attainment through practice. For Arjuna, it assures that dedicated meditative effort will yield profound happiness, supporting his ability to perform duties with a liberated mind."
      },
      "slok29": {
        "sanskrit": "सर्वं विश्वेन संनादति सर्वं सर्वं च संनादति। आत्मन्येव च सर्वं यः पश्यति स सर्वं समदर्शनः।।6.29।।",
        "transliteration": "sarvaṁ viśvena saṁnādati sarvaṁ sarvaṁ ca saṁnādati, ātmany eva ca sarvaṁ yaḥ paśyati sa sarvaṁ sama-darśanaḥ",
        "meaning": "One who sees the self in all beings and all beings in the self, with equal vision everywhere, sees truly.",
        "explanation": "Krishna describes the Yogi’s universal vision, perceiving the same self in all beings and all beings within the self, embodying equality. This sloka highlights the spiritual unity achieved through meditation. For Arjuna, it suggests that this vision of oneness will enable him to treat allies and enemies impartially in battle, aligning his actions with divine truth."
      },
      "slok30": {
        "sanskrit": "यो मां पश्यति सर्वं च मयि सर्वं च पश्यति। तस्याहं न प्रणश्यामि स च मे न प्रणश्यति।।6.30।।",
        "transliteration": "yo māṁ paśyati sarvaṁ ca mayi sarvaṁ ca paśyati, tasyāhaṁ na praṇaśyāmi sa ca me na praṇaśyati",
        "meaning": "One who sees Me in all and all in Me, I am never lost to him, and he is never lost to Me.",
        "explanation": "Krishna assures that a Yogi who perceives Krishna (the divine) in all beings and all beings in Krishna maintains an eternal connection with the divine. This sloka emphasizes the intimate bond of devotion and realization. For Arjuna, it promises that meditating on Krishna will ensure divine guidance, strengthening his resolve to act in the war with spiritual assurance."
      },
      "slok31": {
        "sanskrit": "सर्वभूतस्थितं यो मां भजत्येकत्वमास्थितः। सर्वथा वर्तमानोऽपि स योगी मयि वर्तति।।6.31।।",
        "transliteration": "sarva-bhūta-sthitaṁ yo māṁ bhajaty ekatvam āsthitaḥ, sarvathā vartamāno ’pi sa yogī mayi vartati",
        "meaning": "The Yogi who worships Me, dwelling in all beings, established in unity, abides in Me, however he may act.",
        "explanation": "Krishna states that a Yogi who worships him as present in all beings, rooted in oneness, remains connected to Krishna regardless of external actions. This sloka integrates devotion with universal vision. For Arjuna, it suggests that performing his warrior duties with a sense of divine unity will keep him spiritually anchored, ensuring liberation through action."
      },
      "slok32": {
        "sanskrit": "आत्मौपम्येन सर्वं समं पश्यति योऽर्जुन। सुखं वा यदि वा दुःखं स योगी परमो मतः।।6.32।।",
        "transliteration": "ātmaupamyena sarvaṁ samaṁ paśyati yo ’rjuna, sukhaṁ vā yadi vā duḥkhaṁ sa yogī paramo mataḥ",
        "meaning": "One who, by comparison to oneself, sees pleasure and pain equally in all, O Arjuna, that Yogi is considered the highest.",
        "explanation": "Krishna praises the Yogi who empathizes with others’ joys and sorrows as if they were their own, maintaining equality in all experiences. This sloka highlights the compassionate equality of a supreme Yogi. For Arjuna, it encourages cultivating empathy and impartiality, enabling him to approach the war with a balanced perspective, free from personal attachment."
      },
      "slok33": {
        "sanskrit": "अर्जुन उवाच। योऽयं योगस्त्वया प्रोक्तः साम्येन मधुसूदन। एतस्याहं न पश्यामि चञ्चलत्वात्स्थितिं स्थिराम्।।6.33।।",
        "transliteration": "arjuna uvāca yo ’yaṁ yogas tvayā proktaḥ sāmyena madhusūdana, etasyāhaṁ na paśyāmi cañcalatvāt sthitiṁ sthirām",
        "meaning": "Arjuna said: This Yoga of equanimity you have described, O Madhusudana, I do not see its steady practice due to the mind’s restlessness.",
        "explanation": "Arjuna, addressing Krishna as Madhusudana, expresses doubt about maintaining the steady practice of Yoga due to the mind’s inherent restlessness. This sloka introduces Arjuna’s concern about the practicality of meditation, reflecting a common human struggle. It sets the stage for Krishna’s response, reassuring Arjuna about overcoming mental challenges in his spiritual and warrior journey."
      },
      "slok34": {
        "sanskrit": "चञ्चलं हि मनः कृष्ण प्रमाथि बलवद् दृढम्। तस्याहं निग्रहं मन्ये वायोरिव सुदुष्करम्।।6.34।।",
        "transliteration": "cañcalaṁ hi manaḥ kṛṣṇa pramāthi balavad dṛḍham, tasyāhaṁ nigrahaṁ manye vāyor iva suduṣkaram",
        "meaning": "The mind is restless, O Krishna, turbulent, strong, and obstinate. I think controlling it is as difficult as controlling the wind.",
        "explanation": "Arjuna elaborates his concern, describing the mind as restless, disruptive, powerful, and stubborn, comparing its control to taming the wind. This sloka vividly captures the universal challenge of mental discipline, resonating with Arjuna’s own emotional turmoil. It prompts Krishna to offer practical solutions, relevant to Arjuna’s need for focus in both meditation and battle."
      },
      "slok35": {
        "sanskrit": "श्रीभगवानुवाच। असंशयं महाबाहो मनो दुर्निग्रहं चलम्। अभ्यासेन तु कौन्तेय वैराग्येण च गृह्यते।।6.35।।",
        "transliteration": "śrī bhagavān uvāca asaṁśayaṁ mahā-bāho mano durnigrahaṁ calam, abhyāsena tu kaunteya vairāgyena ca gṛhyate",
        "meaning": "The Supreme Lord said: Undoubtedly, O mighty-armed, the mind is restless and hard to control, but through practice and detachment, O son of Kunti, it can be restrained.",
        "explanation": "Krishna acknowledges the mind’s restlessness but assures Arjuna that it can be controlled through consistent practice (abhyasa) and detachment (vairagya). This sloka offers a practical solution to Arjuna’s concern, emphasizing perseverance. For Arjuna, it suggests that disciplined practice and detachment will help him master his mind, enabling focused action in the war and progress in meditation."
      },
      "slok36": {
        "sanskrit": "असंनादति योगो दुष्प्रापः संनादति मे मतिः। संनादति च योगस्तु यतता शक्य आवति।।6.36।।",
        "transliteration": "asaṁnādati yogo duṣprāpaḥ saṁnādati me matiḥ, saṁnādati ca yogas tu yatatā śakya āvati",
        "meaning": "Yoga is difficult to attain for one with an uncontrolled mind, but it is possible for one who strives with a disciplined mind, in my opinion.",
        "explanation": "Krishna affirms that Yoga is challenging for an undisciplined mind but achievable through determined effort and self-control. This sloka reassures Arjuna that success in meditation is within reach with proper striving. It encourages Arjuna to persist in disciplining his mind, ensuring he can apply this focus to both his spiritual practice and warrior responsibilities."
      },
      "slok37": {
        "sanskrit": "अर्जुन उवाच। अयतिः श्रद्धयोपेतो योगाच्चलितमानसः। अप्राप्य योगसंसिद्धिं कां गतिं कृष्ण गच्छति।।6.37।।",
        "transliteration": "arjuna uvāca ayatiḥ śraddhayopeto yogāc calita-mānasaḥ, aprāpya yoga-saṁsiddhiṁ kāṁ gatiṁ kṛṣṇa gacchati",
        "meaning": "Arjuna said: O Krishna, what is the fate of one who, with faith, strives for Yoga but, with a wandering mind, fails to attain perfection in Yoga?",
        "explanation": "Arjuna raises a concern about the fate of a sincere but unsuccessful Yogi whose mind strays, failing to achieve yogic perfection. This sloka reflects Arjuna’s fear of spiritual failure, a practical worry for practitioners. It prompts Krishna to address the consequences of incomplete efforts, relevant to Arjuna’s doubts about succeeding in meditation while engaged in war."
      },
      "slok38": {
        "sanskrit": "कच्चिन्नोभयविभ्रष्टश्छिन्नाभ्रमिव नश्यति। अप्रतिष्ठो महाबाहो विमूढो ब्रह्मणः पथि।।6.38।।",
        "transliteration": "kaccin nobhaya-vibhraṣṭaś chinnābhram iva naśyati, apratiṣṭho mahā-bāho vimūḍho brahmaṇaḥ pathi",
        "meaning": "Does such a person, O mighty-armed, failing in both (worldly and spiritual paths), perish like a scattered cloud, deluded on the path to Brahman, without support?",
        "explanation": "Arjuna elaborates his concern, fearing that a failed Yogi, unsuccessful in both spiritual and material pursuits, might be lost like a fragmented cloud, without foundation on the path to Brahman. This sloka vividly expresses Arjuna’s anxiety about spiritual insecurity, seeking reassurance from Krishna about the fate of partial efforts, relevant to his own uncertainties in balancing duty and spirituality."
      },
      "slok39": {
        "sanskrit": "एतन्मे संशयं कृष्ण छेत्तुमर्हस्यशेषतः। त्वदन्यः संशयस्यास्य छेत्ता न ह्युपपद्यति।।6.39।।",
        "transliteration": "etan me saṁśayaṁ kṛṣṇa chettum arhasy aśeṣataḥ, tvad-anyaḥ saṁśayasyāsya chettā na hy upapadyati",
        "meaning": "O Krishna, please dispel this doubt of mine completely, for none other than you can resolve this doubt.",
        "explanation": "Arjuna requests Krishna to fully clarify his doubt about the fate of an unsuccessful Yogi, recognizing Krishna as the ultimate authority. This sloka underscores Arjuna’s trust in Krishna’s wisdom and his urgency for clarity. It sets the stage for Krishna’s reassuring response, addressing Arjuna’s concerns about spiritual failure while facing the challenges of war."
      },
      "slok40": {
        "sanskrit": "श्रीभगवानुवाच। पार्थ नैवेह नामुत्र विनाशस्तस्य विद्यते। न हि कल्याणकृत्कश्चिद् दुर्गतिं तात गच्छति।।6.40।।",
        "transliteration": "śrī bhagavān uvāca pārtha naiveha nāmutra vināśas tasya vidyate, na hi kalyāṇa-kṛt kaścid durgatiṁ tāta gacchati",
        "meaning": "The Supreme Lord said: O Partha, there is no destruction for such a person, either in this world or the next. Indeed, one who strives for goodness never comes to ruin, dear one.",
        "explanation": "Krishna reassures Arjuna that a sincere spiritual aspirant faces no destruction in this life or the afterlife, as virtuous efforts never lead to ruin. This sloka offers hope, dispelling Arjuna’s fear of failure. For Arjuna, it assures that his efforts in Yoga, even if incomplete, will yield positive outcomes, encouraging him to pursue meditation alongside his warrior duties."
      },
      "slok41": {
        "sanskrit": "प्राप्य पुण्यकृतां लोकानुषित्वा शाश्वतीः समाः। शुचीनां श्रीमतां गेहे योगभ्रष्टोऽभिजायते।।6.41।।",
        "transliteration": "prāpya puṇya-kṛtāṁ lokān uṣitvā śāśvatīḥ samāḥ, śucīnāṁ śrīmatāṁ gehe yoga-bhraṣṭo ’bhijāyate",
        "meaning": "Having attained the worlds of the virtuous and dwelt there for many years, the fallen Yogi is born in a pure and prosperous family.",
        "explanation": "Krishna explains that a Yogi who fails to achieve perfection enjoys heavenly realms due to their virtuous deeds and is later reborn in a pure, prosperous family. This sloka assures spiritual progress despite setbacks. For Arjuna, it suggests that his sincere efforts in Yoga will ensure favorable future conditions, motivating him to persevere in both spiritual practice and his warrior role."
      },
      "slok42": {
        "sanskrit": "अथवा योगिनामेव कुले भवति धीमताम्। एतद्धि दुर्लभतरं लोके जन्म यदीदृशम्।।6.42।।",
        "transliteration": "athavā yoginām eva kule bhavati dhīmatām, etad dhi durlabhataraṁ loke janma yad īdṛśam",
        "meaning": "Or else, they are born in a family of wise Yogis. Indeed, such a birth is very rare in this world.",
        "explanation": "Krishna adds that a fallen Yogi may be reborn in a family of enlightened Yogis, a rarer and more auspicious birth. This sloka emphasizes the exceptional spiritual opportunity such a rebirth offers. For Arjuna, it reinforces the value of his efforts, assuring that any spiritual striving will lead to advantageous circumstances, supporting his commitment to Yoga and duty."
      },
      "slok43": {
        "sanskrit": "तत्र तं बुद्धिसंयोगं लभते पौर्वदैहिकम्। यतति च ततो भूयः संसिद्धौ कुरुनन्दन।।6.43।।",
        "transliteration": "tatra taṁ buddhi-saṁyogaṁ labhate paurva-daihikam, yatati ca tato bhūyaḥ saṁsiddhau kuru-nandana",
        "meaning": "There, they regain the spiritual insight from their previous life and strive further toward perfection, O joy of the Kurus.",
        "explanation": "Krishna explains that in such a birth, the Yogi recovers their past spiritual wisdom and continues striving for perfection. This sloka highlights the continuity of spiritual progress across lifetimes. For Arjuna, it offers assurance that his efforts in Yoga will carry forward, encouraging him to pursue meditation and duty with confidence, knowing his progress is secure."
      },
      "slok44": {
        "sanskrit": "पूर्वाभ्यासेन तेनैव ह्रियते ह्यवशोऽपि सः। जिज्ञासुरपि योगस्य शब्दब्रह्मातिवर्तते।।6.44।।",
        "transliteration": "pūrvābhyāsena tenaiva hriyate hy avaśo ’pi saḥ, jijñāsur api yogasya śabda-brahmātivartate",
        "meaning": "By that previous practice, they are irresistibly drawn to Yoga. Even a seeker of Yoga transcends the results of Vedic rituals.",
        "explanation": "Krishna states that past spiritual practice propels the Yogi toward Yoga involuntarily, and even a curious seeker surpasses the limited fruits of Vedic rituals. This sloka underscores the power of prior efforts and Yoga’s superiority. For Arjuna, it assures that his spiritual inclinations will guide him, elevating his actions in war beyond mere ritualistic gains."
      },
      "slok45": {
        "sanskrit": "प्रयत्नाद्यतमानस्तु योगी संशुद्धकिल्बिषः। अनेकजन्मसंसिद्धस्ततो याति परां गतिम्।।6.45।।",
        "transliteration": "prayatnād yatamānas tu yogī saṁśuddha-kilbiṣaḥ, aneka-janma-saṁsiddhas tato yāti parāṁ gatim",
        "meaning": "But the Yogi, striving with effort, purified of sins, perfected over many births, attains the supreme goal.",
        "explanation": "Krishna assures that a dedicated Yogi, purified through persistent effort over multiple lifetimes, ultimately achieves the supreme goal (liberation). This sloka emphasizes the cumulative effect of spiritual striving. For Arjuna, it encourages perseverance in Yoga, assuring that his efforts, even amidst war, will lead to liberation over time, reinforcing his commitment."
      },
      "slok46": {
        "sanskrit": "तपस्विभ्योऽधिको योगी ज्ञानिभ्योऽपि मतोऽधिकः। कर्मिभ्यश्चाधिको योगी तस्माद्योगी भवार्जुन।।6.46।।",
        "transliteration": "tapasvibhyo ’dhiko yogī jñānibhyo ’pi mato ’dhikaḥ, karmibhyaś cādhiko yogī tasmād yogī bhavārjuna",
        "meaning": "The Yogi is superior to ascetics, the knowledgeable, and performers of action. Therefore, be a Yogi, O Arjuna.",
        "explanation": "Krishna declares the Yogi superior to ascetics (tapasvis), scholars (jnanis), and ritualistic performers (karmis), urging Arjuna to become a Yogi. This sloka elevates Dhyana Yoga as the highest path, integrating action, knowledge, and meditation. For Arjuna, it inspires him to embrace Yoga, ensuring his warrior duties are performed with the spiritual depth of a Yogi."
      },
      "slok47": {
        "sanskrit": "योगिनामपि सर्वेषां मद्गतेनान्तरात्मना। श्रद्धावान्भजति यो मां स मे युक्ततमो मतः।।6.47।।",
        "transliteration": "yoginām api sarveṣāṁ mad-gatenāntar-ātmanā, śraddhāvān bhajati yo māṁ sa me yuktatamo mataḥ",
        "meaning": "Among all Yogis, the one who worships Me with faith, with inner self absorbed in Me, is considered by Me the most united.",
        "explanation": "Krishna concludes Chapter 6 by declaring that the highest Yogi is one who, with faith and inner devotion, worships Krishna, fully absorbed in him. This sloka integrates Bhakti (devotion) with Dhyana Yoga, emphasizing Krishna as the ultimate focus. For Arjuna, it encourages dedicating his actions and meditative practice to Krishna, ensuring his warrior duties lead to the highest spiritual union and liberation."
      }
    }
  }
]
