[
  {
    "chapter5": {
      "title": "Karma Sannyasa Yoga (The Yoga of Renunciation of Action)",
      "description": "In Chapter 5, Arjuna seeks clarity on whether renunciation of action (sannyasa) or disciplined action (Karma Yoga) is superior. Krishna explains that both paths lead to liberation, but Karma Yoga is more practical for most. He elaborates on performing actions with detachment, the nature of the self-realized soul, and the vision of equality, guiding Arjuna toward spiritual freedom through selfless action and knowledge.",
      "total_verses": 29,
      "slok1": {
        "sanskrit": "अर्जुन उवाच। सन्न्यासं कर्मणां कृष्ण पुनर्योगं च शंससि। यच्छ्रेय एतयोरेकं तन्मे ब्रूहि सुनिश्चितम्।।5.1।।",
        "transliteration": "arjuna uvāca sannyāsaṁ karmaṇāṁ kṛṣṇa punar yogaṁ ca śaṁsasi, yac chreya etayor ekaṁ tan me brūhi suniścitam",
        "meaning": "Arjuna said: O Krishna, you praise renunciation of actions and again the Yoga of action. Tell me definitively which one is better.",
        "explanation": "Arjuna, confused by Krishna’s earlier teachings on renunciation (sannyasa) and Karma Yoga, seeks a clear answer on which path is superior. This sloka sets the stage for Chapter 5, where Krishna will clarify the relationship between renunciation and disciplined action. It reflects Arjuna’s desire for decisive guidance, prompting Krishna to explain how both paths lead to liberation, with Karma Yoga being more accessible for him as a warrior."
      },
      "slok2": {
        "sanskrit": "श्रीभगवानुवाच। सन्न्यासः कर्मयोगश्च निःश्रेयसकरावुभौ। तयोस्तु कर्मसन्न्यासात्कर्मयोगो विशिष्यते।।5.2।।",
        "transliteration": "śrī bhagavān uvāca sannyāsaḥ karma-yogaś ca niḥśreyasa-karāv ubhau, tayos tu karma-sannyāsāt karma-yogo viśiṣyate",
        "meaning": "The Supreme Lord said: Renunciation and Karma Yoga both lead to liberation, but of the two, Karma Yoga is superior to the renunciation of action.",
        "explanation": "Krishna responds that both renunciation (sannyasa) and Karma Yoga lead to liberation (niḥśreyasa), as they purify the mind. However, he emphasizes that Karma Yoga, the path of selfless action, is more practical and effective than complete renunciation of action, especially for someone like Arjuna, who is engaged in worldly duties. This sloka establishes Karma Yoga’s preference, setting the tone for Krishna’s explanation of its practicality and alignment with spiritual growth."
      },
      "slok3": {
        "sanskrit": "ज्ञेयः स नित्यसन्न्यासी यो न द्वेष्टि न काङ्क्षति। निर्द्वन्द्वो हि महाबाहो सुखं बन्धात्प्रमुच्यते।।5.3।।",
        "transliteration": "jñeyaḥ sa nitya-sannyāsī yo na dveṣṭi na kāṅkṣati, nirdvandvo hi mahā-bāho sukhaṁ bandhāt pramucyate",
        "meaning": "Know that one to be a true renunciant who neither hates nor desires, O mighty-armed. Free from dualities, such a person is easily liberated from bondage.",
        "explanation": "Krishna redefines renunciation: a true sannyasi is not just one who abandons physical actions but one who is free from aversion and desire, transcending dualities like pleasure and pain. Such a person attains liberation effortlessly. This sloka shifts the focus from external renunciation to internal detachment, guiding Arjuna to practice Karma Yoga with a balanced mind to achieve freedom from material bondage."
      },
      "slok4": {
        "sanskrit": "साङ्ख्ययोगौ पृथग्बालाः प्रवदन्ति न पण्डिताः। एकमप्यास्थितः सम्यगुभयोर्विन्दति फलम्।।5.4।।",
        "transliteration": "sāṅkhya-yogau pṛthag bālāḥ pravadanti na paṇḍitāḥ, ekam apy āsthitaḥ samyag ubhayor vindati phalam",
        "meaning": "Only the ignorant speak of Sankhya (renunciation) and Yoga (action) as distinct, not the wise. One who follows either path properly attains the fruit of both.",
        "explanation": "Krishna clarifies that only the uninformed see Sankhya (the path of knowledge and renunciation) and Yoga (Karma Yoga) as separate. The wise understand that both lead to the same goal—liberation—when practiced correctly. This sloka emphasizes the unity of spiritual paths, reassuring Arjuna that Karma Yoga, properly executed, yields the same liberation as renunciation, encouraging him to act selflessly."
      },
      "slok5": {
        "sanskrit": "यत्साङ्ख्यैः प्राप्यते स्थानं तद्योगैरपि गम्यते। एकं साङ्ख्यं च योगं च यः पश्यति स पश्यति।।5.5।।",
        "transliteration": "yat sāṅkhyaiḥ prāpyate sthānaṁ tad yogair api gamyate, ekaṁ sāṅkhyaṁ ca yogaṁ ca yaḥ paśyati sa paśyati",
        "meaning": "The state attained by Sankhya is also reached by Yoga. One who sees Sankhya and Yoga as one truly sees.",
        "explanation": "Krishna reiterates that the spiritual goal (liberation) achieved through Sankhya (knowledge and renunciation) is identical to that attained through Karma Yoga. True wisdom lies in recognizing their equivalence. This sloka reinforces the non-duality of these paths, urging Arjuna to embrace Karma Yoga with the understanding that his actions, performed with wisdom, lead to the same liberation as renunciation."
      },
      "slok6": {
        "sanskrit": "सन्न्यासस्तु महाबाहो दुःखमाप्तुमयोगतः। योगयुक्तो मुनिर्ब्रह्म नचिरेणाधिगच्छति।।5.6।।",
        "transliteration": "sannyāsas tu mahā-bāho duḥkham āptum ayogataḥ, yoga-yukto munir brahma nacireṇādhigacchati",
        "meaning": "Renunciation, O mighty-armed, is difficult to attain without Yoga. The sage engaged in Yoga quickly attains Brahman.",
        "explanation": "Krishna explains that true renunciation is challenging without the discipline of Karma Yoga, as it requires mental purification through action. A sage practicing Yoga attains Brahman (the ultimate reality) swiftly. This sloka highlights Karma Yoga’s role as a preparatory step for renunciation, encouraging Arjuna to pursue disciplined action to achieve spiritual realization efficiently."
      },
      "slok7": {
        "sanskrit": "योगयुक्तो विशुद्धात्मा विजितात्मा जितेन्द्रियः। सर्वभूतात्मभूतात्मा कुर्वन्नपि न लिप्यते।।5.7।।",
        "transliteration": "yoga-yukto viśuddhātmā vijitātmā jitendriyaḥ, sarva-bhūtātma-bhūtātmā kurvann api na lipyate",
        "meaning": "One who is engaged in Yoga, pure in soul, self-controlled, with conquered senses, seeing the self in all beings, is not tainted though acting.",
        "explanation": "Krishna describes a Karma Yogi who is purified, self-disciplined, and has mastered the senses, perceiving the same self in all beings. Such a person remains untainted by actions, as they are performed with spiritual awareness. This sloka emphasizes the qualities of a liberated soul, guiding Arjuna to act with purity and universal vision, ensuring his warrior duties do not bind him karmically."
      },
      "slok8": {
        "sanskrit": "नैव किञ्चित्करोमीति युक्तो मन्येत तत्त्ववित्। पश्यञ्छृण्वन्स्पृशञ्जिघ्रन्नश्नन्गच्छन्स्वपञ्छ्वसन्।।5.8।।",
        "transliteration": "naiva kiñcit karomīti yukto manyeta tattva-vit, paśyañ chṛṇvan spṛśañ jighrann aśnan gacchan svapan śvasan",
        "meaning": "A Yogi, knowing the truth, thinks, ‘I do nothing at all,’ while seeing, hearing, touching, smelling, eating, walking, sleeping, or breathing.",
        "explanation": "Krishna explains that a self-realized Yogi, aware of the soul’s non-doership, perceives themselves as detached from bodily actions like seeing or hearing, which are functions of the senses. This sloka introduces the concept of non-doership in Karma Yoga, urging Arjuna to perform actions with the understanding that the soul remains uninvolved, freeing him from karmic consequences in battle."
      },
      "slok9": {
        "sanskrit": "प्रलपन्विसृजन्गृह्णन्नुन्मिषन्निमिषन्नपि। इन्द्रियाणीन्द्रियार्थेषु वर्तन्त इति धारयन्।।5.9।।",
        "transliteration": "pralapan visṛjan gṛhṇann unmiṣan nimiṣann api, indriyāṇīndriyārtheṣu vartanta iti dhārayan",
        "meaning": "Speaking, excreting, grasping, opening, or closing the eyes—knowing that the senses operate among sense objects, the Yogi remains detached.",
        "explanation": "Continuing from the previous sloka, Krishna elaborates that a Yogi understands that actions like speaking or blinking are merely interactions of senses with their objects, not the soul’s doing. This awareness of detachment allows the Yogi to act without attachment. This sloka reinforces non-doership, guiding Arjuna to perform his warrior duties with the realization that his true self remains unaffected, ensuring liberation."
      },
      "slok10": {
        "sanskrit": "ब्रह्मण्याधाय कर्माणि सङ्गं त्यक्त्वा करोति यः। लिप्यते न स पापेन पद्मपत्रमिवाम्भसा।।5.10।।",
        "transliteration": "brahmaṇy ādhāya karmāṇi saṅgaṁ tyaktvā karoti yaḥ, lipyate na sa pāpena padma-patram ivāmbhasā",
        "meaning": "One who dedicates actions to Brahman, abandoning attachment, is not tainted by sin, like a lotus leaf untouched by water.",
        "explanation": "Krishna uses the metaphor of a lotus leaf, which remains dry despite being in water, to describe a Karma Yogi who offers actions to Brahman (the divine) without attachment. Such a person remains untainted by sin or karma. This sloka emphasizes selfless dedication, urging Arjuna to fight as an offering to the divine, ensuring his actions do not bind him spiritually."
      },
      "slok11": {
        "sanskrit": "कायेन मनसा बुद्ध्या केवलैरिन्द्रियैरपि। योगिनः कर्म कुर्वन्ति सङ्गं त्यक्त्वात्मशुद्धये।।5.11।।",
        "transliteration": "kāyena manasā buddhyā kevalair indriyair api, yoginaḥ karma kurvanti saṅgaṁ tyaktvātma-śuddhaye",
        "meaning": "Yogis perform actions with body, mind, intellect, and senses, without attachment, for the purification of the self.",
        "explanation": "Krishna explains that Yogis engage in actions using their physical and mental faculties but remain detached, aiming to purify the soul. This sloka highlights the purpose of Karma Yoga—self-purification through selfless action. It encourages Arjuna to perform his warrior duties without attachment, using his faculties to cleanse his mind and progress toward liberation."
      },
      "slok12": {
        "sanskrit": "युक्तः कर्मफलं त्यक्त्वा शान्तिमाप्नोति नैष्ठिकीम्। अयुक्तः कामकारेण फले सक्तो निबध्यते।।5.12।।",
        "transliteration": "yuktaḥ karma-phalaṁ tyaktvā śāntim āpnoti naiṣṭhikīm, ayuktaḥ kāma-kāreṇa phale sakto nibadhyate",
        "meaning": "The disciplined Yogi, renouncing the fruits of action, attains lasting peace. The undisciplined, attached to results, is bound by desire-driven actions.",
        "explanation": "Krishna contrasts the outcomes of disciplined and undisciplined action: a Yogi who renounces results attains eternal peace, while one driven by desire and attached to outcomes remains bound by karma. This sloka underscores the importance of detachment in Karma Yoga, urging Arjuna to fight without craving victory, ensuring spiritual peace and freedom from bondage."
      },
      "slok13": {
        "sanskrit": "सर्वकर्माणि मनसा सन्न्यासति यः सुखी। नवद्वारे पुरे देही नैव कुर्वन्न कारयन्।।5.13।।",
        "transliteration": "sarva-karmāṇi manasā sannyāsati yaḥ sukhī, nava-dvāre pure dehī naiva kurvan na kārayan",
        "meaning": "Mentally renouncing all actions, the embodied soul, dwelling in the city of nine gates, lives happily, neither acting nor causing action.",
        "explanation": "Krishna describes the self-realized soul, residing in the body (the ‘city of nine gates,’ referring to the body’s openings), who mentally renounces all actions. Such a soul remains happy, detached from doership. This sloka emphasizes internal renunciation, guiding Arjuna to perform external duties while internally detaching from the sense of agency, aligning with the non-doership principle of Karma Yoga."
      },
      "slok14": {
        "sanskrit": "न कर्तृत्वं न कर्माणि लोकस्य सृजति प्रभुः। न कर्मफलसंयोगं स्वभावस्तु प्रवर्तति।।5.14।।",
        "transliteration": "na kartṛtvaṁ na karmāṇi lokasya sṛjati prabhuḥ, na karma-phala-saṁyogaṁ svabhāvas tu pravartati",
        "meaning": "The Lord does not create agency, actions, or their results for the world. Nature (svabhava) operates.",
        "explanation": "Krishna clarifies that the Supreme Lord does not impose doership, actions, or their consequences; these arise from prakriti (material nature) and individual tendencies (svabhava). This sloka absolves God of responsibility for human actions, emphasizing that bondage comes from nature’s interplay. It encourages Arjuna to act according to his Kshatriya nature but with spiritual awareness, avoiding attachment to outcomes."
      },
      "slok15": {
        "sanskrit": "नादत्ते कस्यचित्पापं न चैव सुकृतं विभुः। अज्ञानेनावृतं ज्ञानं तेन मुह्यन्ति जन्तवः।।5.15।।",
        "transliteration": "nādatte kasyacit pāpaṁ na caiva sukṛtaṁ vibhuḥ, ajñānenāvṛtaṁ jñānaṁ tena muhyanti jantavaḥ",
        "meaning": "The all-pervading Lord accepts neither the sins nor the good deeds of anyone. Knowledge is veiled by ignorance, causing beings to be deluded.",
        "explanation": "Krishna states that God remains impartial, neither accepting sins nor virtues, as beings’ actions are driven by ignorance, which obscures their true knowledge. This sloka highlights the role of ignorance in bondage, urging Arjuna to seek knowledge through Karma Yoga to dispel delusion, ensuring his actions in battle align with spiritual truth and do not bind him."
      },
      "slok16": {
        "sanskrit": "ज्ञानेन तु तदज्ञानं येषां नाशितमात्मनः। तेषामादित्यवज्ज्ञानं प्रकाशति तत्परम्।।5.16।।",
        "transliteration": "jñānena tu tad ajñānaṁ yeṣāṁ nāśitam ātmanaḥ, teṣām ādityavaj jñānaṁ prakāśati tat param",
        "meaning": "For those whose ignorance is destroyed by knowledge of the self, their knowledge, like the sun, reveals the Supreme.",
        "explanation": "Krishna compares knowledge to the sun, which dispels ignorance and illuminates the Supreme truth for those who realize the self. This sloka emphasizes the liberating power of self-knowledge (Jnana), encouraging Arjuna to cultivate wisdom through selfless action, enabling him to perceive the divine reality and perform his duties with clarity, free from delusion."
      },
      "slok17": {
        "sanskrit": "तद्बुद्धयस्तदात्मानस्तन्निष्ठास्तत्परायणाः। गच्छन्त्यपुनरावृत्तिं ज्ञाननिर्धूतकल्मषाः।।5.17।।",
        "transliteration": "tad-buddhayas tad-ātmānas tan-niṣṭhās tat-parāyaṇāḥ, gacchanty apunarāvṛttiṁ jñāna-nirdhūta-kalmaṣāḥ",
        "meaning": "Those whose intellects are fixed on That, whose souls are absorbed in That, who are steadfast in That, and whose ultimate goal is That, their sins washed away by knowledge, attain liberation from rebirth.",
        "explanation": "Krishna describes the state of liberated souls whose minds, selves, and devotion are fixed on the Supreme, purified by knowledge. They attain moksha, free from the cycle of birth and death. This sloka highlights the goal of Karma and Jnana Yoga, inspiring Arjuna to dedicate his actions to the divine, ensuring his spiritual progress toward liberation."
      },
      "slok18": {
        "sanskrit": "विद्याविनयसंपन्ने ब्राह्मणे गवि हस्तिनि। शुनि चैव श्वपाके च पण्डिताः समदर्शिनः।।5.18।।",
        "transliteration": "vidyā-vinaya-sampanne brāhmaṇe gavi hastini, śuni caiva śvapāke ca paṇḍitāḥ sama-darśinaḥ",
        "meaning": "The wise see the same (divine self) in a learned and humble Brahmin, a cow, an elephant, a dog, and an outcaste.",
        "explanation": "Krishna explains that a truly wise person perceives the same divine soul in all beings, regardless of external differences (e.g., a Brahmin or an outcaste). This sloka emphasizes the vision of equality, a hallmark of self-realization, urging Arjuna to cultivate this universal perspective through Karma Yoga, ensuring his actions are free from bias and aligned with spiritual truth."
      },
      "slok19": {
        "sanskrit": "इहैव तैर्जितः सर्गो येषां साम्ये स्थितं मनः। निर्दोषं हि समं ब्रह्म तस्माद्ब्रह्मणि ते स्थिताः।।5.19।।",
        "transliteration": "ihaiva tair jitaḥ sargo yeṣāṁ sāmye sthitaṁ manaḥ, nirdoṣaṁ hi samaṁ brahma tasmād brahmaṇi te sthitāḥ",
        "meaning": "Those whose minds are established in equality conquer the cycle of birth here itself. Brahman is flawless and equal; thus, they are established in Brahman.",
        "explanation": "Krishna states that those who maintain mental equanimity overcome samsara (the cycle of birth and death) in this life. Since Brahman is impartial and pure, such souls reside in Brahman. This sloka underscores the power of equality and self-realization, encouraging Arjuna to act with a balanced mind, ensuring his warrior duties lead to spiritual liberation."
      },
      "slok20": {
        "sanskrit": "न प्रहृष्येत्प्रियं प्राप्य नोद्विजेत्प्राप्य चाप्रियम्। स्थिरबुद्धिरसम्मूढो ब्रह्मविद्ब्रह्मणि स्थितः।।5.20।।",
        "transliteration": "na prahṛṣyet priyaṁ prāpya nodvijet prāpya cāpriyam, sthira-buddhir asammūḍho brahma-vid brahmaṇi sthitaḥ",
        "meaning": "One who neither rejoices in the pleasant nor grieves in the unpleasant, with steady intellect, undeluded, knowing Brahman, is established in Brahman.",
        "explanation": "Krishna describes a self-realized soul who remains unaffected by pleasant or unpleasant experiences, with a steady, undeluded mind rooted in Brahman. This sloka emphasizes equanimity and knowledge of Brahman, guiding Arjuna to perform his duties without emotional turbulence, ensuring his actions align with the stable wisdom of Karma Yoga for liberation."
      },
      "slok21": {
        "sanskrit": "बाह्यस्पर्शेष्वसक्तात्मा विन्दत्यात्मनि यत्सुखम्। स ब्रह्मयोगयुक्तात्मा सुखमक्षयमश्नुते।।5.21।।",
        "transliteration": "bāhya-sparśeṣv asaktātmā vindaty ātmani yat sukham, sa brahma-yoga-yuktātmā sukham akṣayam aśnute",
        "meaning": "The soul unattached to external contacts finds joy within the self. United with Brahman through Yoga, such a soul enjoys imperishable happiness.",
        "explanation": "Krishna explains that a Yogi, detached from external sensory pleasures, discovers eternal joy within the self through union with Brahman. This sloka highlights the superiority of inner spiritual happiness over transient sensory pleasures, urging Arjuna to seek this joy through Karma Yoga, performing duties with detachment to attain lasting fulfillment."
      },
      "slok22": {
        "sanskrit": "ये हि संस्पर्शजा भोगा दुःखयोनय एव ते। आद्यन्तवन्तः कौन्तेय न तेषु रमति बुद्धः।।5.22।।",
        "transliteration": "ye hi saṁsparśa-jā bhogā duḥkha-yonaya eva te, ādy-antavantaḥ kaunteya na teṣu ramati buddhaḥ",
        "meaning": "Pleasures born of sensory contact are sources of sorrow, having a beginning and an end, O son of Kunti. The wise do not delight in them.",
        "explanation": "Krishna warns that sensory pleasures, being temporary, lead to suffering, as they are fleeting. The wise avoid attachment to them. This sloka contrasts transient pleasures with eternal spiritual joy, encouraging Arjuna to perform his warrior duties without seeking sensory rewards, focusing instead on the lasting peace of Karma Yoga and self-realization."
      },
      "slok23": {
        "sanskrit": "शक्नोतीहैव यः सोढुं प्राक्शरीरविमोक्षणात्। कामक्रोधोद्भवं वेगं स युक्तः स सुखी नरः।।5.23।।",
        "transliteration": "śaknotīhaiva yaḥ soḍhuṁ prāk śarīra-vimokṣaṇāt, kāma-krodhodbhavaṁ vegaṁ sa yuktaḥ sa sukhī naraḥ",
        "meaning": "One who can withstand the impulses of desire and anger before departing the body is a Yogi and a happy person.",
        "explanation": "Krishna praises the person who controls the urges of desire and anger in this life, describing them as a true Yogi and happy soul. This sloka emphasizes the importance of self-control in achieving spiritual happiness, urging Arjuna to master his emotions through Karma Yoga, ensuring his actions remain pure and conducive to liberation."
      },
      "slok24": {
        "sanskrit": "योऽन्तःसुखोऽन्तरारामस्तथान्तर्ज्योतिरेव यः। स योगी ब्रह्मनिर्वाणं ब्रह्मभूतोऽधिगच्छति।।5.24।।",
        "transliteration": "yo ’ntaḥ-sukho ’ntar-ārāmas tathāntar-jyotir eva yaḥ, sa yogī brahma-nirvāṇaṁ brahma-bhūto ’dhigacchati",
        "meaning": "The Yogi who finds happiness within, delights within, and is illumined within attains liberation in Brahman, having become one with Brahman.",
        "explanation": "Krishna describes a Yogi who derives joy, delight, and illumination from within, achieving unity with Brahman and liberation (Brahma-nirvana). This sloka highlights the inner focus of a self-realized soul, encouraging Arjuna to seek internal fulfillment through Karma Yoga, performing duties with the goal of spiritual union and eternal liberation."
      },
      "slok25": {
        "sanskrit": "लभन्ते ब्रह्मनिर्वाणमृषयः क्षीणकल्मषाः। छिन्नद्वैधा यतात्मानः सर्वभूतहिते रताः।।5.25।।",
        "transliteration": "labhante brahma-nirvāṇaṁ ṛṣayaḥ kṣīṇa-kalmaṣāḥ, chinna-dvaidhā yatātmānaḥ sarva-bhūta-hite ratāḥ",
        "meaning": "Sages with sins destroyed, doubts cut, self-controlled, and engaged in the welfare of all beings attain liberation in Brahman.",
        "explanation": "Krishna describes sages who, purified of sins, free from doubts, self-disciplined, and dedicated to universal welfare, achieve Brahma-nirvana. This sloka outlines the qualities of liberated souls, urging Arjuna to cultivate these traits through Karma Yoga, ensuring his actions benefit all and lead to spiritual liberation, aligning with the vision of equality."
      },
      "slok26": {
        "sanskrit": "कामक्रोधवियुक्तानां यतीनां यतचेतसाम्। अभितो ब्रह्मनिर्वाणं वर्तते विदितात्मनाम्।।5.26।।",
        "transliteration": "kāma-krodha-vimuktānāṁ yatīnāṁ yata-cetasām, abhito brahma-nirvāṇaṁ vartate viditātmanām",
        "meaning": "For ascetics free from desire and anger, with controlled minds and self-realized, liberation in Brahman is ever-present.",
        "explanation": "Krishna states that ascetics who have overcome desire and anger, disciplined their minds, and realized the self experience liberation constantly. This sloka emphasizes the immediacy of liberation for those with self-knowledge, encouraging Arjuna to pursue self-realization through Karma Yoga, ensuring his duties lead to this ever-present state of freedom."
      },
      "slok27": {
        "sanskrit": "स्पर्शान्कृत्वा बहिर्बाह्यांश्चक्षुश्चैवान्तरे भ्रुवोः। प्राणापानौ समौ कृत्वा नासाभ्यन्तरचारिणौ।।5.27।।",
        "transliteration": "sparśān kṛtvā bahir bāhyāṁś cakṣuś caivāntare bhruvoḥ, prāṇāpānau samau kṛtvā nāsābhyantara-cāriṇau",
        "meaning": "Shutting out external contacts, fixing the gaze between the eyebrows, equalizing the incoming and outgoing breaths within the nostrils.",
        "explanation": "Krishna begins describing the meditative practice of a Yogi, who withdraws from external sensory inputs, focuses the gaze inward (between the eyebrows), and balances the prana (outgoing) and apana (incoming) breaths. This sloka introduces the technique of meditation as a complement to Karma Yoga, guiding Arjuna toward mental discipline to support his spiritual practice and selfless action."
      },
      "slok28": {
        "sanskrit": "यतेन्द्रियमनोबुद्धिर्मुनिर्मोक्षपरायणः। विगतेच्छाभयक्रोधो यः सदा मुक्त एव सः।।5.28।।",
        "transliteration": "yatendriya-mano-buddhir munir mokṣa-parāyaṇaḥ, vigatecchā-bhaya-krodho yaḥ sadā mukta eva saḥ",
        "meaning": "The sage with controlled senses, mind, and intellect, intent on liberation, free from desire, fear, and anger, is ever liberated.",
        "explanation": "Krishna continues describing the meditative Yogi, who masters senses, mind, and intellect, focuses on liberation, and is free from desire, fear, and anger. Such a person is perpetually liberated. This sloka emphasizes the liberated state achieved through discipline and detachment, urging Arjuna to cultivate these qualities through Karma Yoga to attain constant freedom while performing his duties."
      },
      "slok29": {
        "sanskrit": "भोक्तारं यज्ञतपसां सर्वलोकमहेश्वरम्। सुहृदं सर्वभूतानां ज्ञात्वा मां शान्तिमृच्छति।।5.29।।",
        "transliteration": "bhoktāraṁ yajña-tapasāṁ sarva-loka-maheśvaram, suhṛdaṁ sarva-bhūtānāṁ jñātvā māṁ śāntim ṛcchati",
        "meaning": "Knowing Me as the enjoyer of sacrifices and austerities, the great Lord of all worlds, and the friend of all beings, one attains peace.",
        "explanation": "Krishna concludes Chapter 5 by revealing his divine nature as the ultimate recipient of all sacrifices, the supreme Lord, and the benevolent friend of all beings. Realizing this, one attains peace. This sloka integrates Bhakti (devotion) with Karma and Jnana Yoga, urging Arjuna to dedicate his actions to Krishna, recognizing him as the ultimate goal, ensuring his warrior duties lead to spiritual peace and liberation."
      }
    }
  }
]
