[
  {
    "chapter7": {
      "title": "Jnana Vijnana Yoga (The Yoga of Knowledge and Realization)",
      "description": "In Chapter 7, Krishna imparts knowledge of his divine nature, explaining the distinction between his material and spiritual energies. He describes how everything emanates from him, the paths to knowing him, and the delusions caused by Maya. Krishna emphasizes devotion as the means to transcend ignorance and attain him, guiding Arjuna toward spiritual clarity amidst his warrior duties.",
      "total_verses": 30,
      "slok1": {
        "sanskrit": "श्रीभगवानुवाच। मय्यासक्तमनाः पार्थ योगं युञ्जन्मदाश्रयः। असंशयं समग्रं मां यथा ज्ञास्यसि तच्छृणु।।7.1।।",
        "transliteration": "śrī bhagavān uvāca mayy āsakta-manāḥ pārtha yogaṁ yuñjan mad-āśrayaḥ, asaṁśayaṁ samagraṁ māṁ yathā jñāsyasi tac chṛṇu",
        "meaning": "The Supreme Lord said: O Partha, with your mind attached to Me, practicing Yoga and taking refuge in Me, hear how you will know Me completely, without doubt.",
        "explanation": "Krishna begins Chapter 7 by promising Arjuna comprehensive knowledge of his divine nature, attainable through devotion, Yoga, and surrender. This sloka sets the tone for Jnana Vijnana Yoga, emphasizing a focused mind and spiritual practice. For Arjuna, it suggests that understanding Krishna’s divine essence through devotion will provide clarity and strength for his warrior duties, dispelling doubts about the war."
      },
      "slok2": {
        "sanskrit": "ज्ञानं तेऽहं सविज्ञानमिदं वक्ष्याम्यशेषतः। यज्ज्ञात्वा नेह भूयोऽन्यज्ज्ञातव्यमवशिष्यति।।7.2।।",
        "transliteration": "jñānaṁ te ’haṁ sa-vijñānam idaṁ vakṣyāmy aśeṣataḥ, yaj jñātvā neha bhūyo ’nyaj jñātavyam avaśiṣyati",
        "meaning": "I shall now declare to you this knowledge, along with realization, in full, knowing which nothing more remains to be known in this world.",
        "explanation": "Krishna promises to impart complete knowledge (jnana) and experiential realization (vijnana), after which no further knowledge is needed. This sloka underscores the supremacy of divine wisdom. For Arjuna, it assures that understanding Krishna’s teachings will provide ultimate clarity, enabling him to act decisively in the war with spiritual insight, transcending worldly uncertainties."
      },
      "slok3": {
        "sanskrit": "मनुष्याणां सहस्रेषु कश्चिद्यतति सिद्धये। यततामपि सिद्धानां कश्चिन्मां वेत्ति तत्त्वतः।।7.3।।",
        "transliteration": "manuṣyāṇāṁ sahasreṣu kaścid yatati siddhaye, yatatām api siddhānāṁ kaścin māṁ vetti tattvataḥ",
        "meaning": "Among thousands of men, one strives for perfection; among those who strive and succeed, one truly knows Me in truth.",
        "explanation": "Krishna highlights the rarity of spiritual pursuit and true knowledge of him. Few strive for perfection, and even fewer realize his divine essence. This sloka emphasizes the exclusivity of divine realization. For Arjuna, it underscores the privilege of receiving Krishna’s teachings, motivating him to pursue this rare knowledge to guide his actions in the war with spiritual purpose."
      },
      "slok4": {
        "sanskrit": "भूमिरापोऽनलो वायुः खं मनो बुद्धिरेव च। अहङ्कार इतीयं मे भिन्ना प्रकृतिरष्टधा।।7.4।।",
        "transliteration": "bhūmir āpo ’nalo vāyuḥ khaṁ mano buddhir eva ca, ahaṅkāra itīyaṁ me bhinnā prakṛtir aṣṭadhā",
        "meaning": "Earth, water, fire, air, ether, mind, intellect, and ego—these are My eightfold material nature, distinct from Me.",
        "explanation": "Krishna describes his lower (material) nature, comprising eight elements: five physical (earth, water, fire, air, ether) and three subtle (mind, intellect, ego). This sloka introduces the concept of his dual nature. For Arjuna, it clarifies that the material world, including his battlefield, is Krishna’s creation, encouraging him to see his duties as part of a divine framework, reducing attachment."
      },
      "slok5": {
        "sanskrit": "अपरेयमितस्त्वन्यां प्रकृतिं विद्धि मे पराम्। जीवभूतां महाबाहो ययेदं धार्यते जगत्।।7.5।।",
        "transliteration": "apareyam itas tv anyāṁ prakṛtiṁ viddhi me parām, jīva-bhūtāṁ mahā-bāho yayedaṁ dhāryate jagat",
        "meaning": "This is My lower nature. Know My higher nature, O mighty-armed, the life force (souls) by which this universe is sustained.",
        "explanation": "Krishna introduces his higher (spiritual) nature, the conscious souls that animate the universe, distinct from the material elements. This sloka emphasizes the spiritual essence of existence. For Arjuna, it suggests that his true self, as a soul, transcends the material battlefield, encouraging him to act with spiritual awareness, aligning his warrior duties with his eternal nature."
      },
      "slok6": {
        "sanskrit": "एतद्योनीनि भूतानि सर्वं इत्युपधारय। अहं कृत्स्नस्य जगतः प्रभवः प्रलयस्तथा।।7.6।।",
        "transliteration": "etad-yonīni bhūtāni sarvaṁ ity upadhāraya, ahaṁ kṛtsnasya jagataḥ prabhavaḥ pralayas tathā",
        "meaning": "Know that all beings originate from these two natures. I am the source and dissolution of the entire universe.",
        "explanation": "Krishna declares that all creation arises from his material and spiritual natures, and he is the origin and end of the universe. This sloka establishes his supreme cosmic role. For Arjuna, it reveals Krishna as the ultimate reality behind the war, inspiring him to act in alignment with divine will, knowing all events are under Krishna’s control."
      },
      "slok7": {
        "sanskrit": "मत्तः परतरं नान्यत्किञ्चिदस्ति धनञ्जय। मयि सर्वमिदं प्रोतं सूत्रे मणिगणा इव।।7.7।।",
        "transliteration": "mattaḥ parataraṁ nānyat kiñcid asti dhanañjaya, mayi sarvam idaṁ protaṁ sūtre maṇi-gaṇā iva",
        "meaning": "There is nothing higher than Me, O Dhananjaya. All this is strung on Me, like pearls on a thread.",
        "explanation": "Krishna asserts his supremacy, stating that everything is sustained by him, like pearls threaded on a string. This sloka emphasizes his all-pervading nature. For Arjuna, it reinforces Krishna’s divine authority, encouraging him to surrender to Krishna’s guidance, knowing that the war and its outcomes are part of his divine order, reducing personal burdens."
      },
      "slok8": {
        "sanskrit": "रसोऽहमप्सु कौन्तेय प्रभास्मि शशिसूर्ययोः। प्रणवः सर्ववेदेषु शब्दः खे पौरुषं नृषु।।7.8।।",
        "transliteration": "raso ’ham apsu kaunteya prabhāsmi śaśi-sūryayoḥ, praṇavaḥ sarva-vedeṣu śabdaḥ khe pauruṣaṁ nṛṣu",
        "meaning": "I am the taste in water, O son of Kunti, the radiance in the sun and moon, the sacred syllable Om in all Vedas, sound in ether, and valor in men.",
        "explanation": "Krishna begins describing his divine manifestations, identifying himself with the essence of various phenomena: taste in water, light in celestial bodies, Om in scriptures, sound in ether, and courage in humans. This sloka illustrates his immanence. For Arjuna, it suggests that Krishna’s presence permeates the battlefield, inspiring him to recognize divine energy in his own valor and act with spiritual awareness."
      },
      "slok9": {
        "sanskrit": "पुण्यो गन्धः पृथिव्यां च तेजश्चास्मि विभावसौ। जीवनं सर्वभूतेषु तपश्चास्मि तपस्विषु।।7.9।।",
        "transliteration": "puṇyo gandhaḥ pṛthivyāṁ ca tejaś cāsmi vibhāvasau, jīvanaṁ sarva-bhūteṣu tapaś cāsmi tapasviṣu",
        "meaning": "I am the pure fragrance in earth, the brilliance in fire, the life in all beings, and the austerity in ascetics.",
        "explanation": "Krishna continues listing his manifestations: the sacred scent in earth, radiance in fire, life force in all creatures, and penance in ascetics. This sloka further reveals his universal presence. For Arjuna, it implies that Krishna’s divine energy animates all life, including his opponents, encouraging him to see the war as a divine play and act without personal attachment."
      },
      "slok10": {
        "sanskrit": "बीजं मां सर्वभूतानां विद्धि पार्थ सनातनम्। बुद्धिर्बुद्धिमतामस्मि तेजस्तेजस्विनामहम्।।7.10।।",
        "transliteration": "bījaṁ māṁ sarva-bhūtānāṁ viddhi pārtha sanātanam, buddhir buddhimatām asmi tejas tejasvinām aham",
        "meaning": "Know Me, O Partha, as the eternal seed of all beings. I am the intelligence of the intelligent and the splendor of the splendid.",
        "explanation": "Krishna identifies himself as the eternal source (seed) of all existence, the intellect in the wise, and the glory in the radiant. This sloka emphasizes his role as the origin and essence of qualities. For Arjuna, it suggests that his own intelligence and valor stem from Krishna, motivating him to wield them in battle with humility and devotion, aligned with divine purpose."
      },
      "slok11": {
        "sanskrit": "बलं बलवतां चाहं कामरागविवर्जितम्। धर्माविरुद्धो भूतेषु कामोऽस्मि भरतर्षभ।।7.11।।",
        "transliteration": "balaṁ balavatāṁ cāhaṁ kāma-rāga-vivarjitam, dharmāviruddho bhūteṣu kāmo ’smi bharatarṣabha",
        "meaning": "I am the strength of the strong, free from desire and passion, and the desire in beings that is not opposed to dharma, O best of the Bharatas.",
        "explanation": "Krishna declares himself as the pure strength in the powerful, devoid of selfish desire, and righteous desire in beings. This sloka distinguishes divine qualities from impure motives. For Arjuna, it implies that his warrior strength and righteous intentions in battle are manifestations of Krishna, encouraging him to fight with moral clarity and detachment from personal desires."
      },
      "slok12": {
        "sanskrit": "ये चैव सात्त्विका भावा राजसास्तामसाश्च ये। मत्त एवेति तान्विद्धि न त्वहं तेषु ते मयि।।7.12।।",
        "transliteration": "ye caiva sāttvikā bhāvā rājasās tāmasāś ca ye, matta eveti tān viddhi na tv ahaṁ teṣu te mayi",
        "meaning": "Know that all states of being—sattvic, rajasic, and tamasic—proceed from Me. I am not in them, but they are in Me.",
        "explanation": "Krishna explains that the three gunas (sattva, rajas, tamas) governing all states of existence originate from him, yet he transcends them. This sloka clarifies his relationship with material nature. For Arjuna, it suggests that the war’s dynamics, driven by these gunas, are under Krishna’s control, urging him to act beyond their influence, guided by divine wisdom."
      },
      "slok13": {
        "sanskrit": "त्रिभिर्गुणमयैर्भावैः एभिः सर्वमिदं जगत्। मोहितं नाभिजानाति मां एभ्यः परमव्ययम्।।7.13।।",
        "transliteration": "tribhir guṇa-mayair bhāvaiḥ ebhiḥ sarvam idaṁ jagat, mohitaṁ nābhijānāti māṁ ebhyaḥ param avyayam",
        "meaning": "Deluded by these three gunas, the entire world does not know Me, who am beyond them and imperishable.",
        "explanation": "Krishna states that the world, swayed by the three gunas, is deluded and fails to recognize his transcendent, eternal nature. This sloka introduces the concept of Maya (illusion). For Arjuna, it explains why he and others may be confused by the war’s moral dilemmas, encouraging him to seek Krishna’s guidance to transcend delusion and act with clarity."
      },
      "slok14": {
        "sanskrit": "दैवी ह्येषा गुणमयी मम माया दुरत्यया। ममैव ये प्रपद्यन्ति मायामेतां तरन्ति ते।।7.14।।",
        "transliteration": "daivī hy eṣā guṇa-mayī mama māyā duratyayā, mamāiva ye prapadyanti māyām etāṁ taranti te",
        "meaning": "This divine Maya of Mine, consisting of the three gunas, is hard to overcome. But those who surrender to Me alone cross beyond it.",
        "explanation": "Krishna describes his Maya, the illusion created by the gunas, as difficult to surmount, but those who surrender to him transcend it. This sloka emphasizes devotion as the key to liberation. For Arjuna, it suggests that surrendering to Krishna will help him overcome the war’s emotional and moral confusion, enabling him to act with spiritual resolve."
      },
      "slok15": {
        "sanskrit": "न मां दुष्कृतिनो मूढाः प्रपद्यन्ति नराधमाः। माययापहृतज्ञाना आसुरं भावमाश्रिताः।।7.15।।",
        "transliteration": "na māṁ duṣkṛtino mūḍhāḥ prapadyanti narādhamāḥ, māyayāpahṛta-jñānā āsuraṁ bhāvam āśritāḥ",
        "meaning": "The evil-doers, the deluded, the lowest of men, deprived of knowledge by Maya and following demonic tendencies, do not surrender to Me.",
        "explanation": "Krishna identifies those who, due to sinful actions, ignorance, and demonic tendencies, fail to surrender to him, their wisdom stolen by Maya. This sloka contrasts devotees with the ignorant. For Arjuna, it warns against succumbing to delusion or unrighteous motives in the war, urging him to align with Krishna’s divine will to avoid such a fate."
      },
      "slok16": {
        "sanskrit": "चतुर्विधा भजन्ते मां जनाः सुकृतिनोऽर्जुन। आर्तो जिज्ञासुरर्थार्थी ज्ञानी च भरतर्षभ।।7.16।।",
        "transliteration": "catur-vidhā bhajante māṁ janāḥ sukṛtino ’rjuna, ārto jijñāsur arthārthī jñānī ca bharatarṣabha",
        "meaning": "Four kinds of virtuous people worship Me, O Arjuna: the distressed, the seeker of knowledge, the seeker of wealth, and the wise, O best of the Bharatas.",
        "explanation": "Krishna describes four types of devotees: those in distress, seeking knowledge, desiring wealth, and the wise who seek liberation. This sloka categorizes devotees based on their motives. For Arjuna, it contextualizes his own devotion, likely as a distressed seeker, encouraging him to progress toward wisdom, using the war as a path to deeper spiritual understanding."
      },
      "slok17": {
        "sanskrit": "तेषां ज्ञानी नित्ययुक्तः एकभक्तिर्विशिष्यते। प्रियो हि ज्ञानिनोऽत्यर्थमहं स च मम प्रियः।।7.17।।",
        "transliteration": "teṣāṁ jñānī nitya-yuktaḥ eka-bhaktir viśiṣyate, priyo hi jñānino ’tyartham ahaṁ sa ca mama priyaḥ",
        "meaning": "Of these, the wise, ever united with single-minded devotion, excels. For I am exceedingly dear to the wise, and he is dear to Me.",
        "explanation": "Krishna praises the jnani (wise devotee), who is constantly connected with unwavering devotion, as the highest, sharing a mutual bond of love. This sloka elevates knowledge-driven devotion. For Arjuna, it inspires him to aspire to wisdom and single-minded devotion, ensuring his actions in the war are guided by a deep, loving connection to Krishna."
      },
      "slok18": {
        "sanskrit": "उदाराः सर्व एवैते ज्ञानी त्वात्मैव मे मतम्। आस्थितः स हि युक्तात्मा ममैवानुत्तमां गतिम्।।7.18।।",
        "transliteration": "udārāḥ sarva evaite jñānī tv ātmaiva me matam, āsthitaḥ sa hi yuktātmā mamaivānuttamāṁ gatim",
        "meaning": "All these are noble, but the wise one is My very self, in My opinion, for he, with a disciplined soul, is fixed on Me, the supreme goal.",
        "explanation": "Krishna acknowledges all devotees as noble but considers the jnani as his own self, fully dedicated to him as the ultimate goal. This sloka underscores the jnani’s supreme devotion. For Arjuna, it encourages cultivating disciplined devotion, aligning his warrior duties with the pursuit of Krishna as the highest aim, ensuring spiritual fulfillment."
      },
      "slok19": {
        "sanskrit": "बहूनां जन्मनामन्ते ज्ञानवान्मां प्रपद्यति। वासुदेवः सर्वमिति स महात्मा सुदुर्लभः।।7.19।।",
        "transliteration": "bahūnāṁ janmanām ante jñānavān māṁ prapadyati, vāsudevaḥ sarvam iti sa mahātmā sudurlabhaḥ",
        "meaning": "After many births, the wise one surrenders to Me, realizing ‘Vasudeva is all.’ Such a great soul is very rare.",
        "explanation": "Krishna describes the rare jnani who, after many lifetimes, realizes that Krishna (Vasudeva) is everything and surrenders fully. This sloka highlights the culmination of spiritual evolution. For Arjuna, it inspires perseverance in seeking this ultimate realization, using the war as an opportunity to deepen his devotion and understanding of Krishna’s all-encompassing nature."
      },
      "slok20": {
        "sanskrit": "कामैस्तैस्तैर्हृतज्ञानाः प्रपद्यन्तेऽन्यदेवताः। तं तं नियममास्थाय प्रकृत्या नियताः स्वया।।7.20।।",
        "transliteration": "kāmais tais tair hṛta-jñānāḥ prapadyante ’nya-devatāḥ, taṁ taṁ niyamam āsthāya prakṛtyā niyatāḥ svayā",
        "meaning": "Those whose knowledge is stolen by desires surrender to other deities, following various rites, driven by their own nature.",
        "explanation": "Krishna explains that those swayed by material desires worship other deities, following rituals dictated by their conditioned nature. This sloka contrasts true devotion with distracted pursuits. For Arjuna, it warns against being swayed by fleeting desires in the war, urging him to focus devotion on Krishna alone to maintain spiritual clarity and purpose."
      },
      "slok21": {
        "sanskrit": "यो यो यां यां तनुं भक्तः श्रद्धयार्चितुमिच्छति। तस्य तस्याचलां श्रद्धां तामेव विदधाम्यहम्।।7.21।।",
        "transliteration": "yo yo yāṁ yāṁ tanuṁ bhaktaḥ śraddhayārcitum icchati, tasya tasyācalāṁ śraddhāṁ tām eva vidadhāmy aham",
        "meaning": "Whichever form a devotee wishes to worship with faith, I make that faith steadfast in that form.",
        "explanation": "Krishna states that he strengthens the faith of devotees who worship any divine form, supporting their chosen path. This sloka reflects his universal benevolence. For Arjuna, it assures that his devotion to Krishna is divinely supported, encouraging him to deepen his faith, knowing that Krishna will guide his spiritual efforts amidst the war’s challenges."
      },
      "slok22": {
        "sanskrit": "स तया श्रद्धया युक्तस्तस्याराधनमीहति। लभते च ततः कामान्मयैव विहितान्हि तान्।।7.22।।",
        "transliteration": "sa tayā śraddhayā yuktas tasyārādhanam īhati, labhate ca tataḥ kāmān mayaiva vihitān hi tān",
        "meaning": "Endowed with that faith, he engages in worship and obtains his desires, which are granted by Me alone.",
        "explanation": "Krishna explains that devotees, with steadfast faith, worship their chosen deity and fulfill their desires, but these are ultimately granted by him. This sloka clarifies that all fulfillments come from Krishna. For Arjuna, it reinforces that his success in the war, if pursued with faith in Krishna, is divinely ordained, encouraging unwavering devotion."
      },
      "slok23": {
        "sanskrit": "अन्तवत्तु फलं तेषां तद्भवत्यल्पमेधसाम्। देवान्देवयजो यान्ति मद्भक्ता यान्ति मामपि।।7.23।।",
        "transliteration": "antavat tu phalaṁ teṣāṁ tad bhavaty alpa-medhasām, devān deva-yajo yānti mad-bhaktā yānti mām api",
        "meaning": "But the fruit gained by those of limited understanding is temporary. Worshippers of deities go to them, but My devotees come to Me.",
        "explanation": "Krishna contrasts the temporary results of worshipping lesser deities, pursued by those of limited wisdom, with the eternal liberation attained by his devotees. This sloka emphasizes the superiority of devotion to Krishna. For Arjuna, it encourages focusing on Krishna to achieve lasting spiritual success, ensuring his actions in the war lead to eternal union rather than fleeting gains."
      },
      "slok24": {
        "sanskrit": "अव्यक्तं व्यक्तिमापन्नं मन्यन्ते मामबुद्धयः। परं भावमजानन्तो ममाव्ययमनुत्तमम्।।7.24।।",
        "transliteration": "avyaktaṁ vyaktim āpannaṁ manyante mām abuddhayaḥ, paraṁ bhāvam ajānanto mamāvyayam anuttamam",
        "meaning": "The ignorant think of Me, the unmanifest, as having assumed a manifest form, unaware of My supreme, imperishable, and unsurpassed nature.",
        "explanation": "Krishna laments that the ignorant perceive him only as a physical form, unaware of his transcendent, eternal nature. This sloka corrects misconceptions about his divinity. For Arjuna, it deepens his understanding of Krishna’s supreme essence, urging him to see Krishna beyond his human form as his charioteer, guiding his actions with divine reverence."
      },
      "slok25": {
        "sanskrit": "नाहं प्रकाशः सर्वस्य योगमायासमावृतः। मूढोऽयं नाभिजानाति लोको मामजमव्ययम्।।7.25।।",
        "transliteration": "nāhaṁ prakāśaḥ sarvasya yoga-māyā-samāvṛtaḥ, mūḍho ’yaṁ nābhijānāti loko mām ajam avyayam",
        "meaning": "I am not revealed to all, veiled by My Yoga-Maya. This deluded world does not know Me, the unborn and imperishable.",
        "explanation": "Krishna explains that his divine nature is hidden by Yoga-Maya, his divine illusion, causing the deluded world to misunderstand his eternal, unborn essence. This sloka emphasizes his hidden divinity. For Arjuna, it underscores the privilege of receiving Krishna’s direct guidance, motivating him to transcend Maya through devotion, ensuring clarity in his warrior role."
      },
      "slok26": {
        "sanskrit": "वेदाहं समतीतानि वर्तमानानि चार्जुन। भविष्याणि च भूतानि मां तु वेद न कश्चन।।7.26।।",
        "transliteration": "vedāhaṁ samatītāni vartamānāni cārjuna, bhaviṣyāṇi ca bhūtāni māṁ tu veda na kaścana",
        "meaning": "I know all beings—past, present, and future—but no one knows Me, O Arjuna.",
        "explanation": "Krishna declares his omniscience, knowing all beings across time, while remaining unknown to them due to their delusion. This sloka highlights his supreme knowledge and transcendence. For Arjuna, it reinforces Krishna’s divine authority, encouraging trust in his guidance for the war, knowing that Krishna’s wisdom encompasses all outcomes and destinies."
      },
      "slok27": {
        "sanskrit": "इच्छाद्वेषसमुत्थेन द्वन्द्वमोहेन भारत। सर्वं भूतानि संमोहं सर्गे यान्ति परन्तप।।7.27।।",
        "transliteration": "icchā-dveṣa-samutthena dvandva-mohena bhārata, sarvaṁ bhūtāni saṁmohaṁ sarge yānti parantapa",
        "meaning": "Due to the delusion of dualities arising from desire and aversion, O Bharata, all beings are bewildered at birth, O scorcher of foes.",
        "explanation": "Krishna explains that beings are deluded from birth by dualities (e.g., pleasure-pain) driven by desire and aversion. This sloka identifies the root of ignorance. For Arjuna, it highlights how his own emotional turmoil in the war stems from such dualities, urging him to transcend them through Krishna’s teachings to act with spiritual clarity."
      },
      "slok28": {
        "sanskrit": "येषां त्वन्तगतं पापं जनानां पुण्यकर्मणाम्। ते द्वन्द्वमोहनिर्मुक्ता भजन्ति मां दृढव्रताः।।7.28।।",
        "transliteration": "yeṣāṁ tv anta-gataṁ pāpaṁ janānāṁ puṇya-karmaṇām, te dvandva-moha-nirmuktā bhajanti māṁ dṛḍha-vratāḥ",
        "meaning": "But those whose sins are destroyed by virtuous deeds, freed from the delusion of dualities, worship Me with firm resolve.",
        "explanation": "Krishna states that those purified by righteous actions, free from dualistic delusion, worship him steadfastly. This sloka offers hope for liberation through devotion. For Arjuna, it suggests that his righteous fight, if dedicated to Krishna, will purify him, enabling him to overcome doubts and act with unwavering devotion, aligning duty with spirituality."
      },
      "slok29": {
        "sanskrit": "जरामरणमोक्षाय मामाश्रित्य यतन्ति ये। ते ब्रह्म तद्विदुः कृत्स्नमध्यात्मं कर्म चाखिलम्।।7.29।।",
        "transliteration": "jarā-maraṇa-mokṣāya mām āśritya yatanti ye, te brahma tad viduḥ kṛtsnam adhyātmaṁ karma cākhilam",
        "meaning": "Those who strive for liberation from old age and death, taking refuge in Me, know Brahman, the self, and the entirety of action.",
        "explanation": "Krishna describes devotees who seek liberation from aging and death by surrendering to him, gaining knowledge of Brahman, the self, and all actions. This sloka connects devotion to comprehensive spiritual knowledge. For Arjuna, it encourages dedicating his warrior efforts to Krishna, ensuring liberation and understanding of his eternal self amidst the war’s mortality."
      },
      "slok30": {
        "sanskrit": "साधिभूताधिदैवं मां साधियज्ञं च ये विदुः। प्रयाणकालेऽपि च मां ते विदुर्युक्तचेतसः।।7.30।।",
        "transliteration": "sādhibhūtādhidaivaṁ māṁ sādhiyajñaṁ ca ye viduḥ, prayāṇa-kāle ’pi ca māṁ te vidur yukta-cetasaḥ",
        "meaning": "Those who know Me as the Supreme in material existence, divinity, and sacrifice, with disciplined minds, know Me even at the time of death.",
        "explanation": "Krishna concludes Chapter 7, stating that those who understand him as the essence of material creation, divine entities, and sacrifices, with focused minds, remain connected to him at death. This sloka emphasizes constant awareness of Krishna. For Arjuna, it assures that devotion to Krishna will ensure spiritual clarity in life and death, guiding his actions in the war toward liberation."
      }
    }
  }
]
