[
  {
    "chapter16": {
      "title": "Daivasura Sampad Vibhaga Yoga (The Yoga of the Division Between Divine and Demonic Qualities)",
      "description": "In Chapter 16, Krishna delineates the divine (daivi) and demonic (asuri) qualities that shape human nature. He describes how divine traits lead to liberation and demonic traits to bondage, urging the cultivation of righteousness. For Arjuna, this knowledge helps him align his warrior duties with divine qualities, overcoming demonic tendencies like anger and greed, ensuring his actions uphold dharma in the war.",
      "total_verses": 24,
      "slok1": {
        "sanskrit": "श्रीभगवानुवाच। अभयं सत्त्वसंशुद्धिः ज्ञानयोगव्यवस्थितिः। दानं दमश्च यज्ञश्च स्वाध्यायस्तप आर्जवम्।।16.1।।",
        "transliteration": "śrī bhagavān uvāca abhayaṁ sattva-saṁśuddhiḥ jñāna-yoga-vyavasthitiḥ, dānaṁ damaś ca yajñaś ca svādhyāyas tapa ārjavam",
        "meaning": "The Supreme Lord said: Fearlessness, purity of heart, steadfastness in knowledge and yoga, charity, self-control, sacrifice, study of scriptures, austerity, and simplicity,",
        "explanation": "Krishna begins listing divine qualities, starting with fearlessness, purity, and devotion to knowledge and yoga, among others. This sloka introduces traits leading to liberation. For Arjuna, these qualities are vital in battle, enabling him to fight fearlessly, with a pure heart and disciplined focus on dharma, ensuring his warrior actions align with divine purpose."
      },
      "slok2": {
        "sanskrit": "अहिंसा सत्यमक्रोधस्त्यागः शान्तिरपैशुनम्। दया भूतेष्वलोलुप्त्वं मार्दवं ह्रीरचापलम्।।16.2।।",
        "transliteration": "ahiṁsā satyam akrodhas tyāgaḥ śāntir apaiśunam, dayā bhūteṣv aloluptvaṁ mārdavaṁ hrīr acāpalam",
        "meaning": "Non-violence, truthfulness, freedom from anger, renunciation, tranquility, freedom from slander, compassion for all beings, absence of greed, gentleness, modesty, and steadiness,",
        "explanation": "Krishna continues enumerating divine qualities, emphasizing non-violence, truth, and compassion. This sloka further defines the divine nature. For Arjuna, these traits guide his conduct in war, urging him to fight without hatred, with truth and compassion, ensuring his actions reflect divine virtues, avoiding anger or greed in the heat of battle."
      },
      "slok3": {
        "sanskrit": "तेजः क्षमा धृतिः शौचमद्रोहो नातिमानिता। भवन्ति सम्पदं दैवीमभिजातस्य भारत।।16.3।।",
        "transliteration": "tejaḥ kṣamā dhṛtiḥ śaucam adroho nāti-mānitā, bhavanti sampadaṁ daivīm abhijātasya bhārata",
        "meaning": "Vigor, forgiveness, fortitude, purity, freedom from malice, and absence of pride—these belong to one born with divine qualities, O Bharata.",
        "explanation": "Krishna completes the list of divine qualities, including vigor, forgiveness, and humility. This sloka concludes the divine traits’ description. For Arjuna, these qualities ensure he fights with strength, forgives opponents’ actions, and remains humble, aligning his warrior role with divine virtues, fostering liberation through righteous action."
      },
      "slok4": {
        "sanskrit": "दम्भो दर्पोऽतिमानश्च क्रोधः पारुष्यमेव च। अज्ञानं चाभिजातस्य पार्थ सम्पदमासुरीम्।।16.4।।",
        "transliteration": "dambho darpo ’timānaś ca krodhaḥ pāruṣyam eva ca, ajñānaṁ cābhijātasya pārtha sampadam āsurīm",
        "meaning": "Hypocrisy, arrogance, conceit, anger, harshness, and ignorance—these are the qualities of one born with demonic nature, O Partha.",
        "explanation": "Krishna lists demonic qualities, contrasting them with divine traits, noting their role in bondage. This sloka introduces the demonic nature. For Arjuna, these traits—anger or arrogance—may arise in war, warning him to avoid them, ensuring his actions remain divine, focused on dharma rather than personal ego or hostility."
      },
      "slok5": {
        "sanskrit": "दैवी सम्पद्विमोक्षाय निबन्धायासुरी मता। मा शुचः सम्पदं दैवीमभिजातोऽसि पाण्डव।।16.5।।",
        "transliteration": "daivī sampad vimokṣāya nibandhāyāsurī matā, mā śucaḥ sampadaṁ daivīm abhijāto ’si pāṇḍava",
        "meaning": "Divine qualities lead to liberation, while demonic qualities lead to bondage. Do not grieve, O Pandava, for you are born with divine qualities.",
        "explanation": "Krishna contrasts the outcomes of divine and demonic qualities, reassuring Arjuna of his divine nature. This sloka emphasizes the liberating power of divine traits. For Arjuna, this assurance encourages him to cultivate divine qualities in battle, fighting with confidence in his righteous nature, ensuring liberation through dharmic action."
      },
      "slok6": {
        "sanskrit": "द्वौ भूतसर्गौ लोकेऽस्मिन्दैव आसुर एव च। दैवो विस्तरशः प्रोक्त आसुरं पार्थ मे शृणु।।16.6।।",
        "transliteration": "dvau bhūta-sargau loke ’smin daiva āsura eva ca, daivo vistaraśaḥ prokta āsuraṁ pārtha me śṛṇu",
        "meaning": "There are two types of beings in this world: divine and demonic. The divine has been described in detail; now hear from Me about the demonic, O Partha.",
        "explanation": "Krishna introduces the two categories of beings and shifts focus to demonic traits. This sloka sets the stage for describing demonic nature. For Arjuna, understanding both types helps him recognize demonic tendencies in war’s chaos, ensuring he aligns with divine qualities, performing his warrior duties with righteousness."
      },
      "slok7": {
        "sanskrit": "प्रवृत्तिं च निवृत्तिं च जना न विदुरासुराः। न शौचं नापि चाचारो न सत्यं तेषु विद्यते।।16.7।।",
        "transliteration": "pravṛttiṁ ca nivṛttiṁ ca janā na vidur āsurāḥ, na śaucaṁ nāpi cācāro na satyaṁ teṣu vidyate",
        "meaning": "Demonic people do not know what to do or what to avoid; neither purity, good conduct, nor truth is found in them.",
        "explanation": "Krishna describes demonic beings’ ignorance of proper action, lacking purity, conduct, and truth. This sloka highlights their moral deficiencies. For Arjuna, this warns against adopting such ignorance in war, urging him to act with purity and truth, ensuring his warrior actions reflect divine conduct, not demonic recklessness."
      },
      "slok8": {
        "sanskrit": "असत्यमप्रतिष्ठं ते जगदाहुरनीश्वरम्। अपरस्परसम्भूतं किमन्यत्कामहैतुकम्।।16.8।।",
        "transliteration": "asatyam apratiṣṭhaṁ te jagad āhur anīśvaram, aparaspara-sambhūtaṁ kim anyat kāma-haitukam",
        "meaning": "They say the world is unreal, without foundation, godless, born of mutual union, caused by desire—what else?",
        "explanation": "Krishna outlines the demonic worldview: denying truth, divine order, and God, attributing creation to desire. This sloka exposes their atheistic philosophy. For Arjuna, this contrasts with his devotion to Krishna, urging him to fight with faith in divine order, rejecting godless views that could justify unrighteous actions in war."
      },
      "slok9": {
        "sanskrit": "एतां दृष्टिमवष्टभ्य नष्टात्मानोऽल्पबुद्धयः। प्रभवन्त्युग्रकर्माणः क्षयाय जगतोऽहिताः।।16.9।।",
        "transliteration": "etāṁ dṛṣṭim avaṣṭabhya naṣṭātmāno ’lpa-buddhayaḥ, prabhavanty ugra-karmāṇaḥ kṣayāya jagato ’hitāḥ",
        "meaning": "Holding this view, these lost souls, of little intellect, engage in cruel actions, harmful to the world, leading to its destruction.",
        "explanation": "Krishna describes demonic beings as deluded, engaging in harmful actions due to their flawed worldview. This sloka highlights their destructive nature. For Arjuna, this warns against war actions driven by ignorance or cruelty, urging him to fight for dharma, protecting the world with divine intent, not demonic destruction."
      },
      "slok10": {
        "sanskrit": "काममाश्रित्य दुष्पूरं दम्भमानमदान्विताः। मोहाद्गृहीत्वासद्ग्राहान्प्रवर्तन्तेऽशुचिव्रताः।।16.10।।",
        "transliteration": "kāmam āśritya duṣpūraṁ dambha-māna-madānvitāḥ, mohād gṛhītvāsad-grāhān pravartante ’śuci-vratāḥ",
        "meaning": "Clinging to insatiable desire, full of hypocrisy, pride, and arrogance, holding wrong views through delusion, they act with impure resolves.",
        "explanation": "Krishna details demonic traits like insatiable desire, hypocrisy, and deluded actions. This sloka emphasizes their impure motivations. For Arjuna, this cautions against war driven by desire or pride, urging him to act with pure intent, aligned with Krishna’s guidance, ensuring his warrior duties remain free from demonic influences."
      },
      "slok11": {
        "sanskrit": "चिन्तामपरिमेयां च प्रलयान्तामुपाश्रिताः। कामोपभोगपरमा एतावदिति निश्चिताः।।16.11।।",
        "transliteration": "cintām aparimeyāṁ ca pralayāntām upāśritāḥ, kāmopabhoga-paramā etāvad iti niścitāḥ",
        "meaning": "Obsessed with endless anxieties until death, considering sense enjoyment the highest aim, convinced that this is all,",
        "explanation": "Krishna describes demonic beings as consumed by anxiety and sense pleasure, believing life’s purpose is gratification. This sloka highlights their materialistic focus. For Arjuna, this warns against fighting for personal gain or pleasure, urging him to transcend anxiety and act for Krishna, ensuring his warrior duties aim for spiritual liberation."
      },
      "slok12": {
        "sanskrit": "आशापाशशतैर्बद्धाः कामक्रोधपरायणाः। ईहन्ते कामभोगार्थमयमाप्तिमसद्ग्रहाः।।16.12।।",
        "transliteration": "āśā-pāśa-śatair baddhāḥ kāma-krodha-parāyaṇāḥ, īhante kāma-bhogārtham anyāyāptim asad-grahāḥ",
        "meaning": "Bound by hundreds of desires, devoted to lust and anger, they strive to amass wealth unjustly for sense gratification.",
        "explanation": "Krishna notes demonic beings’ bondage to desires, driven by lust and anger, seeking wealth unjustly. This sloka emphasizes their selfish pursuits. For Arjuna, this cautions against war driven by greed or rage, urging him to fight justly, devoted to Krishna, ensuring his actions remain free from demonic motivations."
      },
      "slok13": {
        "sanskrit": "इदमद्य मया लब्धमिदं प्राप्स्यामि मनोरथम्। इदमस्तीदमपि मे भविष्यति पुनर्धनम्।।16.13।।",
        "transliteration": "idam adya mayā labdham idaṁ prāpsyāmi manoratham, idam astīdam api me bhaviṣyati punar dhanam",
        "meaning": "‘This I have gained today; this desire I shall fulfill; this is mine, and more wealth will be mine again,’",
        "explanation": "Krishna illustrates the demonic mindset, obsessed with accumulating wealth and fulfilling desires. This sloka reveals their materialistic arrogance. For Arjuna, this mindset contrasts with his duty to fight for dharma, not personal gain, urging him to act selflessly, offering his warrior efforts to Krishna without attachment to rewards."
      },
      "slok14": {
        "sanskrit": "असौ मया हतः शत्रुर्हनिष्ये चापरानपि। ईश्वरोऽहमहं भोगी सिद्धोऽहं बलवान्सुखी।।16.14।।",
        "transliteration": "asau mayā hataḥ śatrur haniṣye cāparān api, īśvaro ’ham ahaṁ bhogī siddho ’haṁ balavān sukhī",
        "meaning": "‘That enemy has been slain by me; I shall slay others too. I am the lord, the enjoyer, perfect, powerful, and happy,’",
        "explanation": "Krishna describes the demonic delusion of power, pride, and enjoyment through violence. This sloka highlights their ego-driven aggression. For Arjuna, this warns against fighting with pride or a sense of personal triumph, urging him to act as Krishna’s instrument, ensuring his warrior victories are humble offerings to the divine."
      },
      "slok15": {
        "sanskrit": "आढ्योऽहं इदमद्वं मे कोऽन्योऽस्ति सदृशो मया। यक्ष्ये दास्यामि मोदिष्य इत्यज्ञानविमोहिताः।।16.15।।",
        "transliteration": "āḍhyo ’haṁ idam ad vaṁ me ko ’nyo ’sti sadṛśo mayā, yakṣye dāsyāmi modiṣya ity ajñāna-vimohitāḥ",
        "meaning": "‘I am wealthy, high-born; who else is equal to me? I will sacrifice, give, and rejoice,’ thus deluded by ignorance.",
        "explanation": "Krishna portrays demonic beings’ arrogance in wealth and status, deluded by ignorance. This sloka emphasizes their self-centeredness. For Arjuna, this contrasts with his need to fight humbly, not for status or wealth, ensuring his warrior actions are selfless, guided by Krishna’s wisdom, free from egoistic delusions."
      },
      "slok16": {
        "sanskrit": "अनेकचित्तविभ्रान्ता मोहजालसमावृताः। प्रसक्ताः कामभोगेषु पतन्ति नरकेऽशुचौ।।16.16।।",
        "transliteration": "aneka-citta-vibhrāntā moha-jāla-samāvṛtāḥ, prasaktāḥ kāma-bhogeṣu patanti narake ’śucau",
        "meaning": "Bewildered by many thoughts, entangled in delusion’s net, attached to sense pleasures, they fall into a foul hell.",
        "explanation": "Krishna describes demonic beings’ mental confusion, trapped by delusion and sense indulgence, leading to hell. This sloka warns of their downfall. For Arjuna, this urges clarity in war, avoiding delusion or sensory attachment, ensuring his actions align with dharma, preventing a fall into spiritual degradation."
      },
      "slok17": {
        "sanskrit": "आत्मसम्भाविताः स्तब्धा धनमानमदान्विताः। यजन्ते नामयज्ञैस्ते दम्भेनाविधिपूर्वकम्।।16.17।।",
        "transliteration": "ātma-sambhāvitāḥ stabdhā dhana-māna-madānvitāḥ, yajante nāma-yajñais te dambhenāvidhi-pūrvakam",
        "meaning": "Self-conceited, stubborn, intoxicated by wealth and pride, they perform sacrifices in name only, hypocritically, without following scriptural rules.",
        "explanation": "Krishna criticizes demonic beings’ hypocritical, prideful rituals, lacking scriptural adherence. This sloka highlights their superficiality. For Arjuna, this contrasts with his need to act with genuine devotion to Krishna, ensuring his warrior duties are true offerings, not ego-driven or hypocritical, aligned with divine principles."
      },
      "slok18": {
        "sanskrit": "अहङ्कारं बलं दर्पं कामं क्रोधं च संश्रिताः। मामात्मपरदेहेषु प्रद्विषन्तोऽभ्यसूयकाः।।16.18।।",
        "transliteration": "ahaṅkāraṁ balaṁ darpaṁ kāmaṁ krodhaṁ ca saṁśritāḥ, mām ātma-para-deheṣu pradviṣanto ’bhyasūyakāḥ",
        "meaning": "Given to egoism, power, arrogance, desire, and anger, they hate Me in their own and others’ bodies, envious by nature.",
        "explanation": "Krishna describes demonic beings’ ego, desire, and hatred toward him, envious of others. This sloka emphasizes their hostility to the divine. For Arjuna, this warns against ego or anger in war, urging him to honor Krishna in all beings, fighting with love and devotion, free from envy or hatred."
      },
      "slok19": {
        "sanskrit": "तानहं द्विषतः क्रूरान्संसारेषु नराधमान्। क्षिपाम्यजस्रमशुभानासुरीष्वेव योनिषु।।16.19।।",
        "transliteration": "tān ahaṁ dviṣataḥ krūrān saṁsāreṣu narādhamān, kṣipāmy ajasram aśubhān āsurīṣv eva yoniṣu",
        "meaning": "Those hateful, cruel, and vilest of men, I repeatedly cast into demonic wombs in the cycle of samsara, into inauspicious births.",
        "explanation": "Krishna states that he casts hateful demonic beings into lower births, perpetuating their bondage. This sloka outlines their karmic fate. For Arjuna, this reinforces the need to avoid cruelty in war, fighting with divine intent to escape such fates, ensuring his actions lead to liberation, not demonic rebirth."
      },
      "slok20": {
        "sanskrit": "आसुरीं योनिमापन्ना मूढा जन्मनि जन्मनि। मामप्राप्यैव कौन्तेय ततो यान्त्यधमां गतिम्।।16.20।।",
        "transliteration": "āsurīṁ yonim āpannā mūḍhā janmani janmani, mām aprāpyaiva kaunteya tato yānty adhamāṁ gatim",
        "meaning": "Attaining demonic births, deluded birth after birth, never reaching Me, O son of Kunti, they fall to the lowest state.",
        "explanation": "Krishna explains that demonic beings, trapped in delusion, never attain him, descending to lower states. This sloka emphasizes their spiritual failure. For Arjuna, this urges fighting with devotion to Krishna, avoiding delusion, ensuring his warrior duties lead to divine union, not the downward spiral of demonic existence."
      },
      "slok21": {
        "sanskrit": "त्रिविधं नरकस्येदं द्वारं नाशनमात्मनः। कामः क्रोधस्तथा लोभस्तस्मादेतत्त्रयं त्यजेत्।।16.21।।",
        "transliteration": "trividhaṁ narakasyedaṁ dvāraṁ nāśanam ātmanaḥ, kāmaḥ krodhas tathā lobhas tasmād etat trayaṁ tyajet",
        "meaning": "Threefold is the gate to hell, destructive to the self: lust, anger, and greed; therefore, one should abandon these three.",
        "explanation": "Krishna identifies lust, anger, and greed as the gateways to hell, urging their abandonment. This sloka highlights the root demonic traits. For Arjuna, this is a direct warning to relinquish these in war, fighting without desire, rage, or avarice, ensuring his actions align with divine qualities, leading to spiritual upliftment."
      },
      "slok22": {
        "sanskrit": "एतैर्विमुक्तः कौन्तेय तमोद्वारैस्त्रिभिर्नरः। आचरत्यात्मनः श्रेयस्ततो याति परां गतिम्।।16.22।।",
        "transliteration": "etair vimuktaḥ kaunteya tamo-dvārais tribhir naraḥ, ācaraty ātmanaḥ śreyas tato yāti parāṁ gatim",
        "meaning": "One who is freed from these three gates of darkness, O son of Kunti, acts for their own welfare and attains the supreme goal.",
        "explanation": "Krishna states that abandoning lust, anger, and greed leads to welfare and the supreme goal. This sloka offers hope for liberation. For Arjuna, this encourages fighting free from these vices, ensuring his warrior actions promote spiritual welfare, guiding him to Krishna’s supreme destination through righteous conduct."
      },
      "slok23": {
        "sanskrit": "यः शास्त्रविधिमुत्सृज्य वर्तते कामकारतः। न स सिद्धिमवाप्नोति न सुखं न परां गतिम्।।16.23।।",
        "transliteration": "yaḥ śāstra-vidhim utsṛjya vartate kāma-kārataḥ, na sa siddhim avāpnoti na sukhaṁ na parāṁ gatim",
        "meaning": "One who discards scriptural injunctions and acts according to desires attains neither perfection, happiness, nor the supreme goal.",
        "explanation": "Krishna warns that ignoring scriptures and acting on whims leads to failure in perfection and liberation. This sloka emphasizes scriptural guidance. For Arjuna, this urges adherence to Krishna’s teachings in war, avoiding desire-driven actions, ensuring his warrior duties align with dharma, leading to happiness and liberation."
      },
      "slok24": {
        "sanskrit": "तस्माच्छास्त्रं प्रमाणं ते कार्याकार्यव्यवस्थितौ। ज्ञात्वा शास्त्रविधानोक्तं कर्म कर्तुमिहार्हसि।।16.24।।",
        "transliteration": "tasmāc chāstraṁ pramāṇaṁ te kāryākārya-vyavasthitau, jñātvā śāstra-vidhānoktaṁ karma kartum ihārhasi",
        "meaning": "Therefore, let the scriptures be your authority in determining what should be done and what should not. Knowing the scriptural injunctions, you should act accordingly.",
        "explanation": "Krishna concludes Chapter 16, advising Arjuna to follow scriptures to discern right action. This sloka reinforces the importance of divine guidance. For Arjuna, this means fighting as per Krishna’s teachings, ensuring his warrior actions are righteous, aligned with scriptural wisdom, leading to liberation through dharmic duty."
      }
    }
  }
]
