[
  {
    "chapter11": {
      "title": "Vishvarupa Darshana Yoga (The Yoga of the Universal Form)",
      "description": "In Chapter 11, Krishna grants Arjuna a divine vision of his universal form, revealing his infinite, cosmic nature encompassing all existence, time, and destruction. Overwhelmed by awe and fear, Arjuna seeks to understand Krishna’s supremacy and surrenders to him, learning that devotion is the path to comprehend the divine. This vision strengthens Arjuna’s resolve to perform his warrior duties as an act of surrender to Krishna’s will.",
      "total_verses": 55,
      "slok1": {
        "sanskrit": "अर्जुन उवाच। मदनुग्रहाय परमं गुह्यमध्यात्मसंज्ञितम्। यत्त्वयोक्तं वचस्तेन मोहोऽयं विगतो मम।।11.1।।",
        "transliteration": "arjuna uvāca mad-anugrahāya paramaṁ guhyam adhyātma-saṁjñitam, yat tvayoktaṁ vacas tena moho ’yaṁ vigato mama",
        "meaning": "Arjuna said: By the supreme, confidential knowledge of the self that You have spoken for my benefit, my delusion has been dispelled.",
        "explanation": "Arjuna acknowledges that Krishna’s teachings in the previous chapters, especially the confidential spiritual knowledge, have removed his confusion. This sloka marks Arjuna’s growing clarity. For Arjuna, this clarity is crucial as a warrior facing the moral dilemma of war, enabling him to approach his duties with a clearer understanding of Krishna’s divine guidance."
      },
      "slok2": {
        "sanskrit": "भवाप्ययौ हि भूतानां श्रुतौ विस्तरशो मया। त्वत्तः कमलपत्राक्ष माहात्म्यमपि चाव्ययम्।।11.2।।",
        "transliteration": "bhavāpyayau hi bhūtānāṁ śrutau vistaraśo mayā, tvattaḥ kamala-patrākṣa māhātmyam api cāvyayam",
        "meaning": "I have heard from You in detail about the creation and dissolution of beings, O lotus-eyed one, and Your imperishable glory.",
        "explanation": "Arjuna confirms hearing Krishna’s teachings on the cosmic cycle of creation and dissolution, and his eternal glory. This sloka reflects his absorption of Krishna’s divine nature. For Arjuna, understanding Krishna’s cosmic role contextualizes the war’s transient nature, encouraging him to focus on eternal spiritual goals rather than temporary outcomes."
      },
      "slok3": {
        "sanskrit": "एवमेतद्यथात्थ त्वमात्मानं परमेश्वर। द्रष्टुमिच्छामि ते रूपमैश्वरं पुरुषोत्तम।।11.3।।",
        "transliteration": "evam etad yathāttha tvam ātmānaṁ parameśvara, draṣṭum icchāmi te rūpam aiśvaraṁ puruṣottama",
        "meaning": "It is as You have described Yourself, O Supreme Lord. I desire to see Your divine form, O Supreme Person.",
        "explanation": "Arjuna accepts Krishna’s self-description as the Supreme Lord and requests to witness his divine, cosmic form. This sloka shows Arjuna’s curiosity and devotion. For Arjuna, seeing Krishna’s universal form will solidify his faith, helping him perceive the war as part of Krishna’s divine plan, strengthening his resolve to fight."
      },
      "slok4": {
        "sanskrit": "मन्यसे यदि तच्छक्यं मया द्रष्टुमिति प्रभो। योगेश्वर ततो मे त्वं दर्शयात्मानमव्ययम्।।11.4।।",
        "transliteration": "manyase yadi tac chakyaṁ mayā draṣṭum iti prabho, yogeśvara tato me tvaṁ darśayātmānam avyayam",
        "meaning": "If You think it is possible for me to see it, O Lord, then, O Master of Yoga, show me Your imperishable Self.",
        "explanation": "Arjuna humbly asks Krishna to show his imperishable divine form, if Krishna deems him capable, addressing him as the master of Yoga. This sloka reflects Arjuna’s humility and trust. For Arjuna, this vision will provide spiritual conviction, enabling him to perform his warrior duties with the assurance of Krishna’s supreme authority over all existence."
      },
      "slok5": {
        "sanskrit": "श्रीभगवानुवाच। पश्य मे पार्थ रूपाणि शतशोऽथ सहस्रशः। नानाविधानि दिव्यानि नानावर्णाकृतीनि च।।11.5।।",
        "transliteration": "śrī bhagavān uvāca paśya me pārtha rūpāṇi śataśo ’tha sahasraśaḥ, nānā-vidhāni divyāni nānā-varṇa-ākṛtīni ca",
        "meaning": "The Supreme Lord said: Behold, O Partha, My forms, hundreds and thousands, divine, of various kinds, colors, and shapes.",
        "explanation": "Krishna invites Arjuna to witness his countless divine forms, diverse in type, color, and shape. This sloka initiates the revelation of his universal form. For Arjuna, this vision will reveal Krishna’s infinite nature, helping him see the war’s events as part of Krishna’s cosmic play, reinforcing his duty with divine perspective."
      },
      "slok6": {
        "sanskrit": "पश्यादित्यान्वसून्रुद्रानश्विनौ मरुतस्तथा। बहून्यदृष्टपूर्वं च पश्याश्चर्याणि भारत।।11.6।।",
        "transliteration": "paśyādityān vasūn rudrān aśvinau marutas tathā, bahūny adṛṣṭa-pūrvaṁ ca paśyāścaryāṇi bhārata",
        "meaning": "Behold the Adityas, Vasus, Rudras, Ashvins, and Maruts. See many wonders never seen before, O Bharata.",
        "explanation": "Krishna urges Arjuna to see celestial beings and unprecedented wonders within his universal form. This sloka expands the scope of the divine vision. For Arjuna, witnessing these cosmic entities will contextualize the war within Krishna’s vast creation, encouraging him to act with awe and devotion, aligned with divine will."
      },
      "slok7": {
        "sanskrit": "इहैकस्थं जगत्कृत्स्नं पश्याद्य सचराचरम्। मम देहे गुडाकेश यच्चान्यद् द्रष्टुमिच्छसि।।11.7।।",
        "transliteration": "ihaikasthaṁ jagat kṛtsnaṁ paśyādya sa-carācaram, mama dehe guḍākeśa yac cānyad draṣṭum icchasi",
        "meaning": "Now behold the entire universe, with all moving and non-moving beings, in My body, O Gudakesha, and whatever else you wish to see.",
        "explanation": "Krishna invites Arjuna to see the entire universe—animate and inanimate—within his form, fulfilling all of Arjuna’s desires to see. This sloka emphasizes the all-encompassing nature of the vision. For Arjuna, this holistic view will reveal the war’s insignificance in Krishna’s cosmic scope, urging him to fight as part of the divine order."
      },
      "slok8": {
        "sanskrit": "न तु मां शक्यसे द्रष्टुमनेनैव स्वचक्षुषा। दिव्यं ददामि ते चक्षुः पश्य मे योगमैश्वरम्।।11.8।।",
        "transliteration": "na tu māṁ śakyase draṣṭum anenaiva sva-cakṣuṣā, divyaṁ dadāmi te cakṣuḥ paśya me yogam aiśvaram",
        "meaning": "But you cannot see Me with your physical eyes. I give you divine vision; behold My supreme mystic power.",
        "explanation": "Krishna explains that Arjuna’s human eyes cannot perceive his universal form, so he grants divine vision. This sloka highlights the need for spiritual perception. For Arjuna, this divine vision will enable him to comprehend Krishna’s cosmic role, strengthening his resolve to perform warrior duties with a divine perspective, free from worldly limitations."
      },
      "slok9": {
        "sanskrit": "सञ्जय उवाच। एवमुक्त्वा ततो राजन्महायोगेश्वरो हरिः। दर्शयामास पार्थाय परमं रूपमैश्वरम्।।11.9।।",
        "transliteration": "sañjaya uvāca evam uktvā tato rājan mahā-yogeśvaro hariḥ, darśayām āsa pārthāya paramaṁ rūpam aiśvaram",
        "meaning": "Sanjaya said: Having thus spoken, O King, the great Lord of Yoga, Hari, showed Partha His supreme divine form.",
        "explanation": "Sanjaya narrates to Dhritarashtra that Krishna, the supreme Yogi, reveals his divine universal form to Arjuna. This sloka marks the actual revelation. For Arjuna, this moment is pivotal, as the vision will transform his understanding of Krishna, reinforcing his duty to fight as an instrument of the divine cosmic order."
      },
      "slok10": {
        "sanskrit": "अनेकवक्त्रनयनमनेकाद्भुतदर्शनम्। अनेकदिव्याभरणं दिव्यानेकोद्यतायुधम्।।11.10।।",
        "transliteration": "aneka-vaktra-nayanam anekādbhuta-darśanam, aneka-divyābharaṇaṁ divyānekodyatāyudham",
        "meaning": "With countless mouths and eyes, wondrous sights, many divine ornaments, and numerous divine weapons raised.",
        "explanation": "Sanjaya describes Krishna’s universal form with infinite mouths, eyes, wondrous visions, divine ornaments, and weapons. This sloka introduces the form’s majestic and awe-inspiring nature. For Arjuna, this vision reveals Krishna’s boundless power, encouraging him to see the war as a small part of Krishna’s divine arsenal, urging surrender to his will."
      },
      "slok11": {
        "sanskrit": "दिव्यमाल्याम्बरधरं दिव्यगन्धानुलेपनम्। सर्वाश्चर्यमयं देवमनन्तं विश्वतोमुखम्।।11.11।।",
        "transliteration": "divya-mālyāmbara-dharaṁ divya-gandhānu-lepanam, sarvāścaryamayaṁ devam anantaṁ viśvato-mukham",
        "meaning": "Adorned with divine garlands and garments, anointed with divine fragrances, all-wonderful, the infinite God, facing all directions.",
        "explanation": "The universal form is described as adorned with divine attire, fragrant, infinitely wondrous, and all-facing. This sloka emphasizes its divine splendor. For Arjuna, the form’s beauty and infinity inspire reverence, helping him view his warrior role as service to the infinite divine, aligning his actions with Krishna’s cosmic grandeur."
      },
      "slok12": {
        "sanskrit": "दिवि सूर्यसहस्रस्य भवेद्युगपदुत्थिता। यदि भाः सदृशी सा स्याद्भासस्तस्य महात्मनः।।11.12।।",
        "transliteration": "divi sūrya-sahasrasya bhaved yugapad utthitā, yadi bhāḥ sadṛśī sā syād bhāsas tasya mahātmanaḥ",
        "meaning": "If a thousand suns were to rise at once in the sky, their brilliance might resemble the splendor of that great soul.",
        "explanation": "Sanjaya compares the universal form’s radiance to a thousand suns, highlighting its overwhelming brilliance. This sloka conveys the form’s intense glory. For Arjuna, this brilliance underscores Krishna’s supreme power, encouraging him to approach the war with humility, recognizing that all outcomes are governed by Krishna’s radiant will."
      },
      "slok13": {
        "sanskrit": "तत्रैकस्थं जगत्कृत्स्नं प्रविभक्तमनेकधा। अपश्यद् देवदेवस्य शरीरे पाण्डवस्तदा।।11.13।।",
        "transliteration": "tatraikasthaṁ jagat kṛtsnaṁ pravibhaktam anekadhā, apaśyad deva-devasya śarīre pāṇḍavas tadā",
        "meaning": "There, in the body of the God of gods, the Pandava saw the entire universe, unified yet divided in many ways.",
        "explanation": "Arjuna beholds the entire universe, both unified and diverse, within Krishna’s form. This sloka emphasizes the form’s all-encompassing nature. For Arjuna, seeing the war’s participants and events within Krishna’s body reveals their divine orchestration, urging him to act as Krishna’s instrument, free from personal attachment."
      },
      "slok14": {
        "sanskrit": "ततः स विस्मयाविष्टो हृष्टरोमा धनञ्जयः। प्रणम्य शिरसा देवं कृताञ्जलिरभाषत।।11.14।।",
        "transliteration": "tataḥ sa vismayāviṣṭo hṛṣṭa-romā dhanañjayaḥ, praṇamya śirasā devaṁ kṛtāñjalir abhāṣata",
        "meaning": "Then, filled with wonder, his hairs standing on end, Dhananjaya bowed his head to the Lord, joined his palms, and spoke.",
        "explanation": "Overwhelmed with awe, Arjuna’s hairs stand on end, and he bows with folded hands, preparing to speak. This sloka captures his emotional response to the vision. For Arjuna, this awe transforms his perspective, reinforcing his submission to Krishna, enabling him to approach his warrior duties with reverence and surrender."
      },
      "slok15": {
        "sanskrit": "अर्जुन उवाच। पश्यामि देवांस्तव देव देहे सर्वंस्तथा भूतविशेषसङ्घान्। ब्रह्माणमीशं कमलासनस्थमृषींश्च सर्वानुरगांश्च दिव्यान्।।11.15।।",
        "transliteration": "arjuna uvāca paśyāmi devāṁs tava deva dehe sarvāṁs tathā bhūta-viśeṣa-saṅghān, brahmāṇam īśaṁ kamalāsana-stham ṛṣīṁś ca sarvān uragāṁś ca divyān",
        "meaning": "Arjuna said: I see all the gods in Your body, O Lord, and hosts of various beings, Brahma seated on the lotus, all sages, and divine serpents.",
        "explanation": "Arjuna describes seeing gods, beings, Brahma, sages, and divine serpents within Krishna’s form, marveling at its inclusivity. This sloka reflects the vision’s vastness. For Arjuna, recognizing these divine entities within Krishna contextualizes the war as a divine event, urging him to act with devotion, aligned with the cosmic order."
      },
      "slok16": {
        "sanskrit": "अनेकबाहूदरवक्त्रनेत्रं पश्यामि त्वां सर्वतोऽनन्तरूपम्। नान्तं न मध्यं न पुनस्तवादिं पश्यामि विश्वेश्वर विश्वरूप।।11.16।।",
        "transliteration": "aneka-bāhūdara-vaktra-netraṁ paśyāmi tvāṁ sarvato ’nanta-rūpam, nāntaṁ na madhyaṁ na punas tavādiṁ paśyāmi viśveśvara viśva-rūpa",
        "meaning": "I see You with countless arms, bellies, mouths, and eyes, infinite in form on all sides. I see no end, middle, or beginning, O Lord of the universe, O universal form.",
        "explanation": "Arjuna describes Krishna’s form as infinite, with countless limbs and no discernible beginning, middle, or end. This sloka emphasizes the form’s boundless nature. For Arjuna, this infinity reveals Krishna’s supremacy over the war, encouraging him to surrender his actions to the limitless divine, acting without attachment to finite outcomes."
      },
      "slok17": {
        "sanskrit": "किरीटिनं गदिनं चक्रिणं च तेजोराशिं सर्वतो दीप्तिमन्तम्। पश्यामि त्वां दुर्निरीक्ष्यं समन्ताद् दीप्तानलार्कद्युतिमप्रमेयम्।।11.17।।",
        "transliteration": "kirīṭinaṁ gadinaṁ cakriṇaṁ ca tejo-rāśiṁ sarvato dīptimantam, paśyāmi tvāṁ durnirīkṣyaṁ samantād dīptānalārka-dyutim aprameyam",
        "meaning": "I see You with crowns, maces, and discs, a mass of radiance shining everywhere, difficult to behold, blazing like fire and the sun, immeasurable.",
        "explanation": "Arjuna describes Krishna’s form adorned with divine symbols, radiating blinding light, impossible to fully behold. This sloka highlights the form’s overwhelming brilliance. For Arjuna, this radiance underscores Krishna’s divine power, inspiring him to approach the war with humility, recognizing that Krishna’s light governs all battlefield events."
      },
      "slok18": {
        "sanskrit": "त्वमक्षरं परमं वेदितव्यं त्वमस्य विश्वस्य परं निधानम्। त्वमव्ययः शाश्वतधर्मगोप्ता सनातनस्त्वं पुरुषो मतो मे।।11.18।।",
        "transliteration": "tvam akṣaraṁ paramaṁ veditavyaṁ tvam asya viśvasya paraṁ nidhānam, tvam avyayaḥ śāśvata-dharma-goptā sanātanas tvaṁ puruṣo mato me",
        "meaning": "You are the imperishable, the supreme to be known; You are the ultimate refuge of this universe; You are the eternal protector of dharma, the everlasting Person, I believe.",
        "explanation": "Arjuna praises Krishna as the imperishable supreme, the universe’s refuge, and the eternal protector of dharma. This sloka reflects his realization of Krishna’s divinity. For Arjuna, this understanding confirms Krishna’s authority over the war, urging him to fight as a defender of dharma under Krishna’s eternal guidance, ensuring spiritual alignment."
      },
      "slok19": {
        "sanskrit": "अनादिमध्यान्तमनन्तवीर्यं अनन्तबाहुं शशिसूर्यनेत्रम्। पश्यामि त्वां दीप्तहुताशवक्त्रं स्वतेजसा विश्वमिदं तपन्तम्।।11.19।।",
        "transliteration": "anādi-madhyāntam ananta-vīryaṁ ananta-bāhuṁ śaśi-sūrya-netram, paśyāmi tvāṁ dīpta-hutāśa-vaktraṁ sva-tejasā viśvam idaṁ tapantam",
        "meaning": "I see You without beginning, middle, or end, with infinite power, countless arms, the sun and moon as Your eyes, Your mouth blazing like fire, heating the universe with Your radiance.",
        "explanation": "Arjuna describes Krishna’s form as infinite, powerful, with celestial eyes and fiery mouths, radiating heat. This sloka emphasizes the form’s cosmic and destructive aspects. For Arjuna, this vision of Krishna’s power over creation and destruction contextualizes the war’s violence, urging him to act as Krishna’s instrument, detached from personal outcomes."
      },
      "slok20": {
        "sanskrit": "द्यावापृथिव्योरिदमन्तरं हि व्याप्तं त्वयैकेन दिशश्च सर्वाः। दृष्ट्वाद्भुतं रूपमुग्रं तवेदं लोकत्रयं प्रव्यथितं महात्मन्।।11.20।।",
        "transliteration": "dyāv-āpṛthivyor idam antaraṁ hi vyāptaṁ tvayaikena diśaś ca sarvāḥ, dṛṣṭvādbhutaṁ rūpam ugraṁ tavedaṁ loka-trayaṁ pravyathitaṁ mahātman",
        "meaning": "This space between heaven and earth and all directions is pervaded by You alone. Seeing this wondrous, terrible form, the three worlds tremble, O great soul.",
        "explanation": "Arjuna notes that Krishna’s form fills all space and directions, causing the three worlds to tremble at its fearsome wonder. This sloka highlights the form’s terrifying impact. For Arjuna, the trembling worlds reflect the war’s chaos, urging him to surrender to Krishna’s terrifying yet divine will, performing his duties with reverence."
      },
      "slok21": {
        "sanskrit": "अमी हि त्वां सुरसङ्घा विशन्ति केचिद्भीताः प्राञ्जलयो गृणन्ति। स्वस्तीत्युक्त्वा महर्षिसिद्धसङ्घाः स्तुवन्ति त्वां स्तुतिभिः पुष्कलाभिः।।11.21।।",
        "transliteration": "amī hi tvāṁ sura-saṅghā viśanti kecid bhītāḥ prāñjalayo gṛṇanti, svastīty uktvā maharṣi-siddha-saṅghāḥ stuvanti tvāṁ stutibhiḥ puṣkalābhiḥ",
        "meaning": "Hosts of gods enter You; some, in fear, praise You with folded hands. Groups of great sages and perfected beings say ‘Svasti’ and glorify You with abundant hymns.",
        "explanation": "Arjuna observes gods entering Krishna’s form, some praising him fearfully, while sages and siddhas offer hymns. This sloka depicts the cosmic response to Krishna’s form. For Arjuna, this shows even divine beings revere Krishna, urging him to approach his warrior role with similar devotion and humility, aligning with the cosmic order."
      },
      "slok22": {
        "sanskrit": "रुद्रादित्या वसवो ये च साध्या विश्वेऽश्विनौ मरुतश्चोष्मपाश्च। गन्धर्वयक्षासुरसिद्धसङ्घा वीक्षन्ते त्वां विस्मिताश्चैव सर्वे।।11.22।।",
        "transliteration": "rudrādityā vasavo ye ca sādhyā viśve ’śvinau marutaś coṣmapāś ca, gandharva-yakṣāsura-siddha-saṅghā vīkṣante tvāṁ vismitāś caiva sarve",
        "meaning": "The Rudras, Adityas, Vasus, Sadhyas, Vishvedevas, Ashvins, Maruts, ancestors, Gandharvas, Yakshas, Asuras, and Siddhas—all gaze at You in amazement.",
        "explanation": "Arjuna lists various celestial beings gazing at Krishna’s form in awe, emphasizing its universal impact. This sloka underscores the form’s awe-inspiring nature. For Arjuna, the collective amazement of divine beings reinforces Krishna’s supremacy, encouraging him to fight with the awareness that the war is part of Krishna’s cosmic spectacle."
      },
      "slok23": {
        "sanskrit": "रूपं महत्ते बहुवक्त्रनेत्रं महाबाहो बहुबाहूरुपादम्। बहूदरं बहुदंष्ट्राकरालं दृष्ट्वा लोकाः प्रव्यथितास्तथाहम्।।11.23।।",
        "transliteration": "rūpaṁ mahat te bahu-vaktra-netraṁ mahā-bāho bahu-bāhūru-pādam, bahūdaraṁ bahu-daṁṣṭrā-karālaṁ dṛṣṭvā lokāḥ pravyathitās tathāham",
        "meaning": "Seeing Your great form with many mouths, eyes, arms, thighs, feet, bellies, and terrifying tusks, the worlds tremble, and so do I, O mighty-armed.",
        "explanation": "Arjuna describes the form’s terrifying features, causing both him and the worlds to tremble. This sloka highlights the form’s fearsome aspect. For Arjuna, this fear reflects the war’s daunting nature, urging him to surrender to Krishna’s terrifying yet divine will, performing his duties with humility and trust in divine protection."
      },
      "slok24": {
        "sanskrit": "नभःस्पृशं दीप्तमनेकवर्णं व्यात्ताननं दीप्तविशालनेत्रम्। दृष्ट्वा हि त्वां प्रव्यथितान्तरात्मा धृतिं न विन्दामि शमं च विष्णो।।11.24।।",
        "transliteration": "nabhaḥ-spṛśaṁ dīptam aneka-varṇaṁ vyāttānanam dīpta-viśāla-netram, dṛṣṭvā hi tvāṁ pravyathitāntar-ātmā dhṛtiṁ na vindāmi śamaṁ ca viṣṇo",
        "meaning": "Seeing You touching the sky, blazing, multicolored, with gaping mouths and large, fiery eyes, my inner self trembles, and I find neither courage nor peace, O Vishnu.",
        "explanation": "Arjuna, overwhelmed by the form’s cosmic scale and fiery features, loses courage and peace. This sloka conveys his fear and disorientation. For Arjuna, this mirrors his war-related fears, urging him to seek refuge in Krishna, transforming his warrior role into an act of surrender to the divine, restoring spiritual stability."
      },
      "slok25": {
        "sanskrit": "दंष्ट्राकरालानि च ते मुखानि दृष्ट्वैव कालानलसन्निभानि। दिशो न जाने न लभे च शर्म प्रसीद देवेश जगन्निवास।।11.25।।",
        "transliteration": "daṁṣṭrā-karālāni ca te mukhāni dṛṣṭvaiva kālānala-sannibhāni, diśo na jāne na labhe ca śarma prasīda deveśa jagan-nivāsa",
        "meaning": "Seeing Your terrifying mouths with dreadful teeth, like the fire of time, I lose my sense of direction and find no comfort. Be gracious, O Lord of gods, abode of the universe.",
        "explanation": "Arjuna, terrified by the form’s destructive mouths, pleads for Krishna’s mercy, disoriented and comfortless. This sloka reflects his plea for reassurance. For Arjuna, the form’s destructive aspect parallels the war’s violence, urging him to seek Krishna’s grace to find peace, performing his duties with faith in divine compassion."
      },
      "slok26": {
        "sanskrit": "अमी च त्वां धृतराष्ट्रस्य पुत्राः सर्वं सहैवावनिपालसङ्घैः। भीष्मो द्रोणः सूतपुत्रस्तथासौ सहास्मदीयैरपि योधमुख्यैः।।11.26।।",
        "transliteration": "amī ca tvāṁ dhṛtarāṣṭrasya putrāḥ sarvaṁ sahaivāvani-pāla-saṅghaiḥ, bhīṣmo droṇaḥ sūta-putras tathāsau sahāsmadīyair api yodha-mukhyaiḥ",
        "meaning": "All the sons of Dhritarashtra, along with hosts of kings, Bhishma, Drona, and Karna, together with our chief warriors,",
        "explanation": "Arjuna sees the Kaurava warriors, including Bhishma, Drona, and Karna, within Krishna’s form, indicating their fate. This sloka begins the vision of the war’s destruction. For Arjuna, seeing his enemies and allies in Krishna’s form reveals the war’s divine orchestration, urging him to fight as Krishna’s instrument, detached from personal enmity."
      },
      "slok27": {
        "sanskrit": "वक्त्राणि ते त्वरमाणा विशन्ति दंष्ट्राकरालानि भयानकानि। केचिद्विलग्ना दशनान्तरेषु सन्दृश्यन्ते चूर्णितैरुत्तमाङ्गैः।।11.27।।",
        "transliteration": "vaktrāṇi te tvaramāṇā viśanti daṁṣṭrā-karālāni bhayānakāni, kecid vilagnā daśanāntareṣu sandṛśyante cūrṇitair uttamāṅgaiḥ",
        "meaning": "Rush into Your terrifying mouths with dreadful teeth; some are seen caught between Your teeth, their heads crushed.",
        "explanation": "Arjuna describes warriors rushing into Krishna’s terrifying mouths, some crushed between teeth. This sloka vividly portrays the form’s destructive power. For Arjuna, this vision of inevitable death in the war underscores Krishna’s role as time, urging him to fight without attachment, knowing all outcomes are divinely ordained."
      },
      "slok28": {
        "sanskrit": "यथा नदीनां बहवोऽम्बुवेगाः समुद्रमेवाभिमुखाः द्रवन्ति। तथा तवामी नरलोकवीरा विशन्ति वक्त्राण्यभिविज्वलन्ति।।11.28।।",
        "transliteration": "yathā nadīnāṁ bahavo ’mbu-vegāḥ samudram evābhimukhāḥ dravanti, tathā tavāmī nara-loka-vīrā viśanti vaktrāṇy abhivijvalanti",
        "meaning": "As the many currents of rivers flow toward the ocean, so these heroes of the human world rush into Your flaming mouths.",
        "explanation": "Arjuna compares warriors entering Krishna’s fiery mouths to rivers flowing into the ocean, emphasizing inevitability. This sloka reinforces the form’s all-consuming nature. For Arjuna, this analogy highlights the war’s warriors meeting their fate in Krishna’s will, urging him to act without personal involvement, surrendered to divine inevitability."
      },
      "slok29": {
        "sanskrit": "यथा प्रदीप्तं ज्वलनं पतङ्गा विशन्ति नाशाय समृद्धवेगाः। तथैव नाशाय विशन्ति लोकास्तवापि वक्त्राणि समृद्धवेगाः।।11.29।।",
        "transliteration": "yathā pradīptaṁ jvalanaṁ pataṅgā viśanti nāśāya samṛddha-vegāḥ, tathaiva nāśāya viśanti lokās tavāpi vaktrāṇi samṛddha-vegāḥ",
        "meaning": "As moths rush swiftly into a blazing fire for destruction, so too do these worlds rush into Your mouths for destruction.",
        "explanation": "Arjuna likens warriors to moths drawn to a fire, rushing to their doom in Krishna’s mouths. This sloka underscores the form’s destructive irresistibility. For Arjuna, this vision of inevitable destruction in the war urges him to detach from outcomes, performing his warrior duties as an offering to Krishna’s cosmic will."
      },
      "slok30": {
        "sanskrit": "लेलिह्यसे ग्रसमानः समन्ताल्लोकान्समग्रान्वदनैर्ज्वलद्भिः। तेजोभिरापूर्य जगत्समग्रं भासस्तवोग्राः प्रतपन्ति विष्णो।।11.30।।",
        "transliteration": "lelihyase grasamānaḥ samantāl lokān samagrān vadanair jvaladbhiḥ, tejobhir āpūrya jagat samagraṁ bhāsas tavo grāḥ pratapanti viṣṇo",
        "meaning": "You devour all worlds from all sides with Your flaming mouths; Your fierce rays, filling the universe with radiance, scorch it, O Vishnu.",
        "explanation": "Arjuna describes Krishna’s form consuming worlds with fiery mouths, its radiance scorching the universe. This sloka emphasizes the form’s all-devouring power. For Arjuna, this vision of universal destruction parallels the war’s violence, urging him to surrender to Krishna’s fierce will, acting as a warrior without fear or attachment."
      },
      "slok31": {
        "sanskrit": "आख्याहि मे को भवानुग्ररूपो नमोऽस्तु ते देववर प्रसीद। विज्ञातुमिच्छामि भवन्तमाद्यं न हि प्रजानामि तव प्रवृत्तिम्।।11.31।।",
        "transliteration": "ākhyāhi me ko bhavān ugra-rūpo namo ’stu te deva-vara prasīda, vijñātum icchāmi bhavantam ādyaṁ na hi prajānāmi tava pravṛttim",
        "meaning": "Tell me who You are, so fierce in form. I bow to You, O greatest of gods; be merciful. I wish to know You, the primal one, for I do not understand Your actions.",
        "explanation": "Terrified, Arjuna asks Krishna to reveal his identity and purpose, offering obeisance and seeking mercy. This sloka reflects his confusion and desire for clarity. For Arjuna, this plea mirrors his need to understand the war’s divine purpose, urging him to seek Krishna’s guidance to align his warrior actions with divine intent."
      },
      "slok32": {
        "sanskrit": "श्रीभगवानुवाच। कालोऽस्मि लोकक्षयकृत्प्रवृद्धो लोकान्समाहर्तुमिह प्रवृत्तः। ऋतेऽपि त्वां न भविष्यन्ति सर्वे येऽवस्थिताः प्रत्यनीकेषु योधाः।।11.32।।",
        "transliteration": "śrī bhagavān uvāca kālo ’smi loka-kṣaya-kṛt pravṛddho lokān samāhartum iha pravṛttaḥ, ṛte ’pi tvāṁ na bhaviṣyanti sarve ye ’vasthitāḥ pratyanīkeṣu yodhāḥ",
        "meaning": "The Supreme Lord said: I am time, the destroyer of worlds, grown mighty, engaged here in annihilating all. Even without you, all the warriors in the opposing armies will cease to be.",
        "explanation": "Krishna reveals himself as time, the destroyer, stating that all warriors are doomed regardless of Arjuna’s actions. This sloka emphasizes the inevitability of death. For Arjuna, this clarifies that the war’s outcome is predestined, urging him to fight as Krishna’s instrument, detached from personal responsibility for the destruction."
      },
      "slok33": {
        "sanskrit": "तस्मात्त्वमुत्तिष्ठ यशो लभस्व जित्वा शत्रून्भुङ्क्ष्व राज्यं समृद्धम्। मयैवैते निहताः पूर्वमेव निमित्तमात्रं भव सव्यसाचिन्।।11.33।।",
        "transliteration": "tasmāt tvam uttiṣṭha yaśo labhasva jitvā śatrūn bhuṅkṣva rājyaṁ samṛddham, mayaivaite nihatāḥ pūrvam eva nimitta-mātraṁ bhava savyasācin",
        "meaning": "Therefore, arise, gain fame, conquer your enemies, and enjoy a prosperous kingdom. These warriors have already been slain by Me; be merely My instrument, O skilled archer.",
        "explanation": "Krishna instructs Arjuna to rise, fight, and achieve glory, as the enemies are already destined to die by Krishna’s will. This sloka emphasizes Arjuna’s role as an instrument. For Arjuna, this directive resolves his hesitation, urging him to fight with confidence, knowing the war’s outcome is Krishna’s doing, not his own."
      },
      "slok34": {
        "sanskrit": "द्रोणं च भीष्मं च जयद्रथं च कर्णं तथान्यानपि योधवीरान्। मया हतांस्त्वं जहि मा व्यथिष्ठा युध्यस्व जेतासि रणे सपत्नान्।।11.34।।",
        "transliteration": "droṇaṁ ca bhīṣmaṁ ca jayadrathaṁ ca karṇaṁ tathānyān api yodha-vīrān, mayā hatāṁs tvaṁ jahi mā vyathiṣṭhā yudhyasva jetāsi raṇe sapatnān",
        "meaning": "Drona, Bhishma, Jayadratha, Karna, and other brave warriors have been slain by Me. Kill them, do not be disturbed; fight, and you will conquer your enemies in battle.",
        "explanation": "Krishna lists key warriors already destined for death, urging Arjuna to fight without distress, assuring victory. This sloka reinforces Arjuna’s role as Krishna’s tool. For Arjuna, this assurance alleviates his guilt, encouraging him to fight key opponents with resolve, knowing their fate is sealed by Krishna’s divine will."
      },
      "slok35": {
        "sanskrit": "सञ्जय उवाच। एतच्छ्रुत्वा वचनं केशवस्य कृताञ्जलिर्वेपमानः किरीटी। नमस्कृत्वा भूय एवाह कृष्णं सगद्गदं भीतभीतः प्रणम्य।।11.35।।",
        "transliteration": "sañjaya uvāca etac chrutvā vacanaṁ keśavasya kṛtāñjalir vepamānaḥ kirītī, namaskṛtvā bhūya evāha kṛṣṇaṁ sa-gadgadaṁ bhīta-bhītaḥ praṇamya",
        "meaning": "Sanjaya said: Hearing Keshava’s words, Kiriti, trembling, with folded hands, bowing again, spoke to Krishna in a faltering voice, overcome with fear.",
        "explanation": "Sanjaya describes Arjuna’s trembling response to Krishna’s revelation, bowing and speaking fearfully. This sloka captures Arjuna’s emotional turmoil. For Arjuna, this fear reflects his awe at Krishna’s power, urging him to surrender fully, transforming his warrior duties into acts of devotion, guided by Krishna’s supreme authority."
      },
      "slok36": {
        "sanskrit": "अर्जुन उवाच। स्थाने हृषीकेश तव प्रकीर्त्या जगत्प्रहृष्यत्यनुरज्यति च। रक्षांसि भीतानि दिशो द्रवन्ति सर्वं नमस्यति च सिद्धसङ्घाः।।11.36।।",
        "transliteration": "arjuna uvāca sthāne hṛṣīkeśa tava prakīrtyā jagat prahṛṣyaty anurajyati ca, rakṣāṁsi bhītāni diśo dravanti sarvaṁ namasyati ca siddha-saṅghāḥ",
        "meaning": "Arjuna said: Rightly, O Hrishikesha, the world delights and rejoices in Your glory. Demons flee in fear, and hosts of perfected beings bow to You.",
        "explanation": "Arjuna praises Krishna, noting that his glory brings joy to the world, frightens demons, and prompts siddhas to bow. This sloka reflects his renewed reverence. For Arjuna, this universal response to Krishna’s glory inspires him to align his warrior actions with Krishna’s divine will, acting with devotion amidst the war’s chaos."
      },
      "slok37": {
        "sanskrit": "कस्माच्च ते न नमेरन्महात्मन् गरीयसे ब्रह्मणोऽप्यादिकर्त्रे। अनन्त देवेश जगन्निवास त्वमक्षरं सदसत्तत्परं यत्।।11.37।।",
        "transliteration": "kasmāc ca te na nameran mahātman garīyase brahmaṇo ’py ādi-kartre, ananta deveśa jagan-nivāsa tvam akṣaraṁ sad-asat-tat-paraṁ yat",
        "meaning": "Why should they not bow to You, O great soul, greater than Brahma, the primal creator? O infinite Lord of gods, abode of the universe, You are the imperishable, beyond being and non-being.",
        "explanation": "Arjuna questions why anyone would not bow to Krishna, greater than Brahma, the infinite, imperishable reality. This sloka exalts Krishna’s supremacy. For Arjuna, this realization reinforces Krishna’s authority over the war, urging him to surrender his warrior role to the infinite divine, ensuring his actions align with eternal truth."
      },
      "slok38": {
        "sanskrit": "त्वमादिदेवः पुरुषः पुराणस्त्वमस्य विश्वस्य परं निधानम्। वेत्ता च वेद्यं च परं च धाम त्वया ततं विश्वमनन्तरूप।।11.38।।",
        "transliteration": "tvam ādi-devaḥ puruṣaḥ purāṇas tvam asya viśvasya paraṁ nidhānam, vettā ca vedyaṁ ca paraṁ ca dhāma tvayā tataṁ viśvam ananta-rūpa",
        "meaning": "You are the primal God, the ancient Person, the supreme refuge of this universe, the knower, the known, and the supreme abode. The universe is pervaded by You, O infinite form.",
        "explanation": "Arjuna glorifies Krishna as the primal, eternal God, the universe’s refuge, and all-pervading reality. This sloka emphasizes Krishna’s all-encompassing nature. For Arjuna, this vision of Krishna’s universality contextualizes the war, urging him to act as a warrior within Krishna’s infinite framework, dedicated to the supreme divine."
      },
      "slok39": {
        "sanskrit": "वायुर्यमोऽग्निर्वरुणः शशाङ्कः प्रजापतिस्त्वं प्रपितामहश्च। नमो नमस्तेऽस्तु सहस्रकृत्वः पुनश्च भूयोऽपि नमो नमस्ते।।11.39।।",
        "transliteration": "vāyur yamo ’gnir varuṇaḥ śaśāṅkaḥ prajāpatis tvaṁ prapitāmahaś ca, namo namas te ’stu sahasra-kṛtvaḥ punaś ca bhūyo ’pi namo namas te",
        "meaning": "You are Vayu, Yama, Agni, Varuna, the moon, Prajapati, and the great-grandfather. I bow to You a thousand times, and again and again I bow to You.",
        "explanation": "Arjuna identifies Krishna with cosmic deities and ancestors, offering repeated obeisance. This sloka reflects his profound devotion and awe. For Arjuna, recognizing Krishna in cosmic forces inspires him to see the war as Krishna’s domain, urging him to perform his warrior duties as an act of continuous reverence to the divine."
      },
      "slok40": {
        "sanskrit": "नमः पुरस्तादथ पृष्ठतस्ते नमोऽस्तु ते सर्वतो एव सर्व। अनन्तवीर्यामितविक्रमस्त्वं सर्वं समाप्नोषि ततोऽसि सर्वः।।11.40।।",
        "transliteration": "namaḥ purastād atha pṛṣṭhatas te namo ’stu te sarvato eva sarva, ananta-vīryāmita-vikramas tvaṁ sarvaṁ samāpnoṣi tato ’si sarvaḥ",
        "meaning": "Obeisance to You from front, behind, and all sides, O all! With infinite power and boundless valor, You pervade all; thus, You are all.",
        "explanation": "Arjuna offers obeisance to Krishna from all directions, recognizing his infinite power and all-pervading nature. This sloka emphasizes Krishna’s omnipresence. For Arjuna, this omnipresence means the war is enveloped by Krishna, urging him to fight with the awareness that all actions occur within Krishna’s infinite presence, dedicated to him."
      },
      "slok41": {
        "sanskrit": "सखेति मत्वा प्रसभं यदुक्तं हे कृष्ण हे यादव हे सखेति। अजानता महिमानं तवेदं मया प्रमादात्प्रणयेन वापि।।11.41।।",
        "transliteration": "sakheti matvā prasabhaṁ yad uktaṁ he kṛṣṇa he yādava he sakheti, ajānatā mahimānaṁ tavedaṁ mayā pramādāt praṇayena vāpi",
        "meaning": "Whatever I have said rashly, thinking You a friend, calling You ‘O Krishna, O Yadava, O friend,’ ignorant of Your greatness, out of negligence or affection,",
        "explanation": "Arjuna apologizes for addressing Krishna casually, unaware of his divine greatness. This sloka reflects his humility and regret. For Arjuna, this acknowledgment deepens his reverence, urging him to approach his warrior duties with greater respect for Krishna’s divinity, transforming his actions into acts of devotion."
      },
      "slok42": {
        "sanskrit": "यच्चावहासार्थमसत्कृतोऽसि विहारशय्यासनभोजनेषु। एकोऽथवाप्यच्युत तत्समक्षं तत्क्षामये त्वामहमप्रमेयम्।।11.42।।",
        "transliteration": "yac cāvahāsārtham asatkṛto ’si vihāra-śayyāsana-bhojaneṣu, eko ’thavāpy acyuta tat-samakṣaṁ tat kṣāmaye tvām aham aprameyam",
        "meaning": "And for whatever disrespect I showed You in jest, while sporting, resting, sitting, or eating, alone or in others’ presence, O infallible one, I seek Your forgiveness, O immeasurable.",
        "explanation": "Arjuna seeks forgiveness for any disrespectful behavior toward Krishna, recognizing his immeasurable nature. This sloka continues his repentance. For Arjuna, this humility prepares him to serve Krishna with sincerity, ensuring his warrior actions are performed with the reverence due to the supreme Lord, aligning with divine will."
      },
      "slok43": {
        "sanskrit": "पितासि लोकस्य चराचरस्य त्वमस्य पूज्यश्च गुरुर्गरीयान्। न त्वत्समोऽस्त्यभ्यधिकः कुतोऽन्यो लोकत्रयेऽपि न विद्यते।।11.43।।",
        "transliteration": "pitāsi lokasya carācarasya tvam asya pūjyaś ca gurur garīyān, na tvat-samo ’sty abhyadhikaḥ kuto ’nyo loka-traye ’pi na vidyate",
        "meaning": "You are the father of this world, moving and non-moving, its revered teacher, and most venerable. None is equal to You, nor greater, in the three worlds.",
        "explanation": "Arjuna glorifies Krishna as the universe’s father, teacher, and unequaled supreme. This sloka emphasizes Krishna’s unparalleled status. For Arjuna, this recognition elevates Krishna above all, urging him to surrender his warrior role to the supreme teacher, ensuring his actions in the war are guided by divine reverence."
      },
      "slok44": {
        "sanskrit": "तस्मात्प्रणम्य प्रणिधाय कायं प्रसादये त्वामहमीशमीड्यम्। पितेव पुत्रस्य सखेव सख्युः प्रियः प्रियायार्हसि देव सोढुम्।।11.44।।",
        "transliteration": "tasmāt praṇamya praṇidhāya kāyaṁ prasādaye tvām aham īśam īḍyam, piteva putrasya sakheva sakhyuḥ priyaḥ priyāyārhasi deva soḍhum",
        "meaning": "Therefore, bowing down, prostrating my body, I seek Your grace, O adorable Lord. As a father forgives his son, a friend his friend, a lover his beloved, please bear with me, O God.",
        "explanation": "Arjuna prostrates, seeking Krishna’s forgiveness, likening their bond to familial and affectionate relationships. This sloka reflects his submission and plea for mercy. For Arjuna, this surrender transforms his warrior duties into acts of devotion, trusting Krishna’s compassion to guide him through the war’s challenges with divine forgiveness."
      },
      "slok45": {
        "sanskrit": "अदृष्टपूर्वं हृषितोऽस्मि दृष्ट्वा भयेन च प्रव्यथितं मनो मे। तदेव मे दर्शय देवरूपं प्रसीद देवेश जगन्निवास।।11.45।।",
        "transliteration": "adṛṣṭa-pūrvaṁ hṛṣito ’smi dṛṣṭvā bhayena ca pravyathitaṁ mano me, tad eva me darśaya deva-rūpaṁ prasīda deveśa jagan-nivāsa",
        "meaning": "I am delighted to see what was never seen before, yet my mind is troubled with fear. Show me that divine form alone, O Lord of gods, abode of the universe; be gracious.",
        "explanation": "Arjuna expresses joy at the unprecedented vision but admits fear, requesting Krishna’s gentler form. This sloka balances awe and fear. For Arjuna, this duality mirrors his war-related emotions, urging him to seek Krishna’s compassionate form to find peace, performing his duties with devotion to the approachable divine."
      },
      "slok46": {
        "sanskrit": "किरीटिनं गदिनं चक्रहस्तं इच्छामि त्वां द्रष्टुमहं तथैव। तेनैव रूपेण चतुर्भुजेन सहस्रबाहो भव विश्वमूर्ते।।11.46।।",
        "transliteration": "kirīṭinaṁ gadinaṁ cakra-hastaṁ icchāmi tvāṁ draṣṭum ahaṁ tathaiva, tenaiva rūpeṇa catur-bhujena sahasra-bāho bhava viśva-mūrte",
        "meaning": "I wish to see You as before, with crown, mace, and disc in hand, in that four-armed form, O thousand-armed one, universal form.",
        "explanation": "Arjuna specifically requests Krishna’s familiar four-armed Vishnu form, finding the universal form too overwhelming. This sloka shows his preference for a relatable divine image. For Arjuna, this gentler form will restore his confidence, enabling him to fight with devotion to a familiar Krishna, aligning his warrior role with divine intimacy."
      },
      "slok47": {
        "sanskrit": "श्रीभगवानुवाच। मया प्रसन्नेन तवार्जुनेदं रूपं परं दर्शितमात्मयोगात्। तेजोमयं विश्वमनन्तमाद्यं यन्मे त्वदन्येन न दृष्टपूर्वम्।।11.47।।",
        "transliteration": "śrī bhagavān uvāca mayā prasannena tavārjunedaṁ rūpaṁ paraṁ darśitam ātma-yogāt, tejo-mayaṁ viśvam anantam ādyaṁ yan me tvad-anyena na dṛṣṭa-pūrvam",
        "meaning": "The Supreme Lord said: Out of grace, O Arjuna, I have shown you this supreme form by My own Yoga, radiant, universal, infinite, primal, which none but you has seen before.",
        "explanation": "Krishna explains that he revealed the universal form out of grace, a unique vision granted only to Arjuna. This sloka emphasizes the privilege of the vision. For Arjuna, this special grace strengthens his bond with Krishna, urging him to fight with gratitude, knowing his warrior role is divinely sanctioned by Krishna’s favor."
      },
      "slok48": {
        "sanskrit": "न वेदयज्ञाध्ययनैर्न दानैर्न च क्रियाभिर्न तपोभिरुग्रैः। एवंरूपः शक्य अहं नृलोके द्रष्टुं त्वदन्येन कुरुप्रवीर।।11.48।।",
        "transliteration": "na veda-yajñādhyayanair na dānair na ca kriyābhir na tapobhir ugraiḥ, evaṁ-rūpaḥ śakya ahaṁ nṛ-loke draṣṭuṁ tvad-anyena kuru-pravīra",
        "meaning": "Not by Vedic study, sacrifices, charity, rituals, or severe austerities can I be seen in this form in the human world by anyone but you, O hero of the Kurus.",
        "explanation": "Krishna states that no spiritual practice can grant this vision except to Arjuna, highlighting its exclusivity. This sloka underscores Arjuna’s unique devotion. For Arjuna, this privilege reinforces his special relationship with Krishna, inspiring him to perform his warrior duties with dedication, knowing he is chosen for divine insight."
      },
      "slok49": {
        "sanskrit": "मा ते व्यथा मा च विमूढभावो दृष्ट्वा रूपं घोरमिदं ममेदम्। व्यपेतभीः प्रीतिमना पुनस्त्वं तदेव मे रूपमिदं प्रपश्य।।11.49।।",
        "transliteration": "mā te vyathā mā ca vimūḍha-bhāvo dṛṣṭvā rūpaṁ ghoram idaṁ mamedam, vyapeta-bhīḥ prīti-manā punas tvaṁ tad eva me rūpam idaṁ prapaśya",
        "meaning": "Let not this terrible form distress or bewilder you. Free from fear, with a joyful mind, behold again My other form.",
        "explanation": "Krishna reassures Arjuna not to be distressed or confused, promising to show his gentler form. This sloka reflects Krishna’s compassion. For Arjuna, this reassurance restores his confidence, enabling him to fight with a joyful heart, devoted to Krishna’s approachable form, aligning his warrior duties with divine love."
      },
      "slok50": {
        "sanskrit": "सञ्जय उवाच। इत्यर्जुनं वासुदेवस्तथोक्त्वा स्वकं रूपं दर्शयामास भूयः। आश्वासयामास च भीतमेनं भूत्वा पुनः सौम्यवपुर्महात्मा।।11.50।।",
        "transliteration": "sañjaya uvāca ity arjunaṁ vāsudevas tathoktvā svakaṁ rūpaṁ darśayām āsa bhūyaḥ, āśvāsayām āsa ca bhītam enaṁ bhūtvā punaḥ saumya-vapur mahātmā",
        "meaning": "Sanjaya said: Having spoken thus to Arjuna, Vasudeva showed His own form again, and the great soul, assuming a gentle form, consoled the terrified one.",
        "explanation": "Sanjaya narrates that Krishna reverts to his familiar form, comforting the frightened Arjuna. This sloka marks the transition to a gentler vision. For Arjuna, Krishna’s gentle form restores his emotional stability, enabling him to approach the war with renewed devotion, performing his duties as an offering to the compassionate divine."
      },
      "slok51": {
        "sanskrit": "अर्जुन उवाच। दृष्ट्वेदं मानुषं रूपं तव सौम्यं जनार्दन। इदानीमस्मि संनाद्धः सचेताः प्रकृतिं गतः।।11.51।।",
        "transliteration": "arjuna uvāca dṛṣṭvedaṁ mānuṣaṁ rūpaṁ tava saumyaṁ janārdana, idānīm asmi saṁnāddaḥ sacetāḥ prakṛtiṁ gataḥ",
        "meaning": "Arjuna said: Seeing this gentle human form of Yours, O Janardana, I am now composed and restored to my normal state.",
        "explanation": "Arjuna expresses relief at seeing Krishna’s gentle human form, regaining composure and normalcy. This sloka reflects his emotional recovery. For Arjuna, this restoration allows him to face the war with clarity and devotion, performing his warrior duties with a calm mind, anchored in Krishna’s approachable presence."
      },
      "slok52": {
        "sanskrit": "श्रीभगवानुवाच। सुदुर्दर्शमिदं रूपं दृष्टवानोंसि यन्मम। देवा अप्यस्य रूपस्य नित्यं दर्शनकाङ्क्षिणः।।11.52।।",
        "transliteration": "śrī bhagavān uvāca sudurdarśam idaṁ rūpaṁ dṛṣṭavān asi yan mama, devā apy asya rūpasya nityaṁ darśana-kāṅkṣiṇaḥ",
        "meaning": "The Supreme Lord said: This form of Mine you have seen is very difficult to behold; even the gods constantly long to see it.",
        "explanation": "Krishna emphasizes the rarity of the universal form, coveted even by gods. This sloka underscores the privilege Arjuna received. For Arjuna, this rarity deepens his gratitude, inspiring him to fight with devotion, knowing his warrior role is blessed by a vision unattainable by others, aligning with Krishna’s divine favor."
      },
      "slok53": {
        "sanskrit": "नाहं वेदैर्न तपसा न दानेन न चेज्यया। शक्य एवंविधो द्रष्टुं दृष्टवानोंसि मां यथा।।11.53।।",
        "transliteration": "nāhaṁ vedair na tapasā na dānena na cejyayā, śakya evaṁ-vidho draṣṭuṁ dṛṣṭavān asi māṁ yathā",
        "meaning": "Not by the Vedas, austerity, charity, or sacrifices can I be seen in this form as you have seen Me.",
        "explanation": "Krishna reiterates that no spiritual practice can grant this vision, emphasizing its exclusivity to Arjuna. This sloka highlights the role of divine grace. For Arjuna, this underscores his unique position, urging him to perform his warrior duties with humility and devotion, grateful for Krishna’s exceptional favor."
      },
      "slok54": {
        "sanskrit": "भक्त्या त्वनन्यया शक्य अहमेवंविधोऽर्जुन। ज्ञातुं द्रष्टुं च तत्त्वेन प्रवेष्टुं च परंतप।।11.54।।",
        "transliteration": "bhaktyā tv ananyayā śakya aham evaṁ-vidho ’rjuna, jñātuṁ draṣṭuṁ ca tattvena praveṣṭuṁ ca parantapa",
        "meaning": "By unalloyed devotion, O Arjuna, I can be known, seen, and truly entered, O scorcher of foes.",
        "explanation": "Krishna declares that only exclusive devotion allows one to know, see, and merge with him in truth. This sloka emphasizes bhakti as the ultimate path. For Arjuna, this clarifies that devotion is key to understanding Krishna, urging him to fight with single-minded devotion, ensuring his warrior actions lead to spiritual union."
      },
      "slok55": {
        "sanskrit": "मत्कर्मकृन्मत्परमो मद्भक्तः सङ्गवर्जितः। निर्वैरः सर्वभूतेषु यः स ममेति पाण्डव।।11.55।।",
        "transliteration": "mat-karma-kṛn mat-paramo mad-bhaktaḥ saṅga-varjitaḥ, nirvairaḥ sarva-bhūteṣu yaḥ sa mameti pāṇḍava",
        "meaning": "One who performs actions for Me, considers Me supreme, is devoted to Me, free from attachment, and without enmity toward any being, comes to Me, O Pandava.",
        "explanation": "Krishna concludes Chapter 11, stating that those who act for him, prioritize him, are devoted, detached, and free from enmity attain him. This sloka summarizes the path of devotion. For Arjuna, this provides a clear directive: perform warrior duties for Krishna, with devotion and detachment, ensuring liberation by aligning his actions with divine love and universal goodwill."
      }
    }
  }
]
